{
    "source": "CNBC",
    "category": "technology",
    "region": "north_america",
    "url": "https://www.cnbc.com/2025/03/26/23andme-co-founder-lashes-out-at-ceo-wojcicki-after-bankruptcy-filing.html",
    "title": "23andMe co-founder lashes out at CEO Wojcicki after bankruptcy filing, says board lacked oversight",
    "author": "Author not found",
    "description": "23andMe co-founder Linda Avey expressed frustration about the fall of the genetic testing company in a social media post.",
    "content": "In this article 23andMe co-founder Linda Avey took to social media on Wednesday to express frustration about the fate of the once-thriving genetic testing company that spiraled into Chapter 11 bankruptcy protection this week. Avey helped launch 23andMe in 2006 alongside Paul Cusenza and Anne Wojcicki, who resigned as CEO on Friday. The company went mainstream due to its popular at-home DNA testing kits, but struggled in recent years to generate recurring revenue, stand up viable therapeutics and research businesses and assuage privacy concerns. \"My time at the company was cut short in 2009, when my co-founder Anne convinced the board that she should run the company,\" Avey wrote in a post on social media site X. \"And I must be honest, I was frustrated with the direction the company took after that point.\" 23andMe, which reached a peak market cap of about $6 billion, was worth around $14 million as of market close on Wednesday. \"Without continued consumer-focused product development, and without governance, 23andMe lost its way, and society missed a key opportunity in furthering the idea of personalized health,\" Avey wrote. Last March, 23andMe's independent directors formed a special committee to evaluate the company's potential paths forward. All seven members resigned from the board in September and said they disagreed with Wojcicki about the \"strategic direction for the company.\" \"After my departure, she architected a majority vote for herself that eliminated board governance, even as it expanded over the following funding rounds,\" Avey said. \"For better or worse, the buck stopped with her. It came as no surprise when the board resigned last year.\" Wojcicki submitted multiple proposals to take the company private herself, but all were rejected, even after the company appointed new board members. The special committee \"unanimously determined to reject\" Wojcicki's most recent proposal earlier this month. If 23andMe's Chapter 11 plan is approved by the court, the company will \"actively solicit qualified bids\" over a 45-day process. Wojcicki still plans to pursue the company as an independent bidder, she said in a post on X on Monday. \"There are many cautionary tales buried in the 23andMe story,\" Avey said. \"Striking a balance between the desire for founder control and board oversight is essential; otherwise, why have a board at all?\" 23andMe did not immediately respond to CNBC's request for comment. WATCH: The rise and fall of 23andMe",
    "date": "Published Wed, Mar 26 20255:24 PM EDT",
    "content_length": 2476,
    "scraped_at": "2025-03-26T23:14:42.585324"
}