{
    "source": "CNBC",
    "category": "technology",
    "region": "north_america",
    "url": "https://www.cnbc.com/2025/03/26/former-intel-ceo-pat-gelsinger-joins-venture-firm-playground-global.html",
    "title": "Former Intel CEO Pat Gelsinger jumps to venture capital, joins Playground Global",
    "author": "Author not found",
    "description": "After retiring as Intel's CEO in December, Pat Gelsinger is becoming a general partner at early-stage venture firm Playground Global.",
    "content": "In this article After a tumultuous four years running Intel, Pat Gelsinger is going into venture capital. Gelsinger, who was ousted by the chipmaker in December, has joined Playground Global as a general partner. Started in 2015 by a group that included Android founder Andy Rubin, Playground focuses on early-stage investments in deep technology. Gelsinger told CNBC in an interview that he considered starting a venture firm with someone else, but opted to go with a structure that was already up and running. \"It's about scale,\" Gelsinger said, adding that starting from scratch would require \"10 hard years to get it.\" Before joining Playground, Gelsinger made a handful of private investments in startups including church outreach software startup Gloo, wearable maker Oura and artificial intelligence chip developer Fractile. At Playground, he'll join the board of portfolio company xLight, which is developing lasers for semiconductor manufacturing. Gelsinger is entering VC after 45 years in the technology industry. He spent three decades at Intel, becoming its first chief technology officer, and left in 2009 for data center hardware maker EMC. He later led server virtualization company VMware. In 2021, with Intel struggling from delays in releasing new generations of processors, he rejoined the company as CEO. Under Gelsinger, Intel focused on semiconductor fabrication, pouring money into an effort to develop chips for other companies. In 2024, the Biden administration awarded Intel up to $8.5 billion in CHIPS and Science Act funding as part of a plan to bring chip manufacturing back to the U.S. But Intel lost market share and got trounced by Nvidia in AI, prompting a massive selloff in its stock price. Intel's market cap plummeted by 60% in 2024, its worst performance in over five decades as a public company. In December, Intel announced Gelsinger's retirement. Earlier this month, the company said Lip-Bu Tan, a former CEO of Cadence Design Systems, will take over as CEO. Gelsinger isn't the first ex-Intel CEO to find his way to venture. His predecessor, Bob Swan, became a growth operating partner at venture firm Andreessen Horowitz in 2021, a few months after leaving the chipmaker. Gelsinger said he's looking forward to seeing this week's stock market debut of CoreWeave, which rents out Nvidia graphics processing units (GPUs) to Microsoft, Nvidia and OpenAI. \"Obviously they've been able to ride the wave of at-scale data centers for AI computing,\" Gelsinger said. \"There are multiple participants who are trying to do it. They did the best in that. The question is, what's their sustainable differentiation?\" Another technology of interest, Gelsinger said, is quantum computing. Unlike classical computers that store data in bits that are either on or off, quantum computers operate with quantum qubits, or qubits, that can be in both states at the same time. The hope among quantum bulls is that the technology might be able to perform certain calculations that have stymied today's machines. Amazon and Microsoft have both had their latest claims published in the journal Nature. Gelsinger said he looks forward to working on quantum computing with PsiQuantum, a Playground portfolio company. PsiQuantum is raising $750 million or more in fresh capital at a $6 billion valuation, with BlackRock planning to lead the round, CNBC confirmed. Reuters reported about the fundraising efforts on Monday. Quantum computers will be \"materially impacting computing structures before the end of this decade,\" Gelsinger said. In February, the U.S. Defense Advanced Research Projects Agency (DARPA) said it will evaluate whether quantum systems from PsiQuantum and Microsoft will be more valuable than they cost by 2033. The release didn't mention Intel, which announced its inaugural quantum chip, codenamed Tunnel Falls, in 2023. Gelsinger said he wishes the best to his former employer and Tan, its new leader. \"I certainly believe that Intel is critical for the semiconductor industry,\" he said. \"You need to design and manufacture leading-edge technology.\" — CNBC's Kate Rooney contributed to this report. WATCH: Intel shares fall after CEO leaves",
    "date": "Published Wed, Mar 26 20257:00 PM EDT",
    "content_length": 4179,
    "scraped_at": "2025-03-26T23:13:20.289838"
}