{
    "source": "VentureBeat",
    "category": "technology",
    "region": "north_america",
    "url": "https://venturebeat.com/ai/google-releases-most-intelligent-model-to-date-gemini-2-5-pro/",
    "title": "Google releases ‘most intelligent model to date,’ Gemini 2.5 Pro",
    "author": "Emilia David",
    "description": "Gemini 2.5 Pro is now available for Gemini Advanced users and is Google's most capable model with a 1 million token context window.",
    "content": "Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More Just a few months after releasing Gemini 2.0 and the rise of DeepSeek, Google announced its “most intelligent model” yet, Gemini 2.5, capable of reasoning and with better performance and accuracy. Gemini 2.5 comes three months after Google released its previously most intelligent model family, Gemini 2.0 which introduced reasoning and agentic use cases. This new model is available as Gemini 2.5 Pro (experimental) on Google’s AI Studio and for Gemini Advanced users on the Gemini chat interface. It will be available on Vertex AI soon. Koray Kavukcuoglu, CTO at Google DeepMind, said in a blog post that Gemini 2.5 represents the next step in Google’s goal of making “AI smarter and more capable of reasoning.” “Now, with Gemini 2.5, we’ve achieved a new level of performance by combining a significantly enhanced base model with improved post-training,” Kavukcuoglu wrote. “Going forward, we’re building these thinking capabilities directly into all of our models, so they can handle more complex problems and support even more capable, context-aware agents.” Like Gemini 2.0 and Gemini 2.0 Flash Thinking, Gemini 2.5 Pro “thinks” before it responds. The new model can handle multimodal input from text, audio, images, videos and large datasets. Gemini 2.5 Pro can also understand entire code repositories for coding projects. Gemini 2.5 Pro offers some of the largest context windows available for experimental models on Gemini. It ships with a 1 million token context window but will expand to 2 million tokens soon. Google AI Studio product manager Logan Kilpatrick posted on X that Gemini 2.5 Pro is “the first experimental model with higher rate limits + billing.” Google plans to release pricing for Gemini 2.5 models soon. Google said the model leads in advanced reasoning benchmark tests. The company said Gemini 2.5 Pro “leads in match and science benchmarks like GPQA and AIME 2025.” Kavukcuoglu said the model also scored “a state-of-the-art 18.8% across models without tool use on Humanity’s Last Exam,” a dataset aiming to capture human knowledge and reasoning. Gemini 2.5 Pro also performs strongly on coding tasks and scored better than Gemini 2.0 in specific benchmarks. Google noted the new model “excels at creating visually compelling web apps and agentic code applications, along with code transformation and editing.” Gemini 2.5 Pro enters the reasoning model fray in a significantly changed environment than Gemini 2.0 did in December. The release of DeepSeek’s reasoning large language model (LLM) DeepSeek-R1 showed that powerful models can perform well at a fraction of the training and compute cost. Furthermore, DeepSeek showed that open-source models can compete with more closed-source LLMs, such as OpenAI’s o1 and o3 models. Besides DeepSeek’s ever-expanding model offerings, Google has to compete with OpenAI’s reasoning models. While the newest model from OpenAI was GPT-4.5 —not a reasoning model—the company is still expected to develop more reasoning models soon. Gemini 2.5 is Google’s second new model this month. In March, the company released the latest version of its small language model, Gemma 3, which offered a 128,000 token context model and was best for use in on-the-go devices. If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
    "date": "March 25, 2025 1:17 PM",
    "content_length": 3688,
    "scraped_at": "2025-03-26T23:15:51.345525"
}