{
    "source": "CNBC",
    "category": "technology",
    "region": "north_america",
    "url": "https://www.cnbc.com/2025/03/26/the-concern-with-coreweaves-250000-nvidia-chips-ahead-of-its-ipo.html",
    "title": "The concern with CoreWeave’s 250,000 Nvidia chips ahead of its IPO",
    "author": "Author not found",
    "description": "CoreWeave sells access to Nvidia graphics processors as a service, allowing developers to rent chips by the hour so they can develop more advanced AI models.",
    "content": "In this article With 250,000 highly-desired Nvidia graphics processors, CoreWeave has become one of the most prominent \"GPU clouds,\" a status it hopes investors will value when it debuts on the public markets. But the world of artificial intelligence hardware is moving so quickly that it raises questions about how long those chips will remain on the cutting edge and in demand. It's a concern that could impact investor demand for shares of CoreWeave, one of the most anticipated IPOs in years. CoreWeave, which rents out remote access to computers based on Nvidia AI chips, said in a financial filing this month that most of its AI chips are from Nvidia's Hopper generation. Those chips, such as the H100, were state-of-the-art in 2023 and 2024. They were scarce as AI companies bought or rented all the chips they could get in the wake of OpenAI ushering in the generative AI age with the release of ChatGPT in late 2022. But these days, Nvidia CEO Jensen Huang says that his company's Hopper chips are getting blown out of the water by their successors – the Blackwell generation of GPUs, which have been shipping since late 2024. Hopper chips are \"fine\" for some circumstances but \"not many,\" Huang joked at Nvidia's GTC conference last week. \"In a reasoning model, Blackwell is 40 times the performance of Hopper. Straight up. Pretty amazing,\" Huang said. \"I said before that when Blackwell starts shipping in volume, you couldn't give Hoppers away.\" That's great for Nvidia, which needs to find ways to keep selling chips to the companies committed to the AI race, but it's bad news for GPU clouds like CoreWeave. That's because the New Jersey company models the future trajectory of its business based on how much it anticipates being able to rent Nvidia chips out for over the next five to six years. Huang may have been kidding, but Nvidia spent much of its event detailing just how much better its Blackwell chips are. In Nvidia's view, the best way to decrease the high cost of serving AI is by buying faster chips. Blackwell systems are in full production and shipping to customers, and Nvidia plans to introduce an upgraded version of Blackwell in late 2026. When new chips come out, the older chips — the kind CoreWeave has a quarter of a million of — go down in price, Huang said. So too does the price of renting them. Older chips don't just stop working when new ones come out. Most companies, including CoreWeave, plan to use Hopper chips for six years. But Nvidia is telling customers that its newer, faster chips are capable of producing more AI content, which leads to more revenues at a better margin for clouds. An H100 would have to be priced 65% lower per hour than an Nvidia Blackwell GB200 NVL system for the two systems to be competitive in price per output to a renter. Put another way, the H100 would have to rent at 98 cents per hour to match the price per output of a Blackwell rack system priced at $2.20 per hour per GPU, SemiAnalysis estimated, speaking generally about AI rentals. H100s rented for as much as $8 per hour back in 2023 and often required long commitments and lead times, but now, usage of those chips can be summoned in minutes with a credit card. Some services now offer rented H100 access for under $2 per hour. The industry could be entering a period where the useful life of AI chips is reduced, Barclays analyst Ross Sandler wrote in a note on Friday. He was focused on hyperscalers — Meta, Google and Amazon — but the trend affects smaller cloud providers like CoreWeave, too. \"These assets are becoming obsolete at a much more rapid pace given how much innovation and speed improvements happen with each generation,\" Sandler wrote. This threatens company earnings if they end up depreciating older equipment faster, he said. CoreWeave says that if there were to be changes to the \"significant\" assumptions it makes about the useful lifetime of its AI infrastructure, it could hurt its business or future prospects. CoreWeave has also borrowed nearly $8 billion to buy Nvidia chips and build its data centers, sometimes using the GPUs it amassed as collateral. Analysts and investors are also increasingly asking questions about the useful lifespan of these new AI systems and whether their financial depreciation schedules should be accelerated because the technology is improving so fast. CoreWeave says in its filing that it seeks to offer state-of-the-art infrastructure and says it will continue spending to expand and improve its data centers. \"Part of this process entails cycling out outdated components of our infrastructure and replacing them with the latest technology available,\" the New Jersey company said. \"This requires us to make certain estimates with respect to the useful life of the components of our infrastructure and to maximize the value of the components of our infrastructure, including our GPUs, to the fullest extent possible.\" CoreWeave and Nvidia maintain a good relationship. CoreWeave will certainly buy more chips from Nvidia, which owns more than 5% of the New Jersey company. \"We're super proud of them,\" Huang said last week. But Nvidia's road map for releasing new chips that it proudly touts will make their predecessors obsolete is a threat to CoreWeave's ambitions. WATCH: CoreWeave begins marketing IPO, targeting price range of $47-$55 per share: Report",
    "date": "Published Wed, Mar 26 20255:00 PM EDT",
    "content_length": 5355,
    "scraped_at": "2025-03-26T23:14:46.675919"
}