{
    "source": "CNBC",
    "category": "technology",
    "region": "north_america",
    "url": "https://www.cnbc.com/2025/03/26/trump-says-tesla-ceo-elon-musk-didnt-advise-on-auto-tariffs-despite-doge-role.html",
    "title": "Trump says Tesla CEO Elon Musk didn’t advise on auto tariffs 'because he may have a conflict'",
    "author": "Author not found",
    "description": "When asked by reporters whether the new tariffs would be good for Musk's autos business, Tesla, President Donald Trump said they may be \"net neutral or they may be good.\"",
    "content": "In this article After President Donald Trump said on Wednesday he would impose 25% tariffs on \"all cars that are not made in the United States,\" he said his key advisor, Tesla CEO Elon Musk, had not weighed in on the matter, \"because he may have a conflict.\" He added that Musk had never \"asked me for a favor in business whatsoever.\" Musk serves as a senior advisor to Trump, having earlier contributed $290 million to propel him back to the White House. While Musk remains at the helm of his companies, including SpaceX and Tesla, he is also leading the Department of Government Efficiency (DOGE), which is an effort to slash federal government spending, personnel and consolidate or eliminate various federal agencies and services. Earlier this month, Trump turned the South Lawn of the White House into a temporary Tesla showroom. The company delivered five of its electric vehicles there for the president to inspect after he had declared, in a post on Truth Social, that he would buy a Tesla to show support for Musk and the business. Musk stood by his side while Trump called the vehicles \"beautiful\" and praised the unorthodox design of the angular, steel Tesla Cybertruck. When asked by reporters whether the new tariffs would be good for Musk's autos business, Tesla, Trump said they may be \"net neutral or they may be good.\" He pointed to Tesla's vehicle assembly plants in Austin, Texas and Fremont, California and opined that, \"anybody that has plants in the United States — it's going to be good for them.\" Tesla recently wrote, in a letter to the U.S. Trade Representative, that \"even with aggressive localization\" of its supply chain domestically, \"certain parts and components are difficult or impossible to source within the United States.\" The company urged the USTR to \"consider the downstream impacts of certain proposed actions taken to address unfair trade practices.\" Tesla and other automakers commonly buy headlamps, automotive glass, brakes, body panels, suspension parts, and printed circuit boards for various electrical systems in their vehicles from foreign suppliers in Mexico, Canada and China, especially. Musk and Tesla did not immediately respond to a request for comment about how the new 25% tariffs may impact their business. Tesla faces an onslaught of competition with more automakers selling fully electric models than ever before. However, the company's most formidable rival in battery electric vehicles, BYD in China, has never been authorized to sell its electric cars in the United States. Domestic automakers including General Motors, Ford, Rivian and Tesla saw shares declining slightly after hours following the latest tariffs announcement.",
    "date": "Published Wed, Mar 26 20257:31 PM EDT",
    "content_length": 2690,
    "scraped_at": "2025-03-26T23:14:22.990223"
}