{
    "source": "CNBC",
    "category": "technology",
    "region": "north_america",
    "url": "https://www.cnbc.com/2025/03/26/trump-says-he-may-reduce-china-tariffs-to-help-close-a-tiktok-deal.html",
    "title": "Trump says he may reduce China tariffs to help close a TikTok deal",
    "author": "Author not found",
    "description": "\"Maybe I'll give them a little reduction in tariffs or something to get it done,\" President Donald Trump said about a deal involving TikTok's U.S. operations",
    "content": "President Donald Trump said he may reduce tariffs on China to facilitate a deal that would result in ByteDance selling the U.S. operations of TikTok. China \"is going to have to play a role\" in approving a TikTok-related divestiture, Trump said in a press conference Wednesday. \"Maybe I'll give them a little reduction in tariffs or something to get it done,\" Trump said. \"TikTok is big, but every point in tariffs is worth more than TikTok.\" Although a national security law requires ByteDance to divest TikTok's U.S. operations or face an effective ban in the country, Trump in January signed an executive order that delayed the deadline for a deal to April 5. Trump has previously said that he wants the U.S. to maintain a 50% ownership position in TikTok via a joint venture. It's possible he will extend the TikTok deadline again, Trump said Wednesday. \"We're going to have a form of a deal, but if it's not finished, it's not a big deal,\" Trump said. \"We'll just extend it.\" Vice President JD Vance told NBC News earlier this month that he was confident that a TikTok-related deal would happen by the April deadline. \"There will almost certainly be a high-level agreement that I think satisfies our national security concerns, allows there to be a distinct American TikTok enterprise,\" Vance said. WATCH: TikTok bid is 'in active dialogue' with Trump administration. ",
    "date": "Published Wed, Mar 26 20257:06 PM EDT",
    "content_length": 1372,
    "scraped_at": "2025-03-26T23:14:28.684105"
}