{
    "source": "CNBC",
    "category": "technology",
    "region": "north_america",
    "url": "https://www.cnbc.com/2025/03/26/us-blacklists-50-chinese-companies-in-bid-to-curb-beijings-ai-chip-capabilities.html",
    "title": "U.S. blacklists over 50 Chinese companies in bid to curb Beijing's AI, chip capabilities",
    "author": "Author not found",
    "description": "The export restrictions come at a time when tensions between Washington and Beijing have been rising with the Trump administration ratcheting up tariffs against China.",
    "content": "The U.S. on Tuesday added dozens of Chinese tech companies to its export blacklist in its first such effort under the Donald Trump administration, as it doubles down on curtailing Beijing's artificial intelligence and advanced computing capabilities. The U.S. Department of Commerce's Bureau of Industry and Security added 80 organizations to an \"entity list,\" with more than 50 from China, barring American companies from supplying to those on the list without government permits. The companies were blacklisted for allegedly acting contrary to U.S. national security and foreign policy interests, the agency said, as part of its efforts to further restrict Beijing's access to exascale computing tech, which can process vast amounts of data at very high speeds, as well as quantum technologies. Dozens of Chinese entities were targeted for their alleged involvement in developing advanced AI, supercomputers and high-performance AI chips for military purposes, the Commerce Department said, adding that two firms were supplying to sanctioned entities such as Huawei and its affiliated chipmaker HiSilicon. It blacklisted 27 Chinese entities for acquiring U.S.-origin items to support China's military modernization and seven firms for helping advance China's quantum technology capabilities. Among the organizations in the \"entity list\" were also six subsidiaries of Chinese cloud-computing firm Inspur Group, which had been blacklisted by the Joe Biden administration in 2023. China's foreign ministry said late Wednesday it \"strongly condemns\" the export restrictions while urging the U.S. to \"stop generalizing national security,\" Reuters reported. The latest additions \"cast an ever-widening net aimed at third countries, transit points and intermediaries,\" said Alex Capri, a senior lecturer at National University of Singapore and author of \"Techno-Nationalism: How It's Reshaping Trade, Geopolitics and Society.\" Chinese firms have managed to gain access to U.S. strategic dual-use technologies via certain third parties, he said, referring to loopholes that have allowed Chinese companies access to U.S. technologies despite restrictions. \"U.S. officials will continue to step up tracking and tracing operations aimed at the smuggling of advanced semiconductors made by Nvidia and Advanced Micro Devices,\" he said. The expanded export restrictions come at a time when tensions between Washington and Beijing have been rising with the Trump administration ratcheting up tariffs against China. The rapid rise of Chinese AI startup DeepSeek has boosted the adoption of open-source low-cost AI models in China, putting pressure on leading U.S. competitors with higher-cost, proprietary models. The Biden administration imposed sweeping export controls against China, encompassing everything from semiconductors to supercomputers under the so-called \"small yard, high fence\" policy. The approach aims to place restrictions on a small number of technologies with significant military potential while maintaining normal economic exchange in other areas. Under Secretary of Commerce for Industry and Security Jeffrey I. Kessler said the agency was \"sending a clear, resounding message\" that the Trump administration will prevent U.S. technologies from \"being misused for high performance computing, hypersonic missiles, military aircraft training, and UAVs (unmanned aerial vehicle) that threaten our national security.\" \"The entity list is one of many powerful tools at our disposal to identify and cut off foreign adversaries seeking to exploit American technology for malign purposes,\" he added. Inspur Group and Huawei did not immediately respond to CNBC's requests for comment.",
    "date": "Published Wed, Mar 26 202512:56 AM EDT",
    "content_length": 3684,
    "scraped_at": "2025-03-26T23:14:58.443454"
}