{
    "source": "CNBC",
    "category": "technology",
    "region": "north_america",
    "url": "https://www.cnbc.com/2025/03/26/utah-adopts-child-safety-law-requiring-apple-google-to-verify-user-ages.html",
    "title": "Utah governor signs online child safety law requiring Apple, Google to verify user ages",
    "author": "Author not found",
    "description": "Utah's signing of the law is a political win for Meta, which has been aiming to put more political and regulatory pressure on Apple. ",
    "content": "Utah Gov. Spencer Cox on Wednesday signed a bill that requires Apple and Google's mobile app stores to verify user ages and require parental permission for those under 18 to use certain apps, the governor's spokesperson told CNBC. The law is the first of its kind in the nation and represents a significant shift in how user ages are verified online, and says it's the responsibility of mobile app stores to verify ages — putting the onus on Apple and Google, instead of individual apps like Instagram, Snapchat and X, to do age checks. The App Store Accountability Act, or S.B. 142, could also kick off a wave of other states, including South Carolina and California, passing similar legislation. The law is designed to protect children, who may not understand apps' terms of services and, therefore, can't agree to them, said Todd Weiler, a Republican state senator and the bill's sponsor. \"For the past decade or longer, Instagram has rated itself as friendly for 12 year olds,\" Weiler said at a state senate committee hearing in January. \"It's not.\" Apple and Google will need to request age verification checks when someone makes a new account in the state. That will most likely have to be done using credit cards, according to Weiler. If someone under 18 opens an app store account, Apple or Google will have to link it to a parent's account or request additional documentation. Parents will have to consent to in-app purchases. Neither company immediately returned a request for comment on Wednesday. Meta, X and Snap said on Wednesday they applauded Cox and Utah for passing the bill, and encouraged other states to consider similar approaches. \"Parents want a one-stop-shop to oversee and approve the many apps their teens want to download, and Utah has led the way in centralizing it within a device's app store,\" the companies said in a joint statement. \"This approach spares users from repeatedly submitting personal information to countless individual apps and online services.\" The Utah law is slated to take effect on May 7, but it is expected to be challenged in a legal fight over its validity. The state passed a similar age-verification law related to pornography in 2023, and arguments whether that law violates free speech were heard by the Supreme Court in January. Utah's adoption of the law is also the latest shot in a long-running skirmish between Facebook-parent Meta and Apple. Meta, which supported the bill, argues that app stores are the best place to do age verification on minors, instead of on individual apps. Meta has recently shifted its policy strategy to seek strategic advantages for itself and shift antitrust scrutiny onto Apple, CNBC reported last month. Apple says it makes the most sense for apps themselves to do age verification, and that due to privacy reasons, it doesn't want to collect the data needed for age verification. The \"right place to address the dangers of age-restricted content online is the limited set of websites and apps that host that kind of content,\" according to a paper Apple posted on its website last month. Utah's bill raises privacy and safety risks, Google said in a blog post on March 12. \"There are a variety of fast-moving legislative proposals being pushed by Meta and other companies in an effort to offload their own responsibilities to keep kids safe to app stores,\" Google Director of Public Policy Kareem Ghanem wrote. \"These proposals introduce new risks to the privacy of minors, without actually addressing the harms that are inspiring lawmakers to act.\" The push for age verification comes after Meta CEO Mark Zuckerberg, X CEO Lina Yaccarino, Snap CEO Evan Spiegel and other social media CEOs appeared before Congress in January 2024 for a hearing focused on online child safety. There, lawmakers criticized the companies, saying they failed to stem online child sexual exploitation on social media apps and needed to do more. Zuckerberg appeared rattled during the hearing after senators told him he had \"blood on your hands.\" However, the legislation that came out of the meeting, the Kids Online Safety Act, failed to advance in Congress late last year. Meta has also been hit with a number of lawsuits filed by states relating to the well-being of children on Facebook and Instagram. -- CNBC's Jonathan Vanian contributed to this report. WATCH: Apple delays AI improvements to Siri until 2026: Here's what to know",
    "date": "Published Wed, Mar 26 20255:43 PM EDT",
    "content_length": 4409,
    "scraped_at": "2025-03-26T23:14:37.504949"
}