{
    "source": "CNBC",
    "category": "technology",
    "region": "north_america",
    "url": "https://www.cnbc.com/2025/03/25/how-to-delete-23andme-genetic-data.html",
    "title": "With 23andMe entering bankruptcy, here's how to delete your genetic data",
    "author": "Author not found",
    "description": "Now that 23andMe has filed for bankruptcy, another company could take control of its genetic database. ",
    "content": "23andMe has officially filed for Chapter 11 bankruptcy protection, which means its assets — including its vast genetic database — will soon be up for sale. The company continues to sell its at-home DNA testing kits, allowing consumers to get insight into their family histories and genetic profiles. DNA data is particularly sensitive because each person's sequence is unique, meaning it can never be fully anonymized, according to the National Human Genome Research Institute. If genetic data falls into the hands of bad actors, it could be used to facilitate identity theft, insurance fraud or other crimes. 23andMe has been plagued by privacy concerns in recent years after hackers accessed the information of nearly 7 million customers in October 2023. As part of the bankruptcy process, the company said it will seek a partner that shares its commitment to customer data privacy, and that there will be no changes to how it stores, manages and protects data through the sale process. \"Our users' privacy and data are important considerations in any transaction, and we remain committed to our users' privacy and to being transparent with our customers about how their data is managed,\" the company said in an FAQ page about the bankruptcy filing. \"Any buyer of 23andMe will be required to comply with applicable law with respect to the treatment of customer data.\" Still, experts and officials are urging 23andMe customers to proceed with caution. California Attorney General Rob Bonta on Friday issued a consumer alert, encouraging residents to consider deleting their genetic data from 23andMe, which is based in his home state. \"Given 23andMe's reported financial distress, I remind Californians to consider invoking their rights and directing 23andMe to delete their data and destroy any samples of genetic material held by the company,\" Bonta said in the release. Adrianus Warmenhoven, who serves on the security advisory board at NordVPN, described genetic data as the \"blueprint of your entire biological profile.\" He encouraged consumers to delete their information and be mindful of the companies they chose to share it with going forward. \"Monitor your digital footprint regularly, and you can also sign up for credit monitoring or identity theft protection services,\" Warmenhoven said in a statement to CNBC. \"Revoke permissions you no longer require, shut down any account you don't use, and learn about how your data is used.\" 23andMe said customers can still delete their account and accompanying data. Here's how: At this point, your personal information and your account will be permanently deleted from 23andMe, according to the deletion email from the company. Additionally, your data will not be used in any future research projects, and any personal samples the company was storing will be discarded. Correction: A prior version of this story had incorrect information about what happens to downloaded data if you delete your account. WATCH: The rise and fall of 23andMe",
    "date": "Published Tue, Mar 25 20252:37 PM EDT",
    "content_length": 2995,
    "scraped_at": "2025-03-26T23:15:09.525618"
}