[
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/03/tsmc-making-a-risky-bet-on-maga/",
        "title": "TSMC making a risky bet on MAGA",
        "author": "by\nStanley Chao",
        "description": "Succumbing to President Donald Trump’s blatant “pay for protection” extortion, Taiwan Semiconductor Manufacturing Company (TSMC) recently pledged US$100",
        "content": "Succumbing to President Donald Trump’s blatant “pay for protection” extortion, Taiwan Semiconductor Manufacturing Company (TSMC) recently pledged US$100 billion to build additional chip factories in the American state of Arizona (on top of the three it already has there). The move has no basis in business logic. Rather, TSMC is gambling that appeasing Trump’s ego and the “America First” agenda will convince the president that a sovereign Taiwan also benefits America’s interests. Any bet on Trump, however, is a precarious game of chance, and this one may inevitably end up putting Taiwan’s fate in greater jeopardy. Tawain will need to summon its best poker skills to survive the vagaries emanating from the White House. TSMC’s prowess comes from manufacturing 90% of the world’s most advanced semiconductor chips, which are used in artificial intelligence, quantum computing and defense systems. The global dependence on this monopoly provides a “silicon shield” against potential aggression by China, which claims the self-governed island as part of its territory. Trump wants to make chips on US soil to reduce the country’s dependence on foreign supply chains, create high-paying local manufacturing jobs and protect national security interests. Combine Taiwan’s competitive advantage with America’s economic and military leverage, and the result is an awkward bumper sticker: “Make America Great Again (by making Taiwanese chips).” TSMC unconvincingly claims that its existing operations in Arizona are the product of sound business principles, not political pressure. Having visited the construction sites and conversed with TSMC employees, I can report that the project continues to be fraught with delays, cost overruns, skilled labor shortages, disgruntled workers, logistical inefficiencies and an immature supply chain ecosystem. The foundry’s Arizona operations will undoubtedly bleed money for the foreseeable future. Just ask Morris Chang, TSMC’s founder and former CEO, who admitted that the cost of making chips in Arizona was at least 50% higher than in a Taiwanese foundry. Tellingly, the company’s stock price sank almost 5% the same day Trump announced the latest factory deal. If logistics and profitably were TSMC’s primary considerations, it surely would put more factories in Kumamoto, Japan. Its two factories there were built on schedule and on budget. Unlike Arizona, Japan has an existing semiconductor ecosystem with experienced chip engineers and manufacturers along with proven logistics and supply chains. TSMC’s Japanese factories also have the full support of the community, including the local government, public schools and even small businesses. I visited Kumamoto last year and found supermarkets stocked with common Taiwanese foods like chicken feet, pig liver and live fish as they prepared to welcome TSMC’s Taiwanese workers. Taipei would be wise to consider Trump’s true priorities, a task that admittedly is easier said than done. We all know how Trump’s mood swings wildly from day to day. Consider Mexico and Canada: tariffs on, tariffs off. Right now, Trump’s line on Taiwan seems to be that it treats the US unfairly – it “stole our chip business,” he alleged – but that its leading chip company, TSMC, nevertheless is on the level. “You’re not in a good position,” Trump vociferated during his infamous dressing-down of Ukrainian President Volodymyr Zelensky at the White House. “You don’t have the cards right now.” In the end, what makes Taiwan so different than Ukraine in the eyes of Trump? Does Trump really care about Taiwan’s long-term autonomy? Once Taiwan surrenders its high-tech advantage to the US, would Trump be willing to barter Taiwan off to Beijing for, say, a big trade deal? The odds are that TSMC has only temporarily appeased Trump with its latest pledge. Trump might again turn on TSMC and make more demands. For instance, he may continue to pressure TSMC to take over Intel’s failing chip plants in the US, which would require tens of billions of dollars and many years to overhaul and modernize. Already, the evidence suggests that TSMC’s deference isn’t paying off. Sources within the Trump administration say that it still may impose tariffs of up to 100% on Taiwanese chip imports. And Trump is calling on Congress to scrap the CHIPS Act, which was passed in 2022 under the Biden administration to subsidize domestic chip manufacturing. It’s thus unclear whether TSMC will receive the $6.6 billion it is promised under the act. TSMC’s deal still needs final approval from the Taiwanese government. Passage is not a slam dunk. Former president of Taiwan May Ying-jeou claimed the deal threatened to create a “major national security crisis” and would have negative consequences regarding “Taiwan’s future geopolitical position.” Many Taiwanese citizens are wondering whether the government will capitulate to Trump’s tough talk or choose instead to protect Taiwan’s chip manufacturing monopoly and safeguard its geopolitical importance in the world. If there is a silver lining here, it is that Taiwan is accustomed to making difficult decisions. Remember, this is a self-governing archipelago that has formal relations with only 13 nations, lacks a seat in the United Nations and has been on the brink of war for two generations with the second-most-powerful country in the world. Taiwan’s very existence as a self-governing entity requires a willingness to live on the edge. One can thus imagine a scenario where Taiwan takes a page from Trump’s playbook, investing $100 billion while covertly holding back on the most advanced chip technologies or, better yet, delaying the overall project. Maybe Taiwan and TSMC can bluff their way through the next four years. Maybe the Trump administration will turn a blind eye or fail to track TSMC’s compliance. Maybe. But Tawain ultimately will need to convince Trump that it has additional cards to play. Stanley Chao was previously executive vice-president of US chipmaker Kingston Technology and is the author of “Selling to China: A Guide for Small and Medium-Sized Businesses.”  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "March 24, 2025",
        "content_length": 6236,
        "language": "en",
        "scraped_at": "2025-03-26T23:09:45.153010"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/03/chinas-naura-rising-to-the-chip-making-equipment-challenge/",
        "title": "China’s Naura rising to the chip-making equipment challenge",
        "author": "by\nScott Foster",
        "description": "Naura Technology, China’s top semiconductor production equipment maker, has risen to 6th place in the global ranking, according to Shanghai-based technology consulting firm CINNO Research. Only industry giants ASML, Applied Materials, Lam Research, Tokyo Electron and KLA now lead Naura in terms of total sales.",
        "content": "Naura Technology, China’s top semiconductor production equipment maker, has risen to 6th place in the global ranking, according to Shanghai-based technology consulting firm CINNO Research. Only industry giants ASML, Applied Materials, Lam Research, Tokyo Electron and KLA now lead Naura in terms of total sales.",
        "date": "March 17, 2025",
        "content_length": 311,
        "language": "en",
        "scraped_at": "2025-03-26T23:09:46.995471"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/03/us-chip-making-dream-awakes-to-labor-crisis-reality/",
        "title": "US chip-making dream awakes to labor crisis reality",
        "author": "by\nMichael Moats",
        "description": "Semiconductors power nearly every aspect of modern life – cars, smartphones, medical devices and even national defense systems. These tiny but essential",
        "content": "Semiconductors power nearly every aspect of modern life – cars, smartphones, medical devices and even national defense systems. These tiny but essential components make the information age possible, whether they’re supporting lifesaving hospital equipment or facilitating the latest advances in artificial intelligence. It’s easy to take them for granted, until something goes wrong. That’s exactly what happened when the Covid-19 pandemic exposed major weaknesses in the global semiconductor supply chain. Suddenly, to name just one consequence, new vehicles couldn’t be finished because chips produced abroad weren’t being delivered. The semiconductor supply crunch disrupted entire industries and cost hundreds of billions of dollars. The crisis underscored a hard reality: The US depends heavily on foreign countries – including China, a geopolitical rival – to manufacture semiconductors. This isn’t just an economic concern; it’s widely recognized as a national security risk. That’s why the US government has taken steps to invest in semiconductor production through initiatives such as the CHIPS and Science Act, which aims to revitalize American manufacturing and was passed with bipartisan support in 2022. While President Donald Trump has criticized the CHIPS and Science Act recently, both he and his predecessor, Joe Biden, have touted their efforts to expand domestic chip manufacturing in recent years. Yet, even with bipartisan support for new chip plants, a major challenge remains: Who will operate them? The push to bring semiconductor manufacturing back to the US faces a significant hurdle: a shortage of skilled workers. The semiconductor industry is expected to need 300,000 engineers by 2030 as new plants are built. Without a well-trained workforce, these efforts will fall short, and the US will remain dependent on foreign suppliers. This isn’t just a problem for the tech sector – it affects every industry that relies on semiconductors, from auto manufacturing to defense contractors. Virtually every military communication, monitoring and advanced weapon system relies on microchips. It’s not sustainable or safe for the US to rely on foreign nations – especially adversaries – for the technology that powers its military. For the US to secure supply chains and maintain technological leadership, I believe it would be wise to invest in education and workforce development alongside manufacturing expansion. Filling this labor gap will require a nationwide effort to train engineers and technicians in semiconductor research, design and fabrication. Engineering programs across the country are taking up this challenge by introducing specialized curricula that combine hands-on training with industry-focused coursework. Future semiconductor workers will need expertise in chip design and microelectronics, materials science and process engineering, and advanced manufacturing and clean room operations. To meet this demand, it will be important for universities and colleges to work alongside industry leaders to ensure students graduate with the skills employers need. Offering hands-on experience in semiconductor fabrication, clean-room-based labs and advanced process design will be essential for preparing a workforce that’s ready to contribute from Day 1. At Missouri University of Science of Technology, where I am the chair of the materials science and engineering department, we’re launching a multidisciplinary bachelor’s degree in semiconductor engineering this fall. Other universities across the US are also expanding their semiconductor engineering options amid strong demand from both industry and students. Rebuilding domestic semiconductor manufacturing isn’t just about national security – it’s an economic opportunity that could benefit millions of Americans. By expanding training programs and workforce pipelines, the US can create tens of thousands of high-paying jobs, strengthening the economy and reducing reliance on foreign supply chains. And the race to secure semiconductor supply chains isn’t just about stability – it’s about innovation. The US has long been a global leader in semiconductor research and development, but recent supply chain disruptions have shown the risks of allowing manufacturing to move overseas. If the US wants to remain at the forefront of technological advancement in artificial intelligence, quantum computing and next-generation communication systems, it seems clear to me it will need new workers – not just new factories – to gain control of its semiconductor production. Michael Moats is professor of metallurgical engineering, Missouri University of Science and Technology This article is republished from The Conversation under a Creative Commons license. Read the original article.  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "March 15, 2025",
        "content_length": 4908,
        "language": "en",
        "scraped_at": "2025-03-26T23:09:52.198974"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/03/four-chinese-firms-look-to-shake-up-tech-world-in-deepseeks-wake/",
        "title": "Four Chinese firms look to shake up tech world in DeepSeek’s wake",
        "author": "by\nNaresh R. Pandit and Feng Wan and Peter Williamson",
        "description": "The success of the Chinese AI firm DeepSeek shocked financial markets and major US tech firms in January 2025. But it shouldn’t have come as such a",
        "content": "The success of the Chinese AI firm DeepSeek shocked financial markets and major US tech firms in January 2025. But it shouldn’t have come as such a surprise. For decades now, plenty of companies in China have been developing competitive advantages that enable them to make remarkable progress. This involves a strategy different from that of many big Western firms that rely on things like branding (like Apple) and exclusive technology (like Nvidia) to succeed. Instead, these less-well-known Chinese companies have focused on delivering more innovation faster and cheaper. And our research suggests that they have been able to achieve this by being much more adaptable in how they do business. So DeepSeek may not be alone as a gamechanger. Here are four more Chinese firms looking to disrupt the global economy in similar ways. DJI Innovations makes low-cost drones that produce aerial photography and videos. Founded in 2006 by Frank Wang (who became Asia’s youngest tech billionaire at the age of 36), the company develops camera technology and software as well as engineering drone systems used in industries including agriculture and defence. Its technology has been used in the filming of shows like Better Call Saul and Game of Thrones. DJI’s cutting-edge research and development involves highly sophisticated automated assembly lines that make more for less cost. This has led to rapid international expansion and foreign partnerships, making the company a dominant player that is tough to compete against. A DJI Innovations spin-off founded in 2016, Unitree Robotics specializes in high-performance quadruped and humanoid robots as well as components such as robotic arms. These products incorporate artificial intelligence and have many applications in consumer and industrial markets. But in a sector where progress can be slower than we might expect, Unitree’s rapid development cycles – from initial idea, through development and testing, to commercialization – give it an edge over rivals. This cycle speed is achieved through highly digitized processes, and large highly skilled development teams, which place it ahead of many rivals. For example, in 2024 one of the firm’s humanoid robots (already capable of soldering and cooking) set a new walking speed record of 3.3 meters per second. And in early 2025 the company’s robots performed a traditional Yangko dance alongside humans. Game Science is a Chinese video games firm founded in 2014. Its August 2024 release of Black Myth: Wukong, an advanced role-playing video game inspired by the classic Chinese novel Journey to the West, is one of the fastest-selling games of all time, with revenues of over US$1.1 billion and over 25 million copies sold to date. This success demonstrates the firm’s ability to create products that incorporate Chinese cultural elements that also appeal to global tastes. This is partly down to the company’s prolific data analysis capabilities, allowing it to incorporate vast quantities of feedback from players into its design decisions. That input gives it a big advantage over competitors, moving beyond the old Chinese export model of making cheap versions of western products. Instead, it offers innovative products that are also cheaper, contributing to China’s growing presence in the global gaming market. Yonyou was set up in 1988 to offer business and accounting software to Chinese companies. It now dominates the market in the country and has spread to Taiwan, Singapore, Malaysia, Thailand and Indonesia. Beyond Asia is the next goal. The firm’s success hinges on its ability to optimize its products for local customers while avoiding premium pricing. It understands that business systems vary geographically according to things like local culture, customs and consumer taste. Yonyou’s proposition is simple but very effective: to develop software that varies to serve idiosyncratic local needs, knowing that this will work better than the one-size-fits-all products available from global competitors. This has led it to create popular and specific software for industries including retail, education, finance and construction. The company’s expertise lies in challenging the conventional wisdom that customized products come at a high cost. Each of these four Chinese firms clearly understands the advantages to be gained from innovative technology and good strategy, which are both within their control. What they cannot control are the geopolitical factors to do with international trade and the global economy – which makes the future uncertain. But continuing to work to their particular strengths will make it likely that they – and plenty of others like them – go on disrupting global markets. Naresh R. Pandit is a professor of international business at the University of East Anglia; Feng Wan is an associate professor of management at Zhejiang University; and Peter Williamson is an honorary professor of international management at Cambridge Judge Business School. This article is republished from The Conversation under a Creative Commons license. Read the original article.  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "March 13, 2025",
        "content_length": 5234,
        "language": "en",
        "scraped_at": "2025-03-26T23:10:00.934911"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/03/after-deepseek-chinas-manus-the-hot-new-ai-under-the-spotlight/",
        "title": "After DeepSeek: China’s Manus – the hot new AI under the spotlight",
        "author": "by\nJeff Pao",
        "description": "China's Manus has surprised technology sector by demonstrating its ability to complete tasks traditionally performed by white-collar workers",
        "content": "Manus, a newly launched artificial intelligence (AI) agent in China, has surprised the global technology sector by demonstrating its ability to complete tasks traditionally performed by white-collar workers. According to its website, Manus, developed by Beijing-based Chinese startup Butterfly Effect, can perform various tasks in seconds, such as planning a trip to Japan, finding a new home overseas and analyzing financial statements. Peak Ji, chief scientist and co-founder of Butterfly Effect, said the company developed its agentic AI model using Antropic’s Claude and Alibaba’s Qwen. Claude, developed by the San Francisco-based Antropic, is well known for its strong coding ability. Users can ask Claude to write codes for use in AI agents. On Tuesday, Alibaba Cloud and Butterfly Effect reached a strategic cooperation agreement to develop AI products for general use. To understand what Manus offers users, one should first understand the difference between generative AI and agentic AI. Generative AI models include ChatGPT and DeepSeek, which are large language models (LLMs) that can understand human languages. They can reason, chat with people, read and write and create images, videos, and charts. LLM is like a brain, while an AI agent can be compared to a human body that can perform tailor-made and repetitive tasks such as extracting and analyzing industry-specified data. To build an AI agent, a company must ask its experienced staff to write a workflow. It must  subscribe to software, and hire programmers to write codes and compile data so analysts can use the database. This procedure does not require any high-end chips or sophisticated AI training. Still, it is costly to small and medium enterprises (SMEs) and is usually not welcomed by staff who don’t want to hand their skills to machines. Now, Manus offers users a one-click button to complete each task. It claims to be the world’s first fully autonomous AI. Its website slogan is “Leave it to Manus.” In its promotional footage released on March 5, Butterfly Effect co-founder Xiao Hong demonstrated the AI agent’s abilities to analyze 10 resumes, search a New York property for sale within a given budget, and calculate the correlation of Nvidia, Marvell Technology and Taiwan Semiconductor Manufacturing Co (TSMC) stocks. The 32-year-old entrepreneur said Manus beat OpenAI’s Deep Research regarding GAIA, a benchmark for general AI assistants. “This wouldn’t be possible without the amazing open-source community, which is why we’re committed to giving back,” said Xiao. “Manus operates as a multi-agent system powered by several distinct models. So later this year, we’re going to open source some of these models, specifically post-trained for Manus, inviting everyone to explore this agentic future together.” Xiao said the name Manus comes from a famous Latin motto, Mens et Manus, which means “mind and hand.” “It embodies the belief that knowledge must be applied to make a meaningful impact on the world, and this is precisely the promise of Manus AI – to extend your capabilities, amplify your impact, and be the hand that brings your mind’s vision into reality,” he said. Within a day of Butterfly Effect’s launching Manus on March 5, the company’s server had been overloaded as global AI fans used Manus to perform various tests. In a statement, Butterfly Effect co-founder Zhang Tao apologized to the public and said the company underestimated the strong market response to its AI agent. He said Manus is a preliminary product, like a newborn baby, and remains far from what the company wants to deliver. After graduating from the Huazhong University of Science and Technology in 2015, Xiao founded Nightingale Technology, which received strategic investment from Tencent Holdings and some venture capital funds. In June 2022, he founded Butterfly Effect with the support of ZhenFund, a Beijing-based venture capital firm founded by New Oriental co-founders Bob Xu and Victor Wang. ZhenFund is one of the largest angel investors in China. In March 2023, Butterfly Effect launched an all-in-one AI personal assistant called Monica.im. According to its website, Monica.im now connects to OpenAI o3-mini, DeepSeek R1, GPT-4o, Claude 3.7, and Gemini 2.0. Last year, the company raised new funding from Tencent Holdings and HongShan Capital Group. Read: China explores military applications with DeepSeek  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "March 12, 2025",
        "content_length": 4529,
        "language": "en",
        "scraped_at": "2025-03-26T23:10:04.236601"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/03/china-all-in-on-risc-v-open-source-chip-design/",
        "title": "China all in on RISC-V open-source chip design",
        "author": "by\nScott Foster",
        "description": "It’s “RISC on” in China. The Chinese government plans to promote the nationwide use of open-source RISC-V integrated circuit (IC) design standards under",
        "content": "It’s “RISC on” in China. The Chinese government plans to promote the nationwide use of open-source RISC-V integrated circuit (IC) design standards under new guidelines that may be announced in the next few weeks, Reuters reported. China’s Cyberspace Administration, Ministry of Industry and Information Technology, Ministry of Science and Technology and National Intellectual Property Administration are all reportedly involved, according to the Reuters report. If so, it would give a big push forward to a trend that has been gathering pace for several years now and a big pushback against the US government, which, under presidents Trump 1.0, Biden and Trump 2.0, has consistently sought to police the global semiconductor industry and stifle its development in China. Hong Kong’s government is also promoting RISC-V (pronounced “risk-five”) to make a place for itself as one of China’s IC design centers. The establishment of a Hong Kong AI Research and Development Institute will complement the policy. Writing under the headline “The Role of RISC-V in Shaping the Future” in EE Times, Frankwell Lin, CEO of Taiwan’s Andes Technology, noted that: AI’s expanding influence – spanning applications like voice recognition, imaging, and natural language processing – underscores the critical role of advanced semiconductors. RISC-V, with its open architecture and highly programmable architecture, is revolutionizing AI accelerators, enabling them to handle inference-heavy workloads more efficiently than fixed-function counterparts. This flexibility positions RISC-V as a linchpin in the evolution of high-performance computing (HPC), addressing the rapidly evolving demands of AI applications. Lin also points out that: RISC-V’s momentum extends beyond AI, finding applications in EVs, IoT, and 5G. Its ability to foster innovation through an open architecture not only drives technical breakthroughs but also disrupts traditional business models, making it an essential technology for economic growth and recovery across these sectors. In January, the Chinese Academy of Sciences (CAS) announced that its XiangShan RISC-V processor will be ready this year, with modification to support AI dynamo DeepSeek. Xiangshan is” the world’s top-performing open-source processor core,” according to CAS. The XiangShan project was launched in 2019 to develop a high-performance RISC-V processor “with a focus on regular updates and improvements to the processor’s design, performance, and power efficiency,” in the words of TechRadar. The Beijing Institute of Open Source Chip was created to support the project. In February, Alibaba announced that it will start shipments of its newest RISC-V processor, a server-grade CPU, to customers this month. Alibaba, which plans to invest more than US$50 billion in AI and cloud computing over the next three years, recently announced a new AI model that it claims outperforms DeepSeek. RISC-V is an open standard instruction set architecture based on Reduced Instruction Set Computer design principles. A free, non-proprietary platform for the development of IC processors, it is an ideal way for the Chinese (or anyone else) to develop an alternative to the proprietary semiconductor technologies of America’s Arm, Intel, Nvidia and other Western firms that are subject to US government export controls. The RISC-V concept was conceived at the University of California, Berkeley, in 2010. The RISC-V Foundation was established in 2015 to support and manage the technology, with the Institute of Computing Technologies of the Chinese Academy of Sciences as one of its founders. A China RISC-V Alliance was established in 2018 with the goal of creating a complete open-source computing ecosystem by 2030. Also in 2018, the city of Shanghai introduced financial incentives for RISC-V development and Chinese RISC-V specialist StarFive was founded with the support of SiFive, the technology leader headquartered in Santa Clara. In 2020, the RISC-V Foundation was incorporated in Switzerland as the RISC-V International Association, moving out of the United States to avoid potential disruption caused by then-president Donald Trump’s China trade war policies. US policymakers and politicians would like to use export controls to limit China’s use of the technology, but indications are it is too late for that. China already accounts for about 50% of RISC-V core shipment volumes. Several Chinese companies are “premier” members of RISC-V International, including Alibaba Cloud, Huawei, ZTE, Tencent and semiconductor products and services supplier Beijing ESWIN. Andes Technology, Google, Intel, Nvidia, Qualcomm, Synopsis and SiFive are also premium members. The least well-known of the premier member Chinese companies, ESWIN, has R&D centers in Beijing, Shanghai, seven other Chinese cities, South Korea and the UK; manufacturing plants in Xi’an and Chengdu; and sales offices in Qingdao, Shenzhen, nine other Chinese cities, South Korea, Japan and the US. Altogether, the RISC-V International Association has 24 “premier” members, 166 “strategic” members, and 205 “community” members in Europe, Asia and the Americas, according to the RISC-V website. The fourth annual RISC-V Summit China was held in Hangzhou, Zhejiang province, last August, where more than 100 companies, research institutions and open-source technology communities participated. Ranking with similar events in Europe and North America, it attracted some 3,000 domestic and foreign attendees and about half a million viewers online. These developments are being followed closely by tech companies, consulting firms and government officials in the US. In December 2023, the Jamestown Foundation, a conservative research and analysis consultancy following national security-related trends from Washington, DC, wrote that: China’s engagement with RISC-V is a testament to its strategic foresight and ambition to reshape the semiconductor industry, challenging long-established norms and power structures. The increasing influence of Chinese entities in the RISC-V International Foundation is a clear indicator of China’s intention to steer the direction of RISC-V development. This shift in control away from the United States is not merely about technological advancement but about altering the global tech order. China sees RISC-V as an opportunity to enhance its self-innovation capabilities, foster self-sufficiency, and navigate the complexities of increasing geopolitical tensions. Follow this writer on X: @ScottFo83517667   Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "March 10, 2025",
        "content_length": 6665,
        "language": "en",
        "scraped_at": "2025-03-26T23:10:07.471328"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/03/china-explores-military-applications-with-deepseek/",
        "title": "China explores military applications with DeepSeek",
        "author": "by\nYong Jian",
        "description": "DeepSeek can be used in various military applications, from controlling unmanned vehicles to giving commands, according to Chongqing LandShip",
        "content": "DeepSeek’s artificial intelligence (AI) model can be used in various military applications, from controlling unmanned vehicles to giving commands, according to a white paper recently published by Chongqing Landship Information Technology, an autonomous driving solution provider. Landship said DeepSeek has excellent potential in military use, such as command, communications, and intelligence, surveillance, and reconnaissance (ISR). “In military strategic planning, DeepSeek can conduct in-depth analysis of massive intelligence information and provide military commanders with accurate decision-making support,” it said. “DeepSeek has powerful language understanding and generation capabilities, allowing it to adapt to battlefield tasks quickly.” Landship added that DeepSeek could collaborate with satellites, radars, and drones to improve the efficiency and accuracy of military reconnaissance. It can quickly identify key military targets from satellite images and estimate their sizes and numbers, supporting military decision-making. Landship, formerly Beijing Landship Information Technology Co Ltd, was co-founded in 2012 by Zhang Dezhao and several other autonomous driving experts from Tsinghua University. In 2015, the same team founded Beijing Zhixingzhe Technology Co, or IDriverPlus, to develop self-driving solutions, including a product called IDriverBrain. IDriverPlus and Landship brand their products as Xingji, which means “star horse” (or Qianlima — a mythical horse that can run very fast) in Chinese. Landship said on February 27 that it has deployed DeepSeek in a self-driving military vehicle called Xingji P60. It displayed the vehicle at the International Defence Exhibition and Conference (IDEX 2025) in Abu Dhabi from February 17 to 21. The company said the P60 integrated Landship’s civil-use self-driving software and DeepSeek’s military-use large language models (LLMs) to achieve efficient information processing and decision-making in complex and changing environments. LLMs refer to AI models like ChatGPT, which can understand human language. IDriverPlus’ Chief Technology Officer and Landship’s General Manager Wang Xiao said the company hopes to lead new trends in the defense sector by offering high-performance products at affordable costs. According to online footage, the vehicle was not called P60 but CS/VP16B at the exhibition. It was shown at the booth of Norinco, or China North Industries Corporation, a state-owned defense and technology company. Last October, IDriverPlus signed a strategic cooperation agreement with Harbin No.1 Jiqi Manufacture Group Company Ltd, a unit of Norinco, to jointly develop all-terrain unnamed rescue vehicles. DeepSeek launched its latest AI model, DeepSeek R1, on January 20. It trained the AI model using only 2,000 Nvidia H800 graphic processing units and a low-cost method called “knowledge distillation.” During the distillation, DeepSeek asked a more intelligent chatbot, such as Alibaba’s Qwen or OpenAI’s ChatGPT, many questions and used the answers to fine-tune its logic to become more intelligent. DeepSeek R1’s debut in late January caused a slump in United States stocks, as investors worried they might have overvalued AI stocks. Xu Bingjun, a military columnist and a senior researcher with Xinhua Liaowang think tank, praised DeepSeek’s low-cost strategy in a recent article titled “How DeepSeek changes military AI and its impact on the United States and Western countries.” “DeepSeek can be applied to intelligent combat systems to significantly improve combat effectiveness by analyzing real-time battlefield situations, optimizing combat plans, and predicting enemy actions,” he says in the article. “With DeepSeek, more autonomous weapons, drones, and unmanned tanks and ships can be developed,” he says. “These unmanned combat platforms can perform tasks autonomously in complex environments, reducing casualties while improving combat efficiency.” In early February, US lawmakers introduced a bipartisan congressional bill to ban DeepSeek from government devices due to national security concerns. Some states, like New York and Virginia, the US Navy, and the National Aeronautics and Space Administration (NASA), have stopped their employees from using DeepSeek on official devices. Landship said it worked with Huawei Technologies’ Mobile Data Center (MDC) to draft its latest White Paper about DeepSeek’s potential military applications. It said it hopes to promote using DeepSeek in the military field through cooperation. The White Paper disclosed Huawei’s AI goals for 2025: On August 17, 2022, IDriverPlus and Huawei signed a comprehensive cooperation agreement to develop “autonomous driving + AI” solutions using Huawei’s Ascend AI chips. On September 9 of the same year, Huawei’s Vice President Deng Taihua visited IDriverPlus’ headquarters in Beijing to discuss self-driving vehicle projects. IDriverPlus said it would test its software at Huawei’s Ascend AI Computing Center, which commenced operations in February 2023. Yong Jian is a contributor to the Asia Times. He is a Chinese journalist who specializes in Chinese technology, economy and politics. Read: DeepSeek is now the brain of Chinese state-owned firms   Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "March 1, 2025",
        "content_length": 5366,
        "language": "en",
        "scraped_at": "2025-03-26T23:10:10.555473"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/03/steps-needed-after-robot-nearly-head-butted-china-festival-spectator/",
        "title": "Steps needed after robot nearly head-butted China festival spectator",
        "author": "by\nCarl Strathearn and Emilia Sobolewska",
        "description": "Humanoid robots are supposed to be our loyal assistants, but we saw another side to them the other day. Chinese robot manufacturer Unitree was",
        "content": "Humanoid robots are supposed to be our loyal assistants, but we saw another side to them the other day. Chinese robot manufacturer Unitree was demonstrating its latest H1 robots at a lantern festival in the city of Taishan, Guangdong province, when one walked up to the crowd barrier and seemed to lunge at an elderly woman, nearly headbutting her. The incident quickly went viral, and sparked a fierce debate about whether the robot actually attacked the woman or had tripped up. It’s mostly being overlooked that we’re a long way from having robots that could intentionally attack someone – machines like these are often remote controlled – but the danger to the public is clearly real enough. With sales of humanoid robots set to skyrocket over the next decade, the public will increasingly be at risk from incidents of this kind. In our view as robotics researchers, governments have put very little thought into the risks. Here are some urgent steps that they should take to make humanoid robots as safe as possible. The first important issue is to what extent humanoid robots will be controlled by users. Whereas Tesla’s Optimus can be remotely operated by people in a control center, others such as the Unitree H1s are controlled by the user with a handheld joystick. Currently on sale for around $110,000, they come with software development kits on which customers can develop artificial intelligence (AI) systems, though only to a limited extent. For example, your robot could say a sentence or recognize a face but not take your kids to school. Who is to blame if someone gets hurt or even killed by a human-controlled robot? It’s hard to know for sure – any discussion about liability would first involve proving whether the harm was caused by human error or a mechanical malfunction. This came up in a Florida case where a widower sued medical robot-maker Intuitive Surgical Inc. over his wife’s death in 2022. Her death was linked to injuries she sustained from a heat burn in her intestine during an operation that was caused by a fault in one of the company’s machines. The case was dropped in 2024 after being partially dismissed by a district judge. But the fact that the widower sued the manufacturer rather than the medics demonstrated that the robotics industry needs a legal framework for preventing such situations as much as the public does. While for drones there are aviation laws and other restrictions to govern their use in public areas, there are no specific laws for walking robots. So far, the only place to have put forward governance guidelines is China’s Shanghai province. Published in summer 2024, those regulations include stipulating that robots must not threaten human security, and that manufacturers must train users on how to use these machines ethically. For robots controlled by owners, in the UK there is currently nothing preventing someone from taking a robot dog out for a stroll in a busy park, or a humanoid robot to the pub for a pint. As a starting point, we could ban people from controlling robots under the influence of alcohol or drugs, or when they are otherwise distracted such as using their phones. Their use could also be restricted in risky environments such as confined spaces with lots of members of the public, places with fire or chemical hazards, and the roofs of buildings. Robots that looks sleek and can dance and flip are fun to watch, but how safe are the audiences? Safe designs would consider everything from reducing cavities where fingers could get caught, to waterproofing internal components. Protective barriers or exoskeletons could further reduce unintended contact, while cushioning mechanisms could reduce the effect of an impact. Robots should be designed to signal their intent through lights, sounds and gestures. For example, they should arguably make a noise when entering a room so as not to surprise anyone. Even drones can alert their users if they lose signal or battery and need to return to home, and such mechanisms should also be built into walking robots. There are no legal requirements for any such features at present. It’s not that manufacturers are entirely ignoring these issues for walking robots. Unitree’s quadroped Go2, for instance, blinks and beeps when the battery is low or if it is overheating. It also has automatic emergency cut-offs in these situations, although they must be triggered by a remote operator when the robot is in “telemetric mode.” Crucially, however, there are no clear regulations to ensure that all manufacturers meet a certain safety standard. Clearly there will be dangers with robots using AI features, but remote-operated models could be even more dangerous. Mistakes could result from users’ lack of real-world training and experience in real-life situations. There appears to be a major skills gap in operator training, and robotics companies will need to prioritize this to ensure operators can control machines efficiently and safely. In addition, humans can have delayed reaction times and limited concentration, so we also need systems that can monitor the attention of robot operators and alert them to prevent accidents. This would be similar to the HGV-driver distraction-detection systems that were installed in vehicles in London in 2024. The incident in China has highlighted current misconceptions about humanoid robots as the media are once again blaming AI despite the fact that this was not the issue. This risks causing widespread mistrust and confusion among the public. If people understand to what extent walking robots are owner-operated or remote-operated, it will change their expectations about what the robot might do, and make everyone safer as a result. Also, understanding the owner’s level of control is vital for managing buyers’ expectations and forewarning them about how much they’ll need to learn about operating and programming a robot before they buy one. Carl Strathearn is a lecturer in computer science at Edinburgh Napier University and Emilia Sobolewska is a lecturer and researcher in applied informatics at Edinburgh Napier University. This article is republished from The Conversation under a Creative Commons license. Read the original article.  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "March 1, 2025",
        "content_length": 6358,
        "language": "en",
        "scraped_at": "2025-03-26T23:10:12.795059"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/02/deepseek-is-now-the-brain-of-chinese-state-owned-firms/",
        "title": "DeepSeek is now the brain of Chinese state-owned firms",
        "author": "by\nYong Jian",
        "description": "SOEs in China have connected to DeepSeek's artificial intelligence model after the central government launched an \"AI+\" program",
        "content": "Major state-owned enterprises (SOEs) in China have connected to DeepSeek’s artificial intelligence model after the central government launched an “AI+” program to call for boosting efficiency. Xinhua reported that at least 20 companies owned by the central government have integrated DeepSeek into their operations. These companies are engaged in the energy, telecommunication, automobile, financial and construction industries. In the energy and chemical sectors, Sinopec, PetroChina, CNOOC, Sinochem, China National Nuclear Power Co, China General Nuclear Power Group, China Southern Power Grid and China Oil and Gas Pipeline Network Corp (PipeChina) said they have already linked their AI models to DeepSeek-R1, which was launched on January 20. “With DeepSeek and other large language models (LLMs), PipeChina’s oil and gas control centers can set up their production plans within minutes instead of four hours,” Xu Kun, deputy general manager of Beijing Zhiwang Digital Technology Company, a unit of PipeChiona, told the China Central TV in an interview. “They can also improve accuracy with AI models by 10%.” LLMs refer to AI models like ChatGPT, which can understand human language or achieve natural language processing (NLP). “Besides, PipeChina can use DeepSeek to reduce the time needed to simulate the construction of salt caverns for gas storage from tens of days to just one hour,” Xu said. PipeChina, controlled by the State-owned Assets Supervision and Administration Commission (SASAC) of the State Council, is the construction contractor for the China–Russia East-Route Natural Gas Pipeline, or the Power of Siberia. The pipeline transfers 38 billion cubic meters of natural gas annually from Russia’s eastern Siberia to northern China. In 2022, PipeChina set up Beijing Zhiwang Digital Technology to digitalize its operations. Last December, PipeChina launched its “Pipeline Network” AI model using Huawei Cloud. It said it had deployed the model across more than 20 application scenarios and planned to use it in 80 more. On February 17, Chinese President Xi Jinping met corporate leaders at a symposium in Beijing. These company heads included Huawei Technologies’ Ren Zhengfei, Alibaba’s Jack Ma, Tencent’s Pony Ma, DeepSeek’s Liang Wenfeng and Unitree’s Wang Xingxing. On February 19, the SASAC met with a group of central SOEs to summarize the results of their AI development and plan for future work. SOEs refer to all state-owned firms controlled by the central and local governments, while central SOEs are those owned by the central government. “Central SOEs should seize the strategic window period for the development of the AI industry. They should improve LLMs, focus on applying core technologies, build an open ecosystem, develop original innovations ‘from 0 to 1’ and commercialize scientific achievements,” the meeting said. “The central government should increase efforts to support Central SOEs to use AI technology, highlight the development of AI technology in the coming 15th Five-Year Plan (2026-2030), support the creation of more leading AI enterprises and start-ups,” it said, adding that the government and Central SOEs will increase capital investment to ensure that talents can focus on research and development over the long run. “AI competition is all about data scale and quality,” Zhou Lisa, a researcher at the China Enterprise Reform and Development Society, a research unit of SASAC, told Xinhua. “Central SOEs have substantial data resources, so they can use DeepSeek to share and marketize their data.” “Many SOEs in the energy sector have already deployed their AI applications to promote intelligent transformation. Connecting with DeepSeek can allow them to provide even more solutions,” she said. She said, for example, that Sinochem used DeepSeek’s capabilities in complex information processing, logical reasoning and open-domain knowledge to meet the needs of different business scenarios; and that China Southern Power Grid used DeepSeek to upgrade its AI model called Big Watt, which was launched in September 2023 to collect data about facility damages. China has been developing AI models for industrial use in the past few years. In May last year, China Mobile launched its Jiutian AI model, which has professional knowledge in 15 industries, including telecommunications, electricity generation, logistics, energy, metal, construction, transportation and aviation. It said it would tailor-make AI models for 40 more industries. In July, China Telecom launched a generative AI model called TeleChat2, which is good at video editing and graphic design. The company said TeleChat2, which understands different Chinese dialects, can be widely used in public services across different cities. However, challenges remained when Chinese firms tried integrating their Internet-of-Things and AI technologies. Dong Zhaojie, an AI expert of China Southern Power Grid, said in June 2024 that the company deployed drones to check its electricity transmission poles and took over ten thousand pictures of split pins on them. He said he thought the AI model would be smart enough to identify the damaged split pins from the pictures, but it was not. He said engineers finally had to go to the sites to collect data and teach the AI model that there could be 500 different kinds of split pin damage. He said that once the AI model started working, the company saved about 10 million yuan (US$1.37 million) in annual expenses for finding damaged split pins. While state media celebrate China’s advancement in AI technologies, a Jiangsu-based commentator called Qianqian warns that AI could replace tens of millions of jobs in China, from factory workers and deliverers to medical professionals and civil servants. She says people should keep learning new skills to avoid losing their jobs. Yong Jian is a contributor to the Asia Times. He is a Chinese journalist who specializes in Chinese technology, economy and politics. Read: China connects everything to DeepSeek in nationwide plan  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "February 28, 2025",
        "content_length": 6171,
        "language": "en",
        "scraped_at": "2025-03-26T23:10:16.225373"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/02/chinas-ai-boom-bigger-than-just-deepseek/",
        "title": "China’s AI boom bigger than just DeepSeek",
        "author": "by\nMimi Zou",
        "description": "When small Chinese artificial intelligence (AI) company DeepSeek released a family of extremely efficient and highly competitive AI models last month, it",
        "content": "When small Chinese artificial intelligence (AI) company DeepSeek released a family of extremely efficient and highly competitive AI models last month, it rocked the global tech community. The release revealed China’s growing technological prowess. It also showcased a distinctly Chinese approach to AI advancement. This approach is characterized by strategic investment, efficient innovation and careful regulatory oversight. And it’s evident throughout China’s broader AI landscape, of which DeepSeek is just one player. In fact, the country has a vast ecosystem of AI companies. They may not be globally recognizable names like other AI companies such as DeepSeek, OpenAI and Anthropic. But each has carved out its own specialty and is contributing to the development of this rapidly evolving technology. The giants of China’s technology industry include Baidu, Alibaba and Tencent. All these companies are investing heavily in AI development. Alibaba CEO Eddie Wu earlier this month said the multibillion-dollar company plans to “aggressively invest” in its pursuit of developing AI that is equal to, or more advanced than, human intelligence. The company is already working with Apple to incorporate its existing AI models into Chinese iPhones. (Outside China, iPhones offer similar integration with OpenAI’s ChatGPT.) But a new generation of smaller, specialized AI companies has also emerged. For example, Shanghai-listed Cambricon Technologies focuses on AI chip development. Yitu Technology specializes in healthcare and smart city applications. Megvii Technology and CloudWalk Technology have carved out niches in image recognition and computer vision, while iFLYTEK creates voice recognition technology. Despite United States’ chip sanctions and China’s restricted information environment, these Chinese AI companies have found paths to success. US companies such as OpenAI have trained their large language models on the open internet. But Chinese companies have used vast datasets from domestic platforms such as WeChat, Weibo and Zhihu. They also use government-authorized data sources. Many Chinese AI companies also embrace open-source development. This means they publish detailed technical papers and release their models for others to build upon. This approach focuses on efficiency and practical application rather than raw computing power. The result is a distinctly Chinese approach to AI. Importantly, China’s state support for AI development has also been substantial. Besides the central government, local and provincial governments have provided massive funding through venture funds, subsidies and tax incentives. China has also established at least 48 data exchanges across different cities in recent years. These are authorized marketplaces where AI companies can purchase massive datasets in a regulated environment. By 2028, China also plans to establish more than 100 “trusted data spaces”. These are secure, regulated environments designed to standardize data exchanges across sectors and regions. They will form the foundation of a comprehensive national data market, allowing access to and use of diverse datasets within a controlled framework. The growth of the AI industry in China is also tied to a strong AI education push. In 2018, China’s Ministry of Education launched an action plan for accelerating AI innovation in universities. Publicly available data shows 535 universities have established AI undergraduate majors and some 43 specialised AI schools and research institutes have also been created since 2017. (In comparison, there are at least 14 colleges and universities in the United States offering formal AI undergraduate degrees.) Together, these institutions are building an AI talent pipeline in China. This is crucial to Beijing’s ambition of becoming a global AI innovation leader by 2030. China’s AI strategy combines extensive state support with targeted regulation. Rather than imposing blanket controls, regulators have developed a targeted approach to managing AI risks. The 2023 regulations on generative AI are particularly revealing of Beijing’s approach. They impose content-related obligations specifically on public-facing generative AI services, such as ensuring all content created and services provided are lawful, uphold core socialist values and respect intellectual property rights. These obligations, however, exclude generative AI used for enterprise, research and development. This allows for some unrestricted innovation. China and the US dominate the global AI landscape. But several significant players are emerging elsewhere. For example, France’s Mistral AI has raised over 1 billion euros to date to build large language models. In comparison, OpenAI raised US$6.6 billion in a recent funding round and is in talks to raise a further US$40 billion. Other European companies are focused on specialized applications, specific industries or regional markets. For example, Germany’s Aleph Alpha offers an AI tool that allows companies to customize third-party models for their own purposes In the United Kingdom, Graphcore is manufacturing AI chips and Wayve is making autonomous driving AI systems. DeepSeek’s breakthrough last month demonstrated massive computing infrastructure and multibillion dollar budgets aren’t always necessary for the successful development of AI. For those invested in the technology’s future, companies that achieve DeepSeek-level efficiencies could significantly influence the trajectory of AI development. We may see a global landscape where innovative AI companies elsewhere can achieve breakthroughs, while still operating within ecosystems dominated by American and Chinese advantages in talent, data and investment. The future of AI may not be determined solely by who leads the race. Instead, it may be determined by how different approaches shape the technology’s development. China’s model offers important lessons for other countries seeking to build their AI capabilities while managing certain risks. Mimi Zou is professor, School of Private & Commercial Law, UNSW Sydney This article is republished from The Conversation under a Creative Commons license. Read the original article.  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "February 27, 2025",
        "content_length": 6332,
        "language": "en",
        "scraped_at": "2025-03-26T23:10:19.041852"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/02/chinese-dating-simulator-love-and-deepspace-now-has-period-tracker/",
        "title": "Chinese dating simulator Love and Deepspace now has period tracker",
        "author": "by\nStephanie Harkin",
        "description": "24/7 companionship. Spend time with him whenever you want. This is the promise made by Love and Deepspace, a mobile romance game by the Chinese company",
        "content": "24/7 companionship. Spend time with him whenever you want. This is the promise made by Love and Deepspace, a mobile romance game by the Chinese company Papergames. Some think video games are all guns and cars, but romance games or “dating simulators” are immensely popular, especially among young women. Love and Deepspace reached 50 million users across more than 170 countries and regions in January. Despite their popularity, dating sims, as they are known for short, usually fly under the radar in discussions about games. Meanwhile, a recent major update for Love and Deepspace has furrowed some brows by introducing an unusual new feature: a period tracker. Dating sims offer a fantasy of romantic, intimate companionship. Otome games (from the word “maiden” in Japanese) are a sub-genre of dating sims that are catered to women. They offer a suite of boyfriends to choose from – each attentive, caring and, of course, incredibly handsome. Ideal in every way except for their being fictional. Love and Deepspace is a science-fiction otome game that stands out with its unusual blend of combat, magic, dating and gacha (meaning random rewards) microtransactions – which are controversial for their parallels to gambling. Its latest update introduced a Remind Me feature, where players can ask their virtual boyfriends to remind them of daily tasks and special events, as well as their upcoming period. Players input information about their menstrual cycle and the game then generates its own predictive calendar and notifications. The player’s in-game boyfriend will offer to pick up some sanitary products or even reach towards the screen and provide an imaginary abdomen massage. The millions of users drawn to a fantasy about considerate men says a lot about the frustrations women have with modern dating and dating apps. Women are conscious of the conservative gender roles within otome games, but at the same time find pleasure in their focus on the female gaze and ability to explore their sexual desire privately. In China, where otome games are especially popular, censorship of explicit content for women has intensified. These games are able to convey sexually suggestive themes that are subtle enough to elude censorship. Otome games have been around for three decades. Angelique, a game made by an all-women team in 1994, is considered to be the first. It helped set the stage for other boyfriend fantasy media for women as seen in the rising popularity of “boyfriend ASMR” on audio and video platforms today. These are designed to directly address the listener in both sensual and everyday scenarios. Video games have changed a lot since then – especially as mobile devices have evolved to be more intimate, accompanying us everywhere. Love and Deepspace is introducing more features including “Quality Time”, which rewards players for working or studying with the game open. The rewards come in the form of an animated man sighing and whispering into the player’s headphones. Love and Deepspace’s period reminders mirror existing period tracker apps, though they do not incorporate the usual fertility date predictions or ability to log symptoms and sexual activity. That’s probably a good thing. Period tracker apps have faced scrutiny for mishandling users’ data. Popular period tracker app Flo has faced a lawsuit in the British Columbia Supreme Court in Canada for sharing personal data to third-party tech firms, including Facebook and Google, which use the data for targeted advertising. Meanwhile, the overturning of Roe v. Wade in the United States has threatened many people’s bodily autonomy and made them concerned about the legal risks of sharing personal biological information. Love and Deepspace’s privacy policy states any menstruation data is only used for the prediction and reminder features, and that it will not be shared with any third parties without the player’s consent. The banning of the Chinese-owned platform TikTok in the US was driven by fears of foreign influence and data privacy. Yet our privacy may not be safer with a US company than a Chinese one. US-owned companies have been just as liable to sell sensitive information to third parties, such as location data to abortion clinics and gay clubs. Australia’s Privacy Act does not just apply to Australian companies. Papergames could be sanctioned if it breaches its privacy policy. That said, it is unlikely many users will be familiar with the policy or read future changes made to it. It is best to always practice caution when entering any kind of personal information in platforms, apps or video games. Period tracking is not a core component in the game. But this new feature signals a potential shift towards more mobile games integrating popular app functions, such as health data. Instead of a casual time-filler, mobile games like Love and Deepspace are competing for players’ attention over other apps – which is concerning given its controversial gacha random rewards. It’s also possible the game’s designers are picking up on a widespread desire for men to care more about their partner’s periods. Stephanie Harkin is a lecturer on games at the School of Design, RMIT University. This article is republished from The Conversation under a Creative Commons license. Read the original article.  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "February 26, 2025",
        "content_length": 5440,
        "language": "en",
        "scraped_at": "2025-03-26T23:10:21.763264"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/02/ai-revolution-wellness-wealth-and-a-world-without-work/",
        "title": "AI revolution: wellness, wealth and a world without work",
        "author": "by\nJan Krikke",
        "description": "Prominent economist Nouriel Roubini likes to make bold predictions. Known as \"Dr Doom,\" Roubini recently claimed that the AI revolution would lead to an",
        "content": "Prominent economist Nouriel Roubini likes to make bold predictions. Known as “Dr Doom,” Roubini recently claimed that the AI revolution would lead to an enormous increase in wealth and a massive drop in consumer prices, but job losses that could be as high as 80% in many sectors. To maintain economic activity and prevent widespread social unrest, Roubini predicts that governments will introduce universal basic incomes (UBI), unconditional payments that would replace social security, unemployment compensation and other social benefits. AI will be taxed to cover part of the cost. Roubini’s timeline for the end of most work – 20 years – is optimistic, but AI will ultimately eliminate the need for most work as we know it. People will instead look for purpose-driven lifestyles. The wellness industry, which caters to mental, spiritual and physical human health, could be the primary beneficiary. In the 1970s, American researcher and futurist Roy Amara made his famous statement about technological adaption that came to be known as Amara’s law: “We tend to overestimate the effect of a technology in the short run and underestimate the effect in the long run.” AI is a case in point. Invented in the 1960s, scientists predicted AI would outperform humans in all domains of knowledge by the 1980s. They were off the mark by well over half a century. Experts now predict that AI will exceed human capabilities in most domains by 2030. On the other hand, current developments show that AI, in combination with large-scale automation and robotics, is bringing us closer to Roubini’s prediction: The end of nearly all work that relies on routine, repetitive tasks. Developments in East Asia, and especially China, give a glimpse of the future. The number of industrial robots in China is approaching two million, more than half of the global total. Moreover, Chinese producers have developed AI-controlled robots for a wide variety of tasks – from planting trees, harvesting crops and installing and cleaning solar panels. Chinese producers of electronics, batteries, solar panels, and container and warehousing companies have reached automation levels of over 90%. China’s latest electric vehicle (EV) factories have the capacity to turn out a car every 30 seconds. Chinese EV maker BYD recently deployed 500 multitasking humanoid robots that can handle everything from sorting parts and using electric screwdrivers to conducting visual quality inspections. Human labor is becoming an ever smaller part of the production processes and supply chains. AI’s impact will go far beyond optimizing production and logistics. The latest advances in the development of Large Language Models (LLM) like ChatGPT and China’s DeepSeek suggest that few jobs will be safe. LLMs can generate articles, write technical documentation, review contracts, analyze medical images and automate software testing. Facebook’s founder, Mark Zuckerberg, told an interviewer last month that his company could begin replacing software engineers with AI as early as this year. AI will be doing the work of mid-level engineers this year, said Zuckerberg, adding, “We’ll get to the point where a lot of the code in our apps and the AI that we generate is actually going to be built by AI engineers instead of people engineers.” Roubini subscribes to the thesis of futurist Peter Diamantis, co-author of the bestselling book “Abundance: The Future Is Better Than You Think.” According to Diamantis, “We will soon be able to meet and exceed the basic needs of every man, woman and child on the planet. Abundance for all is within our grasp.” Like Roubini, Diamantis believes that AI, robotics and other technologies will be able to produce consumer goods in virtually unlimited quantities, and at ever-decreasing cost. The resulting deflationary effect will lead to a lower cost of living for consumers, but the challenge will be to keep up demand, which requires addressing wealth inequality. Wealth inequality in many countries, already at historic levels, will only increase unless mitigating measures are taken. Hence the growing calls for guaranteed universal basic income (UBI), which Roubini argues can be financed through the enormous increase in wealth that will be generated by AI. Aware of the potential social-economic impact of AI in the coming years, prominent tech industry leaders, including Elon Musk, Sam Altman of OpenAI, and Twitter co-founder Jack Dorsey, have voiced support for a UBI. Google, Apple and Cisco have even donated money to UBI pilot projects. A study by the United Nations Development Program (UNDP) pointed out that timing is the key to the launch of a UBI. If introduced too early, it could impact a country’s competitive strength. Moreover, the implementation of a UBI would have to be part of a general overhaul of the existing social safety net and the tax system. Whether it comes sooner or later, a world without work will be a milestone in human history. In the 20th century, machines reduced the economic value of our physical power. In the 21st century, AI will reduce the economic value of our professional knowledge, be it accountants, architects, or attorneys. For most people, their identity is closely tied to their job or professional skills. Work has largely defined our social status and offers the satisfaction of accomplishment. Deprived of the security of work and its accompanying status, people will seek new values and a new purpose-driven lifestyle. The wellness industry, catering to mental, spiritual and physical improvement, could be one of the primary beneficiaries. The wellness industry can help to mitigate the social and psychological impact of a world without work. It offers everything from community-based wellness experiences to group therapy, mindfulness training, and courses on integral thinking and resensitizing ourselves to nature. The wellness industry, which emerged in the 1970s, is expected to grow between 9% and 12.5% in the next decade, outpacing the overall economy. AI could also disrupt the wellness industry, but work that requires human compassion will be largely insulated from the job losses caused by the AI revolution. East Asia has demographic reasons to make haste with the AI revolution. In Japan, the median age is 49 years and rising. In 20 years, the dependency ratio between non-working and working people will approach 1 to 1. China and South Korea have similar demographic numbers. Despite being the “oldest” region in the world, East Asia could become a trendsetter in the post-work era. The region makes most of the hardware needed for Industry 4.0 and is not burdened by existential questions about AI.  Moreover, China is integrating AI education into its primary and secondary school curricula. In December last year, China’s Ministry of Education issued guidelines specifying that younger primary school students should focus on exploring and experiencing AI technologies, while older primary and middle school students are expected to understand and apply AI concepts.  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "February 23, 2025",
        "content_length": 7179,
        "language": "en",
        "scraped_at": "2025-03-26T23:10:23.966369"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/02/tech-bros-back-in-chinas-official-spotlight-as-jack-ma-meets-xi/",
        "title": "Tech bros back in China’s official spotlight as Jack Ma meets Xi",
        "author": "by\nYong Jian",
        "description": "Jack Ma's appearance at Xi's recent symposium has shown Beijing's determination to use innovative technologies to maintain economic growth",
        "content": "Alibaba Group’s formerly exiled founder Jack Ma’s appearance at Chinese President Xi Jinping’s recent symposium highlights Beijing’s determination to use innovative technologies to maintain its economic growth. After forcing Alibaba’s Ant Group to scrap its initial public offering in Hong Kong in November 2020, Beijing spent a year and a half tightening regulations in the internet sector. All internet platforms, including Douyin, Kuaishou, Alibaba and Tencent, had faced regulatory clampdowns. Food-delivery platforms were accused of breaching labor rights while ride-hailing companies were fined for illegally collecting users’ data. During that period, billionaire Ma stayed in Tokyo with his family, met friends on his luxury yacht in Europe and visited agricultural technology firms worldwide. In June 2022, Li Daokui, a former advisor to the People’s Bank of China, said the clampdown on Chinese internet giants had basically ended. He explained that the scrapping of Ant’s IPO plan in November 2020 had been a political decision due to Chinese leaders’ shock at seeing many party members’ names on the company’s shareholder list. In March 2023, Ma reportedly returned to China after exile. In July 2024, he gave a speech at Alibaba’s headquarters in Hangzhou. Some observers say Ma’s “self-exile” from late 2020 to early 2023 showed Xi’s negative attitude towards China’s internet giants and many private companies. They say Beijing is now trying to use Ma and a group of Hangzhou-based corporate leaders to tell the outside world that China welcomes all technology companies. Alibaba’s Hong Kong-listed shares rose to HK$138.5 (US$17.8) on February 21, 11.6% up from a week earlier. Tencent’s shares surged 8.9% to HK$517, while Kuaishou Technology’s grew 9.2% to HK$58.4 for the same period. “Xi’s symposium is of great significance,” a Chinese columnist using the pseudonym “Fengye,” or Maple Leaf, says in an article published by Beijing-based Zhengshang Canyue. The writer continues: The development of the private economy in the new era and a new journey has broad prospects and great potential. After the US election, the global economy continues to be turbulent, and many European and American companies are in turmoil. However, Chinese companies focus on innovative and cutting-edge technologies and keep increasing their competitiveness. The high performance of China’s artificial intelligence models amazed the world; China’s robots danced in the Spring Festival Gala; and Chinese electric vehicles gradually won support in the international market with their excellent quality and performance. He adds that it’s good to have Jack Ma attend the symposium as Ma is an icon representing the first batch of Chinese Internet firms that have made outstanding achievements and laid a strong foundation for the emergence of many technology startups. Besides, he points out that Ma’s return to China could also mean that the billionaire did not find any compelling projects overseas but saw strong growth prospects in China’s technology sector after the “Six Little Dragons in Hangzhou” emerged. According to the Chinese media, the Six Little Dragons in Hangzhou are DeepSeek, Unitree Robotics, Game Science, Deep Robotics, Brain-Computer Interface (BCI) and Manycore Tech. DeepSeek was founded by Liang Wenfeng, a Zhejiang University graduate, in December 2023. On January 20 this year, the company launched DeepSeek-R1, which within days surpassed ChatGPT to become No.1 on the free app download charts in the US. Hangzhou Yushu Technology, known as Unitree, was founded by Wang Xingxing in 2016. Its dancing robots won applause at China Central TV’s Spring Festival Gala on January 28, 2025. Game Science is a Chinese video game developer founded by Feng Ji and Yang Qi in 2014. Deep Robotics was co-founded by Zhu Qiuguo and Li Chao in 2017. BCI, which is engaged in real-time thought decoding, remote robot control, and brain-machine co-evolution, was established by Han Bicheng in 2015. Manycore Tech, a maker of 3D design software, was co-founded by three Chinese graduates of the University of Illinois Urbana-Champaign in 2011. “Xi’s symposium highlighted Zhejiang, as the province has a good business environment,” Wang Bin, a columnist for the Zhejiang Daily’s social media account, writes in an article. “Zhejiang is a place full of the human touch. Everyone can feel this in their work and life here,” Wang says. “When a place is like a harbor that protects people, it is easier to retain people and businesses.” Since ending its Covid rules in early 2023, China has experienced a wave of capital outflows. Some economists say it is due to weak domestic consumption, rising political tensions between the United States and China and the rate hikes in the US. According to the State Administration of Foreign Exchange, China’s net foreign direct investment (FDI) decreased by US$168 billion last year, the biggest capital flight since 1990. Foreign investment into China hit a historical high of US$344 billion in 2021 but has dropped since then. Foreign investors only sent US$4.5 billion into China, while Chinese firms invested US$173 billion overseas in 2024. Due to growing tensions between China and the US, many international companies adopted a “China-plus-one” strategy to invest not only in China but also in other places. Besides, many Chinese companies are now building factories overseas, fearing US President Donald Trump will increase tariffs on imports from China. It is unclear whether Beijing’s high-tech campaign can help retain and attract foreign investment, but it did boost Alibaba’s shares. Alibaba’s shares also gained support after The Information reported on February 11 that Apple Inc. partnered with Alibaba to bring AI features to the iPhone. Apple targets the launch of its AI-powered iPhones in China in May. On February 20, Alibaba Chief Executive Eddie Wu said in an investor call that artificial generative intelligence (AGI) is at the core of the company’s AI strategy. He said the company will invest heavily in AI infrastructure, foundation models and AI-powered business transformation in the coming years. Eurizon Capital, one of the largest asset management companies in Europe, said in an article that investors should be positive about Chinese equities for several reasons: Eurizon’s analysts said that since late 2023, Beijing’s political and policy atmosphere has shifted away from the acutely punitive posture against the private sector adopted in the summer of 2021 toward a more pragmatic and market-friendly stance. They added that while Chinese equities are not expensive, the world is still underweighting them as many investors have adopted an ABC mentality, which refers to “anything but China.” Some commentators say it’s wise for China to highlight its technology sector, which has performed better than other industries, but such a strategy may prompt China hawks in the US to push for sanctioning Chinese technology startups. Yong Jian is a contributor to the Asia Times. He is a Chinese journalist who specializes in Chinese technology, economy, and politics. Read: China connects everything to DeepSeek in nationwide plan  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "February 22, 2025",
        "content_length": 7336,
        "language": "en",
        "scraped_at": "2025-03-26T23:10:26.511939"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/02/china-connects-everything-to-deepseek-in-nationwide-plan/",
        "title": "China connects everything to DeepSeek in nationwide plan",
        "author": "by\nYong Jian",
        "description": "China now connects everything, from chatbots and smart vehicles to government departments and schools, to DeepSeek emerged last month.",
        "content": "China now connects everything – from chatbots and smart vehicles to government departments and schools – to DeepSeek, an artificial intelligence (AI) model that emerged and became famous last month. Baidu, a Chinese search engine, announced that its chatbot Ernie Bot 4.9 version now integrates with DeepSeek-R1 to enhance students’ problem-solving capability. Students can take a picture of a question, and then the chatbot will answer it with detailed steps. The company also said it will allow individual users and SMEs to use Ernie’s basic functions for free from April and will charge high-end customers only for some tailor-made services. Some Chinese media said Baidu could obtain more data by giving up its closed-source model and connecting with other AI models, but such a move would also require it to rely on external platforms and cause it to lose competitiveness over the long run. Tencent said on February 16 that users of its Weixin messaging app can now use DeepSeek for searches. A company spokesperson told the news media that Tencent is exploring integration of multiple products with DeepSeek. Earlier this month, the Shenzhen-based Huawei said its Huawei Cloud has connected with DeepSeek-R1. Chinese automakers BYD and Geely also said their electric vehicles integrate with DeepSeek-R1. “The technical advantages of leading IT companies pave the way for free AI services,” said Gong Zheng, an engineer at the Institute of Technology and Standards, China Academy of Information and Communications Technology (CAICT), which is a research institute under China’s Ministry of Industry and Information Technology (MIIT). “Free basic AI services can become a channel for companies to source data. These companies can form a ‘closed business loop’ and offer value-added services and enterprise-level solutions,” he said, adding that China wants to formulate the industry standards for the next generation of human-computer interaction technology. A “closed business loop” refers to a process in which a company actively collects customer feedback and analyzes it to improve its products and services. On Tuesday state media, including Xinhua, promoted the benefits of allowing primary and secondary school students to use DeepSeek, even though many countries discourage their students from using AI tools to do homework. The rise of DeepSeek and related applications came as Chinese President Xi Jinping met corporate leaders at a symposium in Beijing on Monday. These company heads included Huawei Technologies’ Ren Zhengfei, Alibaba’s Jack Ma, Tencent’s Pony Ma, DeepSeek’s Liang Wenfeng and Unitree’s Wang Xingxing. “In this new era, the development prospects of the private sector are broad and promising,” Xi said in a speech. “It is time for private firms and entrepreneurs to show their talents.” “It is hoped that private firms and entrepreneurs will have the ambition to serve the country, be dedicated to development, abide by the law and do business well, promote common prosperity, and make new and greater contributions to promoting Chinese-style modernization,” he said. Xi added that some of the difficulties and challenges currently faced by the private sector generally arise during China’s industrial upgrade, but they are partial, temporary, and resolvable. The People’s Daily said DeepSeek and Unitree executives’ appearances at Xi’s symposium demonstrated that the central government values technological innovation. Before this, Chinese Premier Li Qiang had met some entrepreneurs, including Unitree’s Wang, at a symposium in Hangzhou on December 20, 2024. Unitree won applause with its dancing robots at China Central TV’s Spring Festival Gala on January 28. Li had also met other industrial experts, including DeepSeek’s Liang, at a symposium in Beijing on January 20, 2025. On that same day DeepSeek launched DeepSeek-R1, which had surpassed ChatGPT to become the No.1 on the free app download charts in the US within days. US stocks fell significantly on January 27 as investors were worried that Nvidia and OpenAI might be overvalued, in view of the fact DeepSeek had developed its AI model at very low costs. The DeepSeek team claimed they used only 2,000 Nvidia H800 chips to train its AI model. However, no one really knows how many chips DeepSeek has used, nor who ultimately controls this company and offers it unlimited financial resources. In July 2017, China’s State Council unveiled its New Generation AI Development Plan and vowed to make the country become a major AI innovation hub and a world leader in AI technology by 2030. In February 2023, the Chinese Communist Party (CCP) Central Committee and State Council published the Overall Layout Plan for the Development of a Digital China, calling for the integration of the nation’s digital and real economies. At that time, Vice Premier Liu He said China should boost its semiconductor sector with a “whole nation” approach, allowing the government to mobilize the resources of the nation’s research institutions and companies to achieve technological breakthroughs. According to the plan, China will form a nationwide system by 2025 to achieve its “Digital China” goal. The Guangzhou, Nanjing, Suzhou, Zhengzhou, and Hohhot city governments said their computing networks are connected to DeepSeek-R1. In Shenzhen, the Futian district government said it created 70 AI “staff members” with DeepSeek to handle documents and assist its civil servants. Hu Guoqing, head of the 6G and AI artificial intelligence research group and an associate researcher at Peking University’s Shenzhen Research Institute, said more and more government departments will try to integrate with AI tools. Yong Jian is a contributor to the Asia Times. He is a Chinese journalist who specialises in Chinese technology, economy, and politics. Read: Where DeepSeek, Qwen’s AI engineers really come from  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "February 20, 2025",
        "content_length": 6011,
        "language": "en",
        "scraped_at": "2025-03-26T23:10:32.212118"
    },
    {
        "source": "Asia Times",
        "category": "technology",
        "region": "asia",
        "country": "hong_kong",
        "url": "https://asiatimes.com/2025/02/where-deepseek-qwens-ai-engineers-really-come-from/",
        "title": "Where DeepSeek, Qwen’s AI engineers really come from",
        "author": "by\nJeff Pao",
        "description": "The recent rise of DeepSeek and Alibaba’s Qwen has become a hot topic for technology experts and investors in China and the United States",
        "content": "The recent rise of DeepSeek and Alibaba’s Qwen artificial intelligence platforms is a hot topic among technology experts and investors in China and the United States. Yet specific information about the Chinese engineering teams remains scarce. An Asia Times analysis using public information on the backgrounds of the two chatbots’ developers may help draw a clearer picture of how DeepSeek and Qwen emerged. Based on publicly available research papers and media reports, DeepSeek and Qwen’s engineering teams do not collaborate or overlap. The only linkage between the duo is that DeepSeek’s researchers said in a paper on January 22 this year that they had “distilled” Qwen2.5, and also Meta’s Llama, to develop DeepSeek-R1. The launch of DeepSeek-R1 caused a slump in the US stock market in late January. Some analysts believe that DeepSeek, an open-source AI, may also have used “knowledge distillation” to extract data from OpenAI’s ChatGPT and train its AI models. However, no conclusive evidence has been made public that it did so. According to the January 22 paper, DeepSeek-R1 has 16 core contributors, some of whom have direct connections with Microsoft Research Asia (MSRA) and the China Computer Federation (CCF). Core contributor Yu Wu was supervised by MSRA’s Ming Zhou in his PhD program at Beihang University from 2014 to 2019. He was a full-time intern at MSRA from 2013 to 2019 before joining it as an associate researcher in 2019. Core contributor Daya Guo was also supervised by Ming Zhou during his PhD program at Guangzhou’s Sun Yat-sen University from 2018 to 2023. He was mentored by Nan Duan in 2020-2023 and by Duyu Tang in 2017-2020 in MSRA’s Natural Language Computing Group. Core contributors Zhibin Gou and Zhihong Shao, both from Tsinghua University, co-wrote papers with MSRA’s Nan Duan. Zhenda Xie, another contributor to DeepSeek, was advised by MSRA’s distinguished scientist Baining Guo at Tsinghua University from 2018 to 2023. He also worked as a research intern at MSRA during the same period. Ming Zhou and Nan Duan are still working for MSRA. In 2016 and 2018, they jointly led the CCF’s Computer Terminology Approval Working Committee. Zhou is now a vice president at CCF. The connection between DeepSeek’s team and MSRA researchers, of course, does not mean that MSRA has any stake in the Hangzhou-based company. However, if the US were to exert more pressure on China’s tech sector, MSRA may have to stop its work and internship programs in China. In early 2023, MSRA reportedly stopped recruiting interns from seven Chinese universities and the Beijing University of Posts and Telecommunications due to concerns about their linkages with the People’s Liberation Army. The US-sanctioned Northwestern Polytechnical University (NPU) and the Harbin Institute of Technology (HIT) are among these schools. The Hangzhou-based Alibaba, founded by Chinese tycoon Jack Ma, developed its chatbot differently. Alibaba, mobilizing cash flow from its e-commerce businesses, established the DAMO Academy in 2017 to undertake AI research. DAMO stands for Discovery, Adventure, Momentum and Outlook. The academy established an advisory board of 10 renowned educators and researchers, six from the US and four from Chinese universities. Alibaba assigned Aliyun’s Chief Technology Officer Jingren Zhou to run the DAMO Academy. Zhou earned his PhD degree in computer science from Columbia University in the United States. He was a Microsoft R&D partner for four years before joining Alibaba in July 2016. Chang Zhou, an algorithm engineer who was responsible for Qwen’s data processing, joined DAMO Academy in 2017. He graduated from Fudan University in 2012 and finished his PhD in Peking University in 2017. Before joining Alibaba, he had already worked with Alibaba’s software engineers on some projects and co-wrote two papers with them in 2017. Peking University professor Jun Gao, who was apparently Chang Zhou’s supervisor, was among the co-writers. Gao received his PhD from Peking University in 2003 and has published more than 30 research papers. He has projects funded by China’s 863 Program and the National Natural Science Foundation of China (NSFC). In March 1986, 200 top Chinese scientists proposed the 863 Program to then-Chinese leader Deng Xiaoping. The government set up the program in November of the same year. In 2022, Chang Zhou co-wrote a research paper with a group of academics, including Peking University’s Bin Cui, who also led some projects funded by the 863 Program. Cui is now the vice dean of Peking University’s School of Computer Science and the deputy director of CCF’s Technical Committee on Databases. Last July, Chang Zhou decided to take along a team of about 10 engineers to join ByteDance. Alibaba reportedly filed a lawsuit against Zhou, claiming he wasn’t entitled to join a competitor. Alibaba’s research team appears to have a stronger advisory board than DeepSeek. It also has a more extended history in data management research. This may be why Alibaba could build Qwen2.5, an original AI model, while DeepSeek has only mustered distilled versions of other AI models. This is also likely why Apple Inc has recently partnered with Alibaba to launch AI-powered iPhones. IT columnist Amanda Caswell wrote in a recent article that Qwen2.5 beats Deep-R1 in all seven tests she set out. She says Qwen2.5 offers more structured and readable answers, while DeepSeek-R1’s responses lack depth and originality. From Beijing’s perspective, both Qwen and DeepSeek are equally essential as they help China upgrade its industry and hedge against US decoupling and sanctions. Media reports said Chinese President Xi Jinping will soon chair a symposium to boost private sector sentiment. Alibaba co-founder Jack Ma and DeepSeek founder Liang Wenfeng will attend. Read: Apple partners with Alibaba to sell AI-powered iPhones in China  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link.",
        "date": "February 17, 2025",
        "content_length": 6022,
        "language": "en",
        "scraped_at": "2025-03-26T23:10:38.104107"
    }
]