[
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/25/us_army_laser_weapon/?td=rt-3a",
        "title": "US Army’s laser obsession continues with yet another drone-zapper deal",
        "author": "Brandon Vigliarolo",
        "description": "",
        "content": "Still shopping for the perfect death ray, the US Army has tapped Huntington Ingalls to build and test a prototype laser weapon designed to fry drones in flight. Virginia-based Huntington Ingalls Industries (HII) announced yesterday that it has been awarded a contract by the US Army's Rapid Capabilities and Critical Technologies Office (RCCTO) for an undisclosed sum to develop and test a high-energy laser (HEL) weapon system. It is intended to shoot down unmanned aircraft ranging from small, low-flying drones to larger surveillance models. HII's system is being designed to take out drones weighing up to 1,320 pounds (about 600 kg), flying at speeds of up to 250 knots (463 kph), and operating at altitudes as high as 18,000 feet (5,500 m) above sea level - classified as \"group 3\" unmanned aerial systems (UAS). \"We look forward to collaborating with the RCCTO on this important effort that will protect the warfighter with an affordable counter-UAS solution,\" said HII's Grant Hagen, president of Mission Technologies' Warfare Systems group at Huntington Ingalls. Beyond dropping considerably large drones, the Army's solicitation also calls for a system that can operate in both fixed-site and vehicle-mounted configurations, integrate with existing Army networks, support modular design for field repair and parts swapping, and include built-in cybersecurity protections. All that, and there's a tight timeline too: the RCCTO wants sensor and laser lethality characterization testing in the first quarter of FY2025, a lab demo in Q2 FY25, an integrated system field test in Q3, and a Soldier Touch Point event in Q1 FY26 - which kicks off in October 2025. The program's goal is to pick a prime contractor for production in the first quarter of FY26, with a potential transition to producing up to 20 laser weapon systems by the third quarter of FY26 under a separate Production OTA award. Whether those early testing milestones are on track is unclear. HII only just announced the contract and declined to share information outside of what was given in the press release. The Army has had laser weapons capable of neutralizing unmanned aircraft since 2022 in the form of BlueHalo's LOCUST system developed through the Laser Technology Research Development and Optimization (LARDO) program. The current LOCUST system delivers \"hard kills\" with a 20-kilowatt beam, meaning it can physically destroy drones mid-flight. The Army signed another contract with BlueHalo last year to develop advanced directed energy prototypes with increased automation, efficiency, ruggedization, and improvements in size, weight, and power. Lockheed Martin also demonstrated its own vehicle-mounted 50 kW laser system way back in 2023, highlighting the Army's growing list of laser zapper projects and raising questions about how - or if - they're meant to complement each other. With HII declining to explain how its weapon system differed, the only available clue comes from the solicitation, in which the RCCTO mentions it wants \"to expedite the development and field testing of a producible and sustainable laser weapon system,\" suggesting rapid prototyping and fielding is the objective. We've reached out to the Army with questions, but haven't heard back. ® Send us news",
        "date": "2025-03-26",
        "content_length": 3265,
        "language": "en",
        "scraped_at": "2025-03-26T23:04:57.992584"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/26/vmware_sues_siemens_for_using/?td=rt-3a",
        "title": "VMware sues Siemens for allegedly using unlicensed software",
        "author": "Simon Sharwood",
        "description": "",
        "content": "VMware has sued industrial giant AG Siemens’s US operations for alleged use of unlicensed software and accused it of changing its story negotiations. The case was filed last Friday in the US District Court for the District Delaware. VMware’s complaint [PDF] alleges that Siemens AG’s US operations used more VMware software that it had licensed. Siemens’s use of VMware became contentious when it tried to arrange extended support for some products. On September 9, 2024, Siemens apparently produced a list of the VMware software it used and “demanded that VMware accept a purchase order to provide maintenance and support services for the listed products.” The complaint states that list mentioned VMware deployments that “far exceeded the number of licenses it [Siemens] had actually purchased.” Siemens demanded VMware accept a purchase order to provide maintenance and support services VMware points out that Siemens had very good reasons to present an accurate list, because mentioning unlicensed products would expose it to legal peril and overstating the extent of its VMware usage would mean it paid more for licenses and support. VMware claims it reviewed the list, noticed it included unlicensed software, and informed Siemens of its findings. Siemens apparently responded by insisting the list was correct, demanded VMware accept it, and even threatened to sue the virtualization giant if it did not provide support services for the listed products. Siemens felt it had grounds to sue because it had an option to purchase a one-year renewal of support services, believed it had exercised it, and felt VMware was not delivering. VMware says it agreed to offer support for 30 days “under protest” and because it didn’t want to disrupt Siemens’s operations. Siemens, meanwhile, appears to have revisited the list it provided in September. In October, VMware claims Siemens “attempted to retract the list and to offer instead a new list that was closer in line with VMware’s records of Siemens AG’s licenses.” The complaint alleges Siemens “never provided a credible explanation of why it would have presented and insisted on the accuracy of the September 9 List, if it did not represent its actual deployment of VMware products.” Do you know more? The Register is interested to hear from VMware users navigating the changes brought by Broadcom. Contact us here in confidence. VMware is also upset that Siemens would not allow a software audit and alleges “other more cooperative and forthcoming customers do [this] without objection.” Left unable to learn about the true extent of Siemens’s VMware estate, and fearing use of unlicensed software, Broadcom’s virtualization business unit felt it had no option but to sue. The Register sought comment from Siemens but had not received a response at the time of publication. We will update this story if we receive a substantial reply. VMware wants a jury trial. One more thing: In 2023, VMware and Siemens teamed to showcase their shared vision for \"The Next Era of Global Manufacturing Technology\". We suspect that kind of joint presentation is less likely to happen while this case is in motion. The lawsuit was filed just three days before VMware announced a change to the way customers download binaries of its products. Effective April 24th, VMware will operate a single site for product downloads and customers will have to acquire a “download token” to get their hands on code. Each token is unique to the customer, enabling VMware to identify who downloads what. Maybe that could have helped VMware understand if Siemens was staying within its license entitlements. A VMware spokesperson told us the change will “ensure customers and channel partners can access our latest software in a secure and reliable manner.” We asked what’s risky or unreliable about the current download arrangements – which use shared URLs – but have not received a response. The change is not straightforward because some VMware products include the existing URLs for product downloads. Broadcom will offer a script to automate replacement of those URLs. The download tokens are available in the Broadcom support portal, a service The Register’s virtualization desk has often heard is not always reliable. Another change that may be coming to VMware users is a new minimum licensing requirement that will make 72 cores the smallest allowed purchase for vSphere Standard and Enterprise Plus, the server-virtualization bundles . Early commentary suggests small business customers see this change as a hostile action, as the processors powering their server fleets possess fewer than 72 cores. VMware’s per-core licensing means they’ll have to pay for software they can’t use. We’ve seen several posts about the 72-core minimum and have asked VMware to confirm it but are yet to receive a reply. One thing VMware has confirmed is changes to its annual Explore conference, which in most years occupied four days during August in Las Vegas and then visited Barcelona in October or November for a conference of the same duration. As of 2025, the Vegas event will be the only four-day confab, and new “Explore On Tour” events will run for one day, or one-and-a-half days, in London, Paris, Frankfurt, Tokyo, Sydney, and Mumbai. ® Send us news",
        "date": "2025-03-26",
        "content_length": 5275,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:01.095430"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/25/oracle_breach_update/?td=rt-3a",
        "title": "There are perhaps 10,000 reasons to doubt Oracle Cloud's security breach denial",
        "author": "Connor Jones",
        "description": "",
        "content": "Oracle Cloud's denial of a digital break-in is now in clear dispute. A infosec researcher working on validating claims that the cloud provider's login servers were compromised earlier this year says some customers have confirmed data allegedly stolen and leaked from the database giant is genuine. Since Oracle rubbished reports of a security breach, rose87168, the individual who claimed responsibility for the alleged intrusion and theft of approximately six million records – customer security keys, encrypted credentials, LDAP entries, and other data – sent a 10,000-line sample of the collection to Alon Gal, co-founder and CTO at security shop Hudson Rock. Gal said he took the sample and reached out to multiple Hudson Rock customers who appeared to be affected. Three customers have since confirmed the data handed to Gal by rose87168 from Oracle Cloud's internal systems is genuine, according to the CTO. One customer, we're told, said its users are in the sample set, and have access to sensitive information. Another concurred, claiming the data is legitimate and from a production environment though it dates back to 2023.A third Hudson Rock customer said their users and tenant IDs match those in the sample, and that they are used in their production environment. The Register reported over the weekend Oracle was denying the claims made by rose87168 late last week that the netizen breached Oracle's login servers using a vulnerability and stole the aforementioned customer security keys and other sensitive data. \"There has been no breach of Oracle Cloud,\" Oracle said. \"The published credentials are not for the Oracle Cloud. No Oracle Cloud customers experienced a breach or lost any data.\" In addition to providing researchers with a sample of the sensitive data they allegedly stole from the IT titan, rose87168 also demonstrated they were able to create a text file, archived here, on a public-facing Oracle-owned web server as proof of their intrusion and the heist. That file contained rose87168's email address, seemingly to show they did indeed have access to the login server. Infosec outfit CloudSEK speculated rose87168 appeared to have exploited CVE-2021-35587, a critical vulnerability in Oracle Access Manager that would have given the miscreant access to the kinds of credentials and other data said to have been siphoned. That would mean Oracle failed to patch a hole in its own software on its own infrastructure. Along with Gal, CloudSEK said on Tuesday the same 10,000-line sample of data was sent to its staff, and appeared to cover more than 1,500 affected organizations. CloudSEK said after looking at the sample, \"the volume and structure of the leaked information make it extremely difficult to fabricate, reinforcing the credibility of the breach.\" If the data is genuine, as some infosec watchers suggest it is, the potential consequences of it falling into the wrong hands are serious and substantial. With access to data such as customers' digital security certificates and keys, SSO and LDAP passwords, and more, cyber-criminals could take that and use it to carry out supply chain and ransomware attacks, among others. The SSO and LDAP passwords are encrypted, and according to BreachForums posts made by rose87168, the alleged thief has been unsuccessful in breaking the hashes. However, they offered a free portion of the data to anyone who could help. The price for the entire trove of data isn't known, but rose87168 said they'd happily accept cash or zero-day exploits for their trouble. Experts are advising organizations who have any suspicion that they may be affected to rotate their SSO and LDAP credentials, and ensure strong password policies and MFA are in place. Triggering an incident response plan is also a good idea to check whether any unauthorized intrusions have taken place. The Register asked Oracle for a response to the latest developments from CloudSEK and Hudson Rock, and it did not immediately respond. ® Send us news",
        "date": "2025-03-26",
        "content_length": 3993,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:04.253964"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/25/too_many_outlooks/?td=rt-3a",
        "title": "Microsoft's many Outlooks are confusing users – including its own employees",
        "author": "Richard Speed",
        "description": "",
        "content": "Baffled by the plethora of Outlook options out there? You aren't alone. Microsoft veteran Scott Hanselman posted a list of some more variants that could be used to do the same thing. It's a problem common to several Microsoft products. A file needs to be opened, but which app should be used? Should it be Outlook New, or Outlook (New)? With tongue firmly in cheek, Hanselman listed some more options: Outlook (Zero Sugar), Outlook (Caffeine Free), and so on. Hanselman, Developer Community veep at Microsoft, also included Outlook '95, although to our mind the peak came with the version of Outlook in Office 97. A happier, more trusting time when security was less important. While users can create multiple Outlook profiles to store email account details and data locations, Hanselman's post on Bluesky highlights an issue facing many users of Microsoft's software: which incarnation of the application to use. Teams users often find themselves presented with a variety of applications – Microsoft Teams and Microsoft Teams (Personal), for example, can often appear side by side in the system tray. As for Outlook, users are likely to have multiple versions installed. Microsoft forced the new version onto devices as part of a Windows update and renamed the previous version to Outlook (Classic) so the pair could run side by side. While support for the Classic version of Outlook will persist until at least 2029, Microsoft would like users to move to the new version despite it lacking many of its predecessor's functions. According to Microsoft: \"The new Outlook for Windows, built upon modern service architecture, is inspired by the Outlook web experience.\" It also does not support the COM add-ins used by many enterprises to glue corporate workflows together. Currently, the new Outlook is at the opt-in stage and is off by default. It will then proceed to an opt-out stage, where users must actively switch back to the Classic experience before the Cutover stage, after which reversal is no longer possible. Microsoft says it will give administrators at least 12 months' notice before this is implemented in production rings. Existing perpetual installations of classic Outlook \"will continue to be supported until at least 2029,\" according to Microsoft. There is a cautionary tale about what happened when a soft drinks company tried to replace a well-liked product with a \"new\" version and renamed the previous preferred version as \"classic.\" The list posted by Hanselman – who is also notable for tips on managing Microsoft's personal information manager – is amusing, but also highlights the perils of having multiple, similarly functioning options to do the same thing, and the potential for confusing users. Outlook (Stable and Fast) anyone? ® Send us news",
        "date": "2025-03-26",
        "content_length": 2774,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:06.375002"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/26/microsoft_ai_apocalypse/",
        "title": "Microsoft walking away from datacenter leases (probably) isn't a sign the AI bubble is bursting",
        "author": "Tobias Mann",
        "description": "",
        "content": "Comment Microsoft has walked away from negotiations to lease two gigawatts worth of datacenter capacity in the US and Europe, and has deferred and cancelled other datacenter leases, according to a new report from investment bank TD Cowen. The bank’s analysts feel Microsoft’s lease cancellations were “largely driven by the decision to not support incremental Open AI training workloads.” The report comes just over a month after the same analysts revealed Microsoft had terminated leases for several hundred megawatts of datacenter capacity in the US. For some the cancellations are evidence that the AI boom is about to go bust. However, we'd argue there's a far simpler explanation as to why Microsoft might be pulling back on its datacenter leases: many datacenters can't handle the power and cooling demands created by high-end AI hardware . Nvidia's massive NVL72 rack-scale systems promise 30x or better performance for inference workloads, and four times better training performance compared to its Hopper GPUs. That performance comes at the expense of denser racks, higher power consumption and more waste heat production. Racks housing Nvidia’s latest are rated for 120kW of power, three times that of the typical Hopper rack. Liquid cooling is no longer an option but an inescapable requirement. As TD Cowen notes, hyperscalers and cloud providers must redesign their datacenters to accommodate super-dense, power-guzzling devices – and doing so is far from simple. Microsoft signing leases for datacenters that weren’t built to handle Nvidia’s latest kit – and whatever comes next – would therefore be short-sighted. Datacenter capacity planning, as Omdia Principal Analyst Alan Howard tells The Register, \"is a very tricky game, and the least preferred scenario is having more demand than capacity. The whole process of acquiring land and securing power is cheap compared to executing.\" If the datacenters or colocation facilities Microsoft planned to lease can't cope with the demands of these denser systems, it's not hard to see why the software giant would walk away and focus on building dedicated facilities or shifting to more suitable locations. Microsoft has already signaled a belief that all-new datacenter designs are needed, and in 2024 even detailed its plans for such facilities. TD Cowen, however, noted that bringing greenfield datacenter capacity online takes time. Shortages of key components and energy supply aren't helping the situation. It currently takes roughly 24 months to build a datacenter from scratch, Omdia’s Howard said, before noting xAI's Colossus cluster in Tennessee was built in ten months. TD Cowen claims that Microsoft has directed its datacenter partners to begin retrofitting existing facilities to support liquid cooling. And, we'll note, it is possible to use in-aisle coolant reservoirs, distribution units, and liquid-to-air heat exchangers to support liquid-cooled systems in existing equipment halls. In fact, the bank’s analysis suggest that as AI workloads shift from training to inferencing, retrofits may be a better indicator of growth than new leases. \"We increasingly believe that the initial indicator of inference demand will be the velocity of hyperscale retrofits, rather than the velocity of third-party leasing in major markets for incremental child deployments within existing availability zones,\" the document states. However, with Nvidia already planning 600kW racks, it remains to be seen if retrofits can satisfy users’ needs. Along with retrofitting its new facilities, it's also worth noting that Microsoft is already sitting on a substantial quantity of Hopper GPUs, many of which have been tied up running OpenAI's training workloads. If Microsoft is indeed doing less training work for OpenAI, as TD Cowen claims, Redmond can transition that compute capacity to its own inferencing workloads, or rent it to customers. In a statement provided to The Register, a Microsoft spokesperson said the company remains committed to spending $80 billion on infrastructure during its 2025 fiscal year. \"Thanks to the significant investments we have made up to this point, we are well positioned to meet our current and increasing customer demand. Last year alone, we added more capacity than any prior year in history. While we may strategically pace or adjust our infrastructure in some areas, we will continue to grow strongly in all regions. This allows us to invest and allocate resources to growth areas for our future,\" the spokesperson said. ® Send us news",
        "date": "2025-03-26",
        "content_length": 4536,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:08.645465"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/26/signal_calls_congress/",
        "title": "Signalgate storm intensifies as journalist releases full secret Houthi airstrike chat",
        "author": "Iain Thomson",
        "description": "",
        "content": "The Atlantic's editor-in-chief who was inadvertently added to a Signal group in which the US Secretary of Defense, Vice President, and others discussed secret military plans has now publicly released the messages. Journalist Jeffrey Goldberg decided to go full disclosure Wednesday – withholding one message that outed by name a CIA operative in the field – after the White House attempted to play down the significance of the group's discussions. As we summarized Monday, the scribe was mistakenly invited to a small private group on the encrypted chat app by the Trump administration's National Security Advisor Michael Waltz, allowing the magazine journo to observe chatter between VP JD Vance, Defense Secretary Pete Hegseth, Secretary of State Marco Rubio, CIA Director John Ratcliffe, Director of National Intelligence Tulsi Gabbard, Homeland Security Advisor Stephen Miller, Waltz, and others. The conversation focused on plans to hit Yemen-based Houthi insurgents with airstrikes on March 15; Goldberg was present in the group during the build up to the assault and the aftermath, and this week disclosed he witnessed on Signal what one would comfortably assume is highly classified military materials. The editor then today released a copy of that private conversation after Team Trump tried to claim his account of the security fiasco was wrong and that the details weren't classified or even that sensitive. Here are the highlights. \"Godspeed to our warriors. 1215 ET: F-18s LAUNCH (1st strike package) 1345: ‘Trigger Based’ F-18 1st Strike Window Starts (Target Terrorist is @ his Known Location so SHOULD BE ON TIME) — also, Strike Drones Launch (MQ-9s),\" wrote Hegseth, who earlier said no war plans were discussed in the group. We are currently clean on OPSEC — that is, operational security \"1410: More F-18s LAUNCH (2nd strike package),\" he continued. \"1415: Strike Drones on Target (THIS IS WHEN THE FIRST BOMBS WILL DEFINITELY DROP, pending earlier ‘Trigger Based’ targets). 1536 F-18 2nd Strike Starts – also, first sea-based Tomahawks launched. \"We are currently clean on OPSEC — that is, operational security.\" Good to know the actual times US military pilots are due to take off for combat, and potentially put themselves in harm's way, are neither classified nor a war plan. Neither was the targeted assassination of a suspected missile designer for the Houthi rebels, who was visiting his girlfriend when the apartment block she lived in was leveled by the American airstrike. \"The first target - their top missile guy - we had a positive ID of him walking into his girlfriend’s building and it’s now collapsed,\" wrote Waltz. \"Excellent,\" replied Vance, to which Waltz responded with three emojis: A fist, an American flag, and a flame. President Trump's Ukraine and Middle East envoy Steve Witkoff, who logged into the chat while physically in Russia, added emojis of his own: Two prayers, a pumped up bicep, and two American flags. Vice President Vance also had some blunt opinions on what were once America's European allies. He said any airstrikes and the creation of safer shipping routes in the region as a result would benefit Europe more than America, claiming that three percent of US cargo passed through the Suez Canal compared to 40 percent of European goods. I fully share your loathing of European free-loading \"I just hate bailing Europe out again,\" the VP wrote. \"Let's just make sure our messaging is right here.\" Hegseth also was not a fan of the continent. \"VP: I fully share your loathing of European free-loading. It’s PATHETIC. But Mike is correct, we are the only ones on the planet (on our side of the ledger) who can do this. Nobody else even close,\" he wrote. On Tuesday Waltz went on Fox News and said either he had accidentally added Goldberg or there was some other explanation. But there is no other explanation: The Atlantic's coverage shows him inviting Goldberg into the group. \"We're going to get to the bottom of it,\" Waltz said. Then, referring to the President's éminence grease Elon Musk: \"I talked to Elon on the way here; we've got the best technical minds looking at how this happened.\" President Trump earlier remarked, \"Michael Waltz has learned a lesson, and he’s a good man,\" and added the affair was merely a \"glitch.\" The OPSEC blunder raises several questions, including whether the use of Signal is counter to laws on federal record keeping, why exactly was the group using the app in the first place, and whether the software is approved for discussing secret airstrike plans. MAGA queen ... Donald Trump and Tulsi Gabbard, then serving as a lieutenant colonel in the US Army Reserve, at an election rally at the Gas South Arena in Duluth, Georgia, in 2024 Private contact details – cellphone numbers, email addresses, and even some passwords – of Waltz, Gabbard, Hegseth and other top officials close to President Trump can be found on the internet, German mag Der Spiegel reports today. WiReD also noted Waltz left his Venmo friend list public, revealing his personal and professional associates. Secretary Hegseth is right now in Asia. In a hearing Tuesday before the Senate Intelligence Committee, Director of National Intelligence Gabbard said the Houthi Signal chat she was a member of did not contain classified info. On Wednesday she was in front of the House Permanent Select Committee on Intelligence, and when pressed on her characterization of the discussion the day before, she claimed she had \"misremembered\" its contents. \"My answer yesterday was based on my recollection, or the lack thereof, on the details that were posted there,\" she waffled. President Trump says he has full confidence in his cabinet. ® PS: A 19-year-old member of Elon Musk's federal cost-cutting DOGE unit, who had the online nickname Big Balls, once provided support to a cybercrime gang \"that bragged about trafficking in stolen data and cyberstalking an FBI agent,\" Reuters alleged Wednesday. Send us news",
        "date": "2025-03-26",
        "content_length": 5972,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:11.003135"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/26/us_defense_contractor/",
        "title": "US defense contractor cops to sloppy security, settles after infosec lead blows whistle",
        "author": "Brandon Vigliarolo",
        "description": "",
        "content": "A US defense contractor will cough up $4.6 million to settle complaints it failed to meet cybersecurity requirements on military contracts and knowingly submitted false claims for payment. Massachusetts-based MORSE Corp admitted [PDF] to a series of cybersecurity failures in its dealings with the US Army and Air Force. The issues came to light after the company's former head of security brought a whistleblower lawsuit against the corporation on behalf of the government under the False Claims Act. MORSE's cybersecurity lapses were numerous, according to federal prosecutors, and ranged from missteps in cloud security to fudged compliance scores. As early as 2018, the biz – which develops guidance and navigation tech for military vehicles – used a third-party provider to host its email without ensuring the vendor met the FedRAMP Moderate baseline, as required, say prosecutors. Additionally, the contractor failed to confirm the email provider followed Pentagon rules for incident reporting, malware handling, forensic access, and media preservation, we're told. On top of that, MORSE, which also wins contracts like this $67M one last year for \"data and software engineering\" support for the US Army, neglected to fully implement all required NIST cybersecurity control rules, including measures that \"if not implemented, could lead to significant exploitation of the network or exfiltration of controlled defense information,\" per the Feds. And between 2018 and early 2021, the company had no comprehensive written security plans for its systems, despite contract requirements to document system boundaries, configurations, and external connections, prosecutors added. Even more damning was how MORSE handled its cybersecurity self-assessment scores, as the Feds tell it. According to the settlement, Department of Defense contractors are required to report scores for their implementation of NIST Special Publication 800-171 - a framework for safeguarding sensitive data - on a scale from a catastrophic -203 to a perfect 110. In January 2021, MORSE submitted a score of 104 to the DoD via its Supplier Performance Risk System (SPRS). But in May 2022, MORSE hired a third-party cybersecurity consultant to double-check its posture, and the results weren't just a little off, it's said. \"On July 27, 2022, the third-party cybersecurity consultant notified MORSE of its summary level score of -142 for its implementation of NIST SP 800-171 security controls,\" the settlement revealed. It's understood the consultant told MORSE it had only implemented 22 percent of the required controls. However, the outfit didn't update its SPRS score until June 2023 — several months after it had been served a federal subpoena over concerns about its IT security, we're told. As part of the settlement, MORSE is handing back $4.6 million to the Feds, and $851,000 of that is going to the ex-employee who blew the whistle. Specifically, the biz was accused of making false claims for payment, in that it took government funding while not being up to par. \"Becoming a whistleblower was not an easy decision and one I only took when I felt I had no remaining option to protect sensitive government information,\" the whistleblower said in a statement through his lawyers. \"The Department of Justice should be commended for acting promptly to investigate and put an end to practices that placed sensitive government information and data at risk of loss or compromise.\" One wonders if this will affect MORSE's future dealings with Uncle Sam. A spokesperson for MORSE told us in a statement: \"MORSE Corp did not engage in cybersecurity fraud; this settlement was a resolution of historic false claims act allegations.\" They went on: The company denies any wrongdoing and cooperated with the Department of Justice’s investigation. Through our history, we have always maintained the security of the government’s data, and significantly invested in robust systems and controls to ensure that there were no breaches of this data. MORSE Corp resolved this matter to avoid the unnecessary expense and distraction of litigation and focus on serving its customers’ needs. MORSE is compliant with all cybersecurity requirements, and has a current third-party-validated NIST score of 110. ..... -- / -- .. --. .... - / .--- ..- ... - / -... . / .- / -.-. --- ... - / --- ..-. / -.. --- .. -. --. / -... ..- ... .. -. . ... ... .-.-.- ® Send us news",
        "date": "2025-03-26",
        "content_length": 4428,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:12.797057"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/26/nsw_police_investigating_court_system/",
        "title": "Files stolen from NSW court system, including restraining orders for violence",
        "author": "Connor Jones",
        "description": "",
        "content": "Australian police are currently investigating the theft of \"sensitive\" data from a New South Wales court system after they confirmed approximately 9,000 files were stolen. Investigations into the attack on the NSW Online Registry website (ORW), which provides access to civil and criminal court cases in the region, are being led by cybercrime detectives and the Department of Communities and Justice (DCJ). Describing the NSW ORW as \"a secure online platform,\" the police said 9,000 files were \"downloaded\" by attackers. Among the files stolen were affidavits and apprehended violence orders (AVOs), which are a type of restraining order to protect victims of domestic violence, child abuse, and other physical harms, such as assault, harassment, stalking, and sexual assault. The full extent of the data theft, which was discovered on Tuesday, is not yet known but if AVOs are in the hands of cybercriminals, they would prove valuable bargaining tools should extortion play a role in proceedings. Given the nature of AVOs, leaking them could expose the names and addresses of both the victims and the alleged offenders. Law enforcement officials are working to contact those whom they believe might be affected, and urged anyone who thinks their data could be involved but hasn't been contacted to file a report via ReportCyber, Australia's cybercrime reporting service. \"I've been advised by the Department of Communities and Justice about a significant cyber breach affecting the NSW Online Registry Website,\" said Michael Daley, NSW's attorney general, in a press statement. \"The NSW government is taking this incident seriously. I am assured that DCJ is working with Cyber Security NSW [and] the NSW Police to ensure the ongoing integrity of the system. \"They are also working to urgently identify and contact affected users and the public will be kept updated as more information becomes available.\" The attack comes a year after neighboring state Victoria's court system discovered it was hit by a suspected ransomware attack, one that saw criminals make off with various audio-visual files stored on its network. The main concern was that hearings held between November and December 2023 files were compromised, but others dating back to 2016 were found too. ® Send us news",
        "date": "2025-03-26",
        "content_length": 2282,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:15.531129"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/26/international_datacenter_day/",
        "title": "It's International Datacenter Day for those who colocate, er, celebrate",
        "author": "Dan Robinson",
        "description": "",
        "content": "It's International Datacenter Day, when people around the world get together to share their love of faceless concrete edifices. This 24-hour stretch is \"designed to create awareness\" of the bit barn industry and to \"inspire the next generation of talent\" - the engineers and technical staff who tend to the banks of ceaselessly humming servers within these facilities. The modern world depends heavily on datacenters as the places where all those cat videos and holiday selfies actually get stored. They are also hosting applications that global mega corporations and public bodies depend upon for their day-to-day operations. The downsides to this revolution? Traditional datacenters need ample amounts of electricity, water, and cooling. Cloud computing has driven facilities to expand, consuming more and more energy to sustain the multitudes of servers inside. And with the AI craze ushered in a couple of years ago, datacenter infrastructure suddenly became a lot more energy-intensive as the hyperscale cloud providers in particular packed their halls with high-spec servers crammed with power-guzzling GPUs needed for developing and training models. Spotting an opportunity, investors piled into the industry, waving wads of cash for new, even larger bit barns to be built. All of this is starting to place a strain on the electricity grid in some regions, which have been unprepared for the rapid increase in demand. How about the impact of AI datacenters on the environment? The greenhouse gas (GHG) emissions generated by all these bit barns may be much higher than the big tech firms are admitting. Research last year from Morgan Stanley forecast that global emissions between now and the end of the decade will be three times greater than if generative AI had not been developed. However, to the rescue with some timely paid-for research comes Telehouse, a colocation provider which suggests that in Britain at least, public opinion is firmly behind the government's push to scale up datacenter construction and accelerate AI development. Lucikly, the commissioned survey of more than 2,000 individuals found that 73 percent of Brits view datacenters as crucial to driving innovation – aligning perfectly with the UK government's policy and Telehouse's own business. Fancy that. As public awareness of bit barns grows, so does the need for clearer understanding, Telehouse says. A quarter of respondents are unsure how they operate, and half want to see more education on the technology required in schools and universities. We wonder if that education extends to informing people of the government's plans to set up \"AI Growth Zones\" with streamlined planning processes to speed the building of more facilities, which means any local objections to a massive datacenter campus suddenly springing up in your area can be neatly swept aside. The investment being made into bit barns over the next decade will open lots of exciting career opportunities in the UK, Telehouse claims, which talks up the need to work with the education sector to include datacenter subjects in the STEM curriculum. However, some sources dispute that bit barns are actually much benefit for the communities where they are located. Once operational, sites may create just 30 to 50 permanent positions, while larger facilities may employ up to about 200 people. The IT jobs market shrank for a second year in a row in 2024, according to tech consultancy Janco Associates, noting cheerily: \"AI automation has eliminated lots of rank-and-file IT jobs, and they probably aren't coming back.\" Lest we end on a gloomy note, let us celebrate those featureless facilities wherever they are, perhaps popping up in a field near you sometime soon, as they whir away collecting all your data to make somebody, somewhere very rich. Note: We hesitate to mention this amid all the excitement, but it is World Backup Day on March 31. Let's hope it doesn't follow International Data Loss day. ® Send us news",
        "date": "2025-03-26",
        "content_length": 3976,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:17.564816"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/26/uninstall_atop_for_now/",
        "title": "Credible nerd says stop using atop, doesn't say why, everyone panics",
        "author": "Liam Proven",
        "description": "",
        "content": "Veteran sysadmin and tech blogger Rachel Kroll posted a cryptic warning yesterday about a popular Linux system monitoring tool. Maybe it's better to be safe than sorry. The post is titled: \"You might want to stop running atop.\" No details, no context – just a few paragraphs that have set off alarm bells in corners of the Linux world. Better known online as rachelbythebay, Kroll has a good reputation in the tech industry. She's wrangled servers for Facebook and Lyft, and has been a speaker at events from USEnix to Strange Loop. She's also collected some of her writing in books, which used to be on Amazon, but which you can now get, free of DRM, from the Gumroad store. Unsurprisingly, this post has caused some excitement on techie forums such as Lobsters and Hacker News. We feel that the best summary is this one from Duncan Bayne: Just another content-free report of… oh wait it's rachelbythebay… /me runs off to check his machines for atop Atop is a system monitoring tool for Linux and FreeBSD, and most distros include it in their repositories. It's been around for years and the last release, version 2.11.0, was out in June last year. Even Red Hat has recommended it in the past. Atop is in the family of the well-known top command. \"TOP\" stands for \"table of processes\" – at least colloquially – and it's a sort of task manager for the Unix shell. It shows you a live, constantly updating list of the most active processes running on your computer, which you can sort by various criteria, such as CPU or memory usage. Pretty much all Unix-like OSes include the top command, and there are a bunch of similar ones, including the popular htop by Hisham Muhammad, co-creator of Reg FOSS desk favorite GoboLinux, and btop++, which we recently used to demonstrate the tiny resource usage of Pi-hole. Atop is slightly different, and we suspect that is critical here. While most top-style programs are live tools that show resource usage right now, atop also has a component that can run in the background, logging performance information to a file. This is useful for troublesome machines where you can't see what was happening just before they became unresponsive. After a reboot, you can replay atop's activity record and see what the box was doing before things went wrong. It's possible that an exploit or vulnerability has been found in the atop program somewhere. Since there hasn't been a new version in nine months, it's probably been there for a while, maybe years, but has only just been found. It may also be that Kroll is unable to share details due to contractual obligations. Thus, this vaguely worded warning is all that she's able to say. The Register has attempted to contact both Kroll as well as atop author Gerlof Langeveld. He definitely knows his stuff. We attended his seriously in-depth talk on Linux monitoring at the Open Source Summit in Bilbao a couple of years ago. We even understood some of it. If either of them gets back to us, we will update this story. But in the meantime, as atop is purely a monitoring tool, it really shouldn't break anything if you just uninstall it for safety's sake. We think that there might be a new version announced any day now, which will be included in all fashionable Linux distributions and other open source Unix-like OSes, very soon. You can always reinstall it once it's been updated. ® Send us news",
        "date": "2025-03-26",
        "content_length": 3377,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:20.748770"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/26/microsoft_deborks_usb_printers/",
        "title": "Microsoft patches patch that broke USB printing in Windows 11",
        "author": "Richard Speed",
        "description": "",
        "content": "Months after releasing a patch that left some printers spouting gibberish, Microsoft is issuing another update to deal with it. The patch, KB5053657 for Windows 11 22H2 and 23H2, came out on March 25 and, according to Microsoft, repairs what it broke in January. The problem occurred when a printer driver was installed on a user's device. This could be as a result of powering up the device or plugging it in. Microsoft stated at the time, \"You might observe that the printer unexpectedly prints random text and data, including network commands and unusual characters. Resulting from this issue, the printed text might often start with the header POST /ipp/print HTTP/1.1, followed by other IPP (Internet Printing Protocol) related headers.\" It's an insight into the inner workings of IPP that Microsoft and its partners would prefer users not see. Then again, we're sure that certain printer manufacturers would be delighted to see users wasting ink, thanks to the problem. Every little counts and all that. According to Microsoft, the error only affected USB-connected dual-mode printers that support both USB Print and IPP Over USB protocols. The glitch persisted through February and was listed as a known issue in the March 11 update, which contained another notable whoopsie. Or an enhancement, depending on whether you're an end-user or a Microsoft shareholder. The update removed Copilot from some devices, or, as Microsoft put it, \"The app is unintentionally uninstalled and unpinned from the taskbar.\" Not to worry though. The Copilot fix didn't require a patch, and Microsoft stated, \"This issue has been fixed, and the affected devices are being returned to their original state.\" That original state was likely the one where Microsoft inflicted Copilot on a user rather than the halcyon days before it was added to most of the tech giant's products. As for the USB printing fix, Microsoft reckons that KB5053657 will do the trick. Sadly, another known issue – a problem affecting users of version 2411 of the Citrix Session Recording Agent, persists, at least. The Windows maker continues to maintain: \"Microsoft is working with Citrix to address this issue and will update this documentation once a resolution is available.\" ® Send us news",
        "date": "2025-03-26",
        "content_length": 2254,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:23.757525"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/26/us_entity_list_subsidiaries/",
        "title": "US closes subsidiary loophole on dozens of Chinese entity list members",
        "author": "Brandon Vigliarolo",
        "description": "",
        "content": "The US government has initiated another crackdown on Chinese businesses skirting chip export bans, adding a few dozen new names, and offshoots of repeat offenders, to the entity list. The Commerce Department's Bureau of Industry and Security (BIS) released two lists of fresh entries yesterday that are set to hit the Federal Register on Friday. Some 80 companies were added in a bid to hamstring China's development of high-performance, exascale and quantum computing, among other things. \"We will not allow adversaries to exploit American technology to bolster their own militaries and threaten American lives,\" Commerce Secretary Howard Lutnick thundered. \"We are committed to using every tool at the Department's disposal to ensure our most advanced technologies stay out of the hands of those who seek to harm Americans.\" While not all of the entities added to the list are from China, or were implicated in trying to acquire high-end chips and other computing components from US companies, a good number of them are. There are some familiar names on the list, too. Inspur, a Chinese server manufacturer and former frequent biz partner of US giants like Intel and IBM, which was put on the entity list in 2023, has had six of its subsidiaries added. As we noted days after Inspur was added to the list a couple of years back, US companies were still free to do business with its subsidiaries, a loophole that now appears to be closed. \"These entities are being added for their contributions to Inspur's development of supercomputers for military end use, particularly by acquiring or attempting to acquire US-origin items in support of supercomputer projects for the Chinese government and/or military,\" the BIS said in its addition order. Also on the latest list is Nettrix, which was added alongside Henan Dingxin and Suma-USI Electronics, for their role in helping China develop exascale supercomputers. If those names don't sound familiar to you, another entity list member they're tied to may ring a bell: Sugon. Sugon, maker of some of the most powerful supercomputers in China, was placed on the entity list in 2019 in a bid to slow its progress. As the New York Times found out last year, Nettrix was actually an offshoot of Sugon, which Nvidia, Intel, and Microsoft were all quick to work with when its parent was added to the entity list. Also new to the list for supporting the development of advanced AI models in China are the Beijing Academy of Artificial Intelligence and Beijing Innovation Wisdom Technology company. Seven entities made the list for their role in helping China develop quantum computing technology. And Singleton Electronics and Suzhou SIP Hi-Tech Precision Electronics were also named for selling products to companies already on the entity list, including Huawei. Additionally, a few dozen earned places on the list for trying to acquire US-origin items to aid China's military modernization efforts, namely in the field of hypersonic weapons and aircraft. Organizations understood to be helping to train Chinese military forces using US-made equipment and assisting Iran's efforts to acquire UAVs were also added. American corporations are banned from doing business with those on the entity list unless they have permission from the Commerce Department. Even then, as many of these additions highlight, it's a constant game of whack-a-mole as China-based entitues add subsidiaries that spring up to circumvent bans which some American companies continue to accommodate. We contacted a number of US companies who have reportedly done business with subsidiaries named in this story. Nvidia declined to comment, and we didn't immediately hear back from any others. ® Send us news",
        "date": "2025-03-26",
        "content_length": 3718,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:27.201463"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/26/50_years_since_last_saturn/",
        "title": "50 years ago the last Saturn rocket rolled out of NASA's Vehicle Assembly Building",
        "author": "Richard Speed",
        "description": "",
        "content": "It is 50 years since the very last Saturn rocket rolled out from NASA's Vehicle Assembly Building (VAB) to launchpad 39B at the Kennedy Space Center. The super heavy rockets were built and used for nine crewed flights to the Moon from December 1968 to December 1972, as well as for launching US space station Skylab in 1973. The final Saturn has left the building.... Saturn IB rolls out of the Vehicle Assembly Building in March 1975 (Pic: NASA) - click to enlarge As for the launch vehicle pictured above, the Saturn IB was the final in a series that began with the Saturn V check-out vehicle, followed by 12 flight Saturn V rockets for the Apollo Moon program and a final Saturn V to launch Skylab in 1973. Four of the smaller Saturn IB rockets, including three for Skylab missions and the one pictured above – for the Apollo-Soyuz Test Project mission – were also stacked. A further Saturn IB was assembled for the Skylab rescue mission but was not needed and so not launched. The March 1975 rollout of this final Saturn IB happened relatively early in the life of NASA's cavernous VAB, which the agency finished building less than a decade previously, in 1966. In July 1975, NASA used the rocket to launch the first international human spaceflight collab – the Apollo-Soyuz test project. As for what was rolled out of the building in March that year, the Saturn IB rocket sat atop a \"milkstool\" and was attached to its Launch Umbilical Tower (LUT) as the crawler-transporter carrying it made its way to the launch pad. The 39-meter (128 ft) tall pedestal allowed the smaller Saturn IB rocket to use the same facilities on the mobile launcher as the larger Saturn V. The rocket itself comprised a Saturn IB first stage and a Saturn IVB second stage. As well as the Command/Service Module (CSM), the payload also included a docking module for the joint US and USSR mission. Fifty years later, the VAB continues to endure and is currently being used to stack NASA's Space Launch System (SLS). Earlier this week, technicians completed attaching the stacked solid rocket booster to the core stage, preparing the vehicle for the upcoming crewed Artemis II mission around the Moon. The launch vehicle stage adapter, interim cryogenic propulsion stage, Orion stage adapter, and the Orion spacecraft itself will be lifted atop the core stage over the coming weeks. A hint of the future is visible beyond the VAB, next to the launchpads, where SpaceX is assembling the launch tower for its Starship vehicle. Starship has yet to reach orbit, and its last few test flights have not gone well, but SpaceX intends to launch it from Florida at some point in the future. The VAB does not feature in SpaceX's plans though. While it hosted the Space Shuttle after that final Saturn rocket rolled out, its future is all about the SLS. However, considering the structure was initially built for stacking Saturn rockets, please raise a glass to commemorate half a century since the final rollout of a Saturn-class rocket from the cavernous building. ® Send us news",
        "date": "2025-03-26",
        "content_length": 3048,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:30.637471"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/26/schneider_electric_ai_investment/",
        "title": "Schneider Electric pumps $700M into US ops as AI datacenter demand surges",
        "author": "Tobias Mann",
        "description": "",
        "content": "Schneider Electric plans to spend $700 million through 2027 to expand its US operations and bolster the supply of its power equipment necessary to sustain the proliferation of AI datacenters. The investment, Schneider's largest single capital splurge in America, comes as bit-barn builders grapple with shortages of key power and thermal management equipment. As we reported last week, lead times for datacenter physical infrastructure now average 28 weeks for many electrical and thermal systems, with chillers, transformers, switchgears, and generators — all things, we note Schneider Electric manufactures — taking considerably longer. To address these needs, over the next two years, Schneider hopes to open new facilities or modernize existing ones across at least eight sites in six states – Tennessee, Massachusetts, Texas, North Carolina, Missouri, and Ohio – and hire 1,000 workers in manufacturing, engineering, development, and technical analysis roles. These efforts will include ramping up the production of power switching and distribution equipment, circuit breakers, and other \"medium-voltage\" systems, alongside establishing test and research facilities specific to robotics and AI datacenters. In addition to capitalizing on AI infrastructure demand, by bolstering US manufacturing, the French multinational no doubt sees an opportunity to sidestep the Trump administration's obsession with tariffs. Schneider's US expansion comes a week after Nvidia CEO Jensen Huang set the tone for the next generation of \"AI factory\" datacenters purpose-built to train and run machine-learning workloads. Today, Nvidia's rack-scale systems, like its Blackwell Ultra GB300 NVL72 announced at GTC, top out at around 120kW per rack. However, by the end of 2027, Nvidia wants to cram upwards of 600kW of compute into a single densely-packed rack containing 576 GPUs. In order to achieve this goal, Huang emphasized the rest of the industry needs to catch up. Schneider Electric, for its part, is already working with Nvidia to develop datacenter reference designs optimized for AI workloads. At GTC last week, the two companies revealed their work on a digital twin that simulates the operations of an AI datacenter. The idea is these simulations will help operators to predict energy needs and adjust the design accordingly — something that will no doubt come in handy as hyperscalers and cloud providers begin deploying Blackwell accelerators in volume later this year. Speaking of which, Apple may be cozying up to Nvidia as well. A research note from Loop Capital claims the iGiant is in the process of placing an order for roughly $1 billion of Nvidia's new GB300 NVL72 systems, which are said to be selling for between $3.7 and $4 million apiece if the report is to be believed. The Register reached out to Apple and Loop Capital for comment; we'll let you know if we hear anything back. Similar to Schneider, Apple earlier pledged a hefty $500 billion toward US operations - including manufacturing - over the next four years. These investments include a new facility in Texas that will produce AI-accelerated servers to power its Apple Private Cloud Platform and the so-far-fabled Apple Intelligence services. From what we understand, these systems will use the iGiant's custom silicon, but it's possible Apple is interested in Nvidia's kit for something like model training as well. ® Send us news",
        "date": "2025-03-26",
        "content_length": 3407,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:34.133029"
    },
    {
        "source": "The Register",
        "category": "technology",
        "region": "europe",
        "country": "uk",
        "url": "https://www.theregister.com/2025/03/26/ncsc_influencers_2fa/",
        "title": "NCSC taps influencers to make 2FA go viral",
        "author": "Connor Jones",
        "description": "",
        "content": "The world's biggest brands have benefited from influencer marketing for years – now the UK's National Cyber Security Centre (NCSC) has hopped on the bandwagon to preach two-factor authentication (2FA) to the masses. It's the latest effort to improve the nation's cyber resilience as part of the Stop! Think Fraud campaign launched in February 2024 under Rishi Sunak's government, drafting in comedic sketch artists and Instagram personal finance gurus to promote wider uptake of security technologies. In one video posted by comedy skit account thesquidvids in their typical style, the three social media stars satirize all the hack tropes that TV shows and movies have exhausted over the years. In the form of a movie password-hacking sequence, they talk about breaking down a firewall and \"obscuring the mainframe using a trojan horse,\" re-reversing the polarity by \"dropping a logic bomb,\" and successfully \"copying the blockchain.\" The skit all plays out with colorful code floating around a TV as if done using a crude PowerPoint presentation in the background, all against a backing track of Mission Impossible-esque action-thriller music to really give it that Hollywood-style urgency. The social media comics then correctly guess an account password (BulldogSlapheadJalfrezi47?), which follows the NCSC's recommended Three Random Words guidance as well as a number and special character, but find themselves stumped when 2FA kicks in to protect the account. \"What, so there's literally nothing we can do?\" said one accomplice to the ringleader. \"Nope,\" he responded. \"As long as he's got two-step verification we're not getting any further, I don't think.\" \"Fair enough. I guess that's the end of the film really.\" The video from edjonesuk sees a team of criminals (\"Masters of Mayhem\") trying to console their distraught colleague who hasn't \"done any frauds\" because 2FA keeps getting in the way. Millennialmoneyuk's version is much drier and simply talks about the dangers of not enabling strong account protections. The NCSC's efforts to promote cybersecurity and the various ways organizations and consumers can improve their defenses against cyberattacks have previously involved blog posts, podcasts, working with news organizations, and updating their own social media feeds. An NCSC spokesperson told The Register that the latest push to use influencers was to help amplify the pro-2FA message to wider audiences. \"To boost public awareness about the crucial benefits of enabling two-step verification on their most important accounts, we've partnered with popular social media influencers to amplify this vital message and encourage a wider audience to adopt secure online habits,\" they said. The latest round of influencer engagement marks the NCSC's second foray into this type of marketing. It previously used personal finance, family, and comedy influencers in November to spread the not-so-festive cheer about Christmas scams. We also asked the NCSC how much these influencers were paid for their time, alas it didn't respond. The NCSC supports the Stop! Think Fraud campaign along with Action Fraud, the UK's cybercrime reporting organization, and the National Crime Agency (NCA), the UK's law enforcement agency for serious and organized crime. At its launch last year, Stop! Think Fraud was billed as a \"ground-breaking step forward\" in the fight against fraud, a crime that former security minister Tom Tugendhat said \"ruins lives.\" The campaign was created to reach a mass audience and is supported by various industries including tech, finance, and retail, as well as victim care agencies and consumer groups. ® Send us news",
        "date": "2025-03-26",
        "content_length": 3653,
        "language": "en",
        "scraped_at": "2025-03-26T23:05:37.102787"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-26/hipnocracia-o-el-regimen-de-la-sociedad-adormecida-con-dos-sumos-sacerdotes-trump-y-musk.html",
        "title": "“Hipnocracia” o el régimen de la sociedad adormecida con dos sumos “sacerdotes”: Trump y Musk",
        "author": "Author not found",
        "description": "Un encuentro internacional sobre IA advierte del uso de las tecnologías de la información sin límites para acabar con la ciudadanía crítica e informada",
        "content": "Multitud de investigaciones lo vienen advirtiendo: los memes no son inocuos; para los extremismos, es el lenguaje más eficaz de difusión de sus ideas. Las redes son herramientas de polarización e injerencia sofisticadas. Los bulos creados con inteligencia artificial (IA) generan una realidad falsa indistinguible y amenazan la democracia. La propia IA nace con sesgos que no son inocentes. Detrás de todo este arsenal hay una estrategia que el filósofo hongkonés Jianwei Xun define como “hipnocracia”, un concepto que Cecilia Danesi, investigadora en el Instituto de Estudios Europeos y Derechos Humanos (Universidad Pontificia de Salamanca), resume como “dictadura digital que permite modular directamente estados de conciencia” mediante la “manipulación a través de las historias que consumimos, compartimos y creemos”. La finalidad es la eliminación de una ciudadanía crítica e informada y precisa de la supresión de cualquier salvaguarda. Jianwei Xun, autor de Hipnocracia: Trump, Musk y la nueva arquitectura de la realidad (aún no editado en español), afirma que este régimen es “el primero que opera directamente en la conciencia”: “No reprime el pensamiento, sino que induce y manipula los estados emocionales”. El objetivo es “adormecer el pensamiento crítico” utilizando la información como “humo hipnótico” a partir de “abrumar los sentidos con estímulos constantes” y conseguir que “realidad y simulación se vuelvan sinónimos”. Para Danesi, integrante del reciente encuentro AI Action Summit celebrado en Cannes (Francia) que abordó la situación, esta fragmentación “erosiona y cambia radicalmente la manera en que los ciudadanos perciben la realidad y toman decisiones políticas, una situación que exige un análisis profundo y una regulación eficaz”. “La primera perjudicada es, sin duda, la democracia”, alerta. En estas condiciones, según escribe el pensador hongkonés, “el poder evoluciona más allá de la fuerza física y la persuasión lógica”. “Se ha vuelto gaseoso, invisible, capaz de infiltrarse en todos los aspectos de nuestras vidas (…) Estamos en un estado permanente de hipnosis donde la conciencia permanece atrapada, pero nunca completamente tranquila”, sostiene. Como ha recordado en el foro francés Gianluca Misuraca, director científico de la iniciativa europea AI4Gov, los sumos “sacerdotes” de este nuevo régimen son el presidente de EE UU, Donald Trump, y su mano derecha, el multimillonario Elon Musk. Ambos lideran lo que Jianwei Xun identifica como “capitalismo digital”, donde “los algoritmos no son herramientas de cálculo y pronóstico, sino tecnología hipnótica de masas”. Según abunda Danesi, codirectora del máster en gobernanza ética de la IA en la UPSA, “la hipnocracia permite una injerencia más profunda y silenciosa, manipula nuestro pensamiento sin que nos demos cuenta, lo cual es más peligroso todavía porque es más difícil de advertir”. Y para que la capacidad hipnótica de este exacerbado liberalismo digital funcione hay una premisa fundamental: la ausencia de regulación. Empresas de redes sociales, como X, propiedad de Musk, o Meta, de Mark Zuckerberg, han eliminado la moderación de contenidos. Otras plataformas de IA han comenzado a eliminar restricciones a respuestas sobre cuestiones potencialmente dañinas. El Instituto Nacional de Estándares y Tecnología (NIST, por sus siglas en inglés) ha requerido a los científicos del Instituto de Seguridad de Inteligencia Artificial de EE UU (AISI, por sus siglas en inglés), creado por Joe Biden en 2023 para anticipar los problemas que pueda generar la IA, a que eludan el desarrollo de herramientas “para autenticar y rastrear la procedencia de los contenidos” o “etiquetar” el elaborado con los nuevos modelos de lenguaje. Trump rechaza la moderación de contenidos y reclama su supresión en aras de una supuesta libertad de expresión. Una orden ejecutiva emitida por el presidente estadounidense en enero justifica la medida: “Para mantener el liderazgo, debemos desarrollar sistemas de IA que estén libres de sesgos ideológicos o agendas sociales diseñadas”. “Es una falacia”, replica Danesi: “Esta idea de a mayor regulación menor desarrollo o progreso es una idea falsa porque los sectores más regulados, como el farmacéutico o los bancos, son los que más ganancias tienen. El problema es cuando la regulación está mal hecha y eso sí implica una obstrucción a la innovación. La clave está en cómo regular para garantizar valores supremos como los derechos humanos o fundamentales”. Esta ausencia de control y moderación genera, según explica la investigadora, “la proliferación de imágenes generadas por IA que fundamentan noticias falsas (deep fakes), la fácil viralización del contenido, independientemente de su veracidad, y las narrativas manipuladas”. “Han convertido la desinformación en una de las amenazas más graves para los sistemas democráticos”, advierte. Ante esta situación, y en contradicción con el liberalismo sin límites en la red defendido por Trump y plataformas tecnológicas masivas, la mayoría de los usuarios de herramientas digitales piden restricciones al contenido dañino internet, como las amenazas físicas, la difamación, la intolerancia y el odio, según una encuesta a gran escala realizada por la Universidad Técnica de Múnich (TUM) y la Universidad de Oxford en 10 países de Europa, América, África y Australia, donde se ha prohibido el acceso a redes sociales a los menores de 16 años. De media, el 79% de los encuestados cree que las incitaciones a la violencia en internet deben eliminarse. Los más favorables (86%) son alemanes, brasileños y eslovacos mientras que, en EE UU, el apoyo a estas restricciones baja al 63%. Solo el 14% de todos los encuestados cree que las amenazas deben mostrarse para que los usuarios puedan responder a ellas y el 17% defiende que debe permitirse el contenido ofensivo para criticar a ciertos grupos de personas o para que una opinión capte la atención (20%). El país con el mayor nivel de respaldo a esta actitud es Estados Unidos (29%) y el apoyo más bajo se registra en Brasil (9%). A la pregunta de si prefieren redes con libertad de expresión ilimitada o libres de odio o desinformación, en todos los países, la mayoría optó por plataformas seguras frente a la violencia digital y la información engañosa. “La mayoría de las personas quieren plataformas que reduzcan el discurso de odio y el abuso. También en Estados Unidos, un país con un compromiso histórico con la libertad de expresión en el sentido más amplio”, comenta Yannis Theocharis, principal autor del estudio y profesor de Gobernanza Digital en la Escuela de Política y Políticas Públicas de Múnich. No obstante, según matiza Spyros Kosmidis, coautor del trabajo y profesor de Política en la Universidad de Oxford, “Los resultados también muestran que no hay un consenso universal en relación con la libertad de expresión y la moderación. Las creencias de las personas dependen en gran medida de las normas culturales, las experiencias políticas y las tradiciones jurídicas de los distintos países. Esto hace que la regulación global sea más difícil”. Tampoco está claro quién debe mantener la seguridad en internet frente a contenidos dañinos y los porcentajes se reparten de forma similar entre quienes atribuyen esta responsabilidad a las plataformas, a los gobiernos o a los propios usuarios. En cualquier caso, sea quien sea el responsable, la mayoría de los usuarios (59%) considera que los contenidos ofensivos, de intolerancia u odio son inevitables y cuentan con reacciones de esta naturaleza (65% de media y 73% en Estados Unidos) cada vez que publican algo. “Notamos una resignación generalizada. La gente tiene la impresión de que, a pesar de todas las promesas de lidiar con el contenido ofensivo, nada está mejorando. Este efecto de aclimatación es un gran problema porque está socavando gradualmente las normas sociales y normalizando el odio y la violencia”, advierte Yannis Theocharis. Ivado, un grupo de investigación canadiense, e Iniciativa AI y Sociedad de la Universidad de Ottawa, proponen cuatro medidas para evitar la erosión del sistema de convivencia democrático: un marco regulatorio claro que incluya normas para la IA durante las elecciones, códigos de conductas en este campo para los partidos, equipos de seguimiento con planes de respuesta a amenazas y la creación de un consorcio internacional para actuar en caso de interferencia. “Con nuestras democracias amenazadas, la interferencia impulsada por la IA requiere acciones rápidas y concretas por parte de los líderes, tanto a nivel nacional como internacional. Sin un esfuerzo global concertado para alinear las leyes, crear capacidad y desarrollar procesos para mitigar los riesgos de la IA, las democracias de todo el mundo siguen siendo vulnerables”, advierte el profesor Florian Martin-Bariteau, director de la Iniciativa IA y Sociedad de la Universidad de Ottawa. Europa comenzó a andar ese camino normativo con la AI act, pero Danesi lamenta: “Ante la coyuntura internacional, la UE ha puesto el freno de mano por esta idea de que, si sobrerregulamos, frenamos la innovación”. “Pero no se trata de dejar de regular, sino de cómo lo hacemos, de qué valores tenemos y queremos potenciar”, insiste. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "26 mar 2025 - 05:20CET",
        "content_length": 10053,
        "language": "es",
        "scraped_at": "2025-03-26T23:05:40.650369"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/ciencia/2025-03-25/una-rana-apestosa-facilita-el-desarrollo-de-antibioticos-sinteticos-contra-patogenos-resistentes.html",
        "title": "Una rana apestosa facilita el desarrollo de antibióticos sintéticos contra patógenos resistentes",
        "author": "Author not found",
        "description": "Una investigación a partir de las secreciones de un anfibio desvela la fórmula para el diseño de fármacos que no dañan a las células sanas y respetan la microbiota",
        "content": "Durante muchos años, los investigadores se han preguntado cómo las ranas logran evitar infecciones rápidamente, pese a vivir en ambientes altamente contaminados. Un ejemplo notable es la rana asiática Odorrana andersonii, rebautizada así como homenaje al zoólogo estadounidense John Anderson (1833-1900) y a la que también se la conoce como rana apestosa por el olor desagradable que emite para ahuyentar a posibles depredadores. Pero este no es su único mecanismo de defensa. Al igual que otros anfibios, también secreta péptidos (moléculas formadas por la unión de varios aminoácidos) antimicrobianos por la piel que le ayudan a evitar infecciones bacterianas y fúngicas en el entorno húmedo que habitan. Sus compuestos son eficaces incluso ante cepas resistentes a los antibióticos convencionales. Esta peculiaridad ha llevado al laboratorio del biotecnólogo español César de la Fuente en la Universidad de Pensilvania a fijarse en ellos para desarrollar péptidos sintéticos con capacidades antibióticas frente a patógenos que resisten a los fármacos actuales y que preserva la microbiota intestinal. Sus desarrollos los recoge este martes Trends in Biotechnology (Cell). Inspirados en las moléculas naturales de la Odorrana andersonii, sobre la que ya había descripciones científicas previas, el Machine Biology Group, liderado por César de la Fuente, ha desarrollado péptidos sintéticos con eficacia en las pruebas realizadas ante infecciones bacterianas gramnegativas, multirresistentes y responsables de afectaciones en heridas, el tracto urinario y el torrente sanguíneo así como de neumonías, peritonitis e incluso meningitis. “Se había descrito hace unos años que la Odorrana andersonii generaba compuestos que podrían ser antibióticos. Tomamos esas secuencias y modificamos sus aminoácidos de manera sistemática para averiguar cuáles eran los que contribuían a la función antibiótica. Eso nos permitió entender una serie de reglas para diseñar moléculas nuevas, sintéticas, más potentes contra bacterias clínicamente relevantes, que no fueran tóxicas, que no afectasen al microbioma, que no tuviesen efectos adversos y ante los que las bacterias no desarrollan resistencias. Es muy prometedor”, resume De la Fuente. El nuevo sistema ha consistido en, a partir de la base molecular obtenida de la rana, utilizar bioingeniería, biología sintética y modelado computacional para modificar características clave, como la capacidad de las moléculas para unirse a las membranas bacterianas (hidrofobicidad) y su carga eléctrica, para atacar al patógeno sin afectar a las células sanas o microbiota del intestino. “Este método no solo aumenta la eficacia, sino que también disminuye el riesgo de resistencia y ofrece una alternativa más sofisticada a los antibióticos convencionales”, explica la investigadora italiana Angela Cesaro. La actividad antimicrobiana ha dado resultados similares a los de antibióticos existentes como la polimixina B y la levofloxacina, pero sin estimular la resistencia de los patógenos a los fármacos actuales. “En contraste con los antibióticos de amplio espectro convencionales, nuestros péptidos se dirigen de manera específica a los patógenos gramnegativos, al mismo tiempo que mantienen intactas las bacterias grampositivas y los microorganismos beneficiosos del intestino. Esta es una característica poco común y valiosa que podría conducir al desarrollo de terapias antimicrobianas más precisas y avanzadas”, detalla la investigadora, también española, Lucía Ageitos Castiñeiras. Los compuestos han sido testados en modelos de ratón de relevancia preclínica y permitieron la disminución significativa de infecciones de piel y profundas del músculo. La clave del trabajo, que ha supuesto años de investigaciones, no es solo el hallazgo de los compuestos, sino el proceso sistemático para su desarrollo, lo que permite seguir avanzando en la creación de moléculas en el laboratorio. “Nos permite conocer las reglas del juego, los principios básicos y fundamentales, cómo funcionan estos péptidos y cómo podemos aprender de las moléculas naturales para luego poder programar moléculas completamente sintéticas que pueden ser potenciales terapias en un futuro”, resalta De la Fuente. Con el trabajo, para el investigador, se han saldado “cuentas pendientes” en el desarrollo de potenciales antibióticos. Una de ellas es vencer la capacidad de las bacterias para hacerse resistentes a los fármacos, una de las amenazas de la humanidad, según la Organización Mundial de la Salud; otra es desarrollar compuestos que no sean tóxicos para las células humanas; y la última, evitar el efecto adverso habitual de los antibióticos actuales, que matan también las bacterias buenas del sistema digestivo humano, esenciales para mantener la salud y el bienestar. “A medida que la resistencia a los antibióticos sigue en aumento, el desarrollo de terapias de próxima generación se ha convertido en una prioridad global. Estos hallazgos subrayan el papel vital que la innovación en la investigación puede desempeñar en la protección de la salud pública”, afirma De la Fuente. “La resistencia bacteriana a los antibióticos representa una amenaza existencial para la humanidad. Sin una sólida inversión en investigación básica y traslacional será imposible afrontar con éxito este desafío global tan grave”. Coincide con este planteamiento Sophia Padilla, autora principal de un estudio publicado en Journal of the American Chemical Society sobre una droga con potencial antibacteriano. La investigadora admite que la carrera de los antibióticos supone un esfuerzo continuo y costoso y aboga por la innovación en este campo. “En términos de desarrollo, creo que no deberíamos centrarnos únicamente en modificar lo que ya sabemos que funciona, sino más bien en adoptar un nuevo enfoque”, defiende. Padilla, con un equipo de la Universidad de California-Irvine, ha descrito el desarrollo de un candidato a fármaco que puede detener las bacterias antes de que tengan la oportunidad de causar daño. Se trata de una variante de un medicamento existente para bacterias intestinales llamado vancomicina y que se usa como último recurso para pacientes extremadamente enfermos. La nueva versión se une a las moléculas que las bacterias necesitan para construir una pared celular protectora. Por otra parte, un equipo de investigación de la Universidad de Illinois Urbana-Champaign, dirigido por el profesor de bioquímica Joe Sanfilippo, ha probado agentes antibióticos contra el Pseudomonas aeruginosa, considerado uno de los patógenos más resistentes. Introdujeron los medicamentos en un fluido y detectaron que la eficacia era mayor cuando las tasas de flujo eran más altas. “Mediante el uso de esta tecnología microfluídica, a menudo utilizada en ingeniería, en un entorno biológico, descubrimos que el flujo de fluido es muy importante para la actividad de los antibióticos. Tenemos la oportunidad de mejorar nuestra detección y pruebas de drogas considerando este efecto”, explica Sanfilippo. El equipo publicó sus resultados en la revista Science Advances. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "25 mar 2025 - 16:30CET",
        "content_length": 7892,
        "language": "es",
        "scraped_at": "2025-03-26T23:05:43.825849"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-25/el-laboratorio-23andme-se-declara-en-quiebra-que-pasara-con-los-datos-geneticos-de-sus-15-millones-de-clientes.html",
        "title": "El laboratorio 23andMe se declara en quiebra: ¿qué pasará con los datos genéticos de sus 15 millones de clientes?",
        "author": "Author not found",
        "description": "La empresa estadounidense, incapaz de lograr la rentabilidad, ya fue investigada por Protección de Datos cuando se rumoreó que podía ser comprada por una aseguradora",
        "content": "La aventura de la startup biotecnológica que fascinó a Silicon Valley llega a su fin. 23andMe se hizo mundialmente conocida en 2007, cuando se convirtió en la primera empresa en vender kits de análisis genéticos. Fundada por Anne Wojcicki, entonces mujer de Serguéi Brin, cofundador de Google, 23andMe abanderó la democratización de los análisis genéticos. Pero el negocio no le ha ido bien. Su salida a Bolsa en 2021 fue un fracaso: se la valoró en unos 3.500 millones de dólares, la mitad de lo que aspiraba a obtener, y su incapacidad para obtener ingresos le hizo perder el año pasado en torno al 80% de su valor bursátil. La agonía ha concluido esta semana, iniciada con una valoración de menos de 20 millones: la empresa se ha declarado en quiebra y Wojcicki ha dimitido. Quien se la compre se llevará un botín extremadamente delicado: los datos genéticos de los 15 millones de clientes de 23andMe. En septiembre del año pasado, en plena caída en picado del precio de sus acciones, Wojcicki anunció que escucharía ofertas de posibles compradores, extremo que negaron un mes más tarde a EL PAÍS fuentes de la compañía. La prensa especuló con que decían que entre los interesados en hacerse con el laboratorio estaría una importante aseguradora de EE UU, que podría usar los datos genéticos, por ejemplo, para saber si sus clientes son o no propensos a contraer ciertos tipos de cáncer u otras enfermedades rastreables en el ADN y subirles así la póliza. ¿Qué pasará con los datos genéticos de los clientes españoles de 23andMe? En una carta abierta a sus clientes, la compañía asegura que los datos están a salvo, y que seguirán custodiados con las máximas garantías. Más allá de esa declaración de intenciones, con la ley en la mano, los usuarios no deberían tener nada que temer. El Reglamento General de Protección de Datos (RGPD) no solo afecta a las empresas europeas, sino también a las extranjeras que operen con datos de ciudadanos de la UE. Los clientes europeos de la biotecnológica pueden solicitar la supresión de sus datos. Los datos genéticos entran dentro de una categoría especial de datos personales, recogidos en el artículo 9 del RGPD. Su tratamiento está prohibido, salvo contadas excepciones, y se debe contar siempre con consentimiento expreso del afectado. Esas precauciones se deben a que no hay ningún dato biométrico más inmutable que el ADN: es una especie de matrícula personal e intransferible de cada ser humano que permite reconocerle inequívocamente, a él y a su familia. Una persona se puede borrar las huellas dactilares, alterar el rostro para intentar burlar los métodos de reconocimiento facial o incluso arrancar los ojos para evitar que se le lea el iris. El genoma, en cambio, nos acompaña desde antes de nacer (está ya presente en el feto) hasta la muerte. The 23andMe Special Committee released news today indicating their plan to take the company through the Chapter 11 process.   While I am disappointed that we have come to this conclusion and my bid was rejected, I am supportive of the company and I intend to be a bidder.   I have… La posibilidad de que los datos genéticos que atesora 23andMe cayeran en otras manos propiciaron el año pasado la apertura de un expediente por parte de la Agencia Española de Protección de Datos (AEPD). Según fuentes de la Agencia, el expediente sigue en trámite a día de hoy. La AEPD ya inició un proceso similar en 2021 con la firma israelí MyHeritage, una plataforma que ofrece análisis genéticos para construir árboles genealógicos. En ese caso, el procedimiento se abrió a partir de una reclamación de la Organización de Consumidores y Usuarios (OCU) por tratamiento inadecuado y cesión a terceros de los datos genéticos de los usuarios. MyHeritage fue multada y forzada a cambiar sus procesos en España. ​​23andMe, que recibe su nombre de los 23 pares de cromosomas que tienen las células humanas, fue pionera en el lanzamiento al mercado de kits de análisis genéticos. En el informe que ofrecen a sus clientes, aportan información sobre los ancestros o sobre la predisposición del usuario a contraer determinadas enfermedades. Su método de toma de muestras de saliva para capturar ADN, hoy de referencia en el sector, fue considerado el invento del año en 2008 por la revista Time. Los tests, disponibles a partir de unos 55 euros, los envían a casa: hay que escupir en un tubo, dárselo de vuelta a un mensajero y a las pocas semanas ofrecen los resultados. Pero el negocio no ha funcionado tan bien como se esperaba. Su salida a Bolsa en 2021 fue desastrosa. Los ingresos no cumplieron expectativas, y los analistas apuntaban ya en 2024 que, a ese ritmo, acabarían con sus reservas de caja en 2025. La búsqueda de nuevos clientes llevó a 23andMe a meterse en el negocio de los productos para adelgazar. En concreto, estaban tratando de encontrar variaciones genéticas que puedan servir a sus usuarios para perder peso. La situación se complicó en septiembre pasado con la dimisión en bloque toda la junta directiva, a excepción Wojcicki, al no encontrar ofertas de compra que puedan rescatar la empresa. La nueva junta siguió adelante y, en marzo, un comité especial evaluó qué posibles estrategias podía seguir la compañía. Wojcicki presentó varias propuestas para hacer que la empresa dejara de cotizar, pero todas fueron rechazadas. La última de ellas, que obtuvo luz roja a principios de mes, contemplaba que la millonaria se hacía con la compañía pagando 41 céntimos por acción. Eso hizo que los títulos de 23andMe acabaran la jornada a 1,47 dólares, un 99% menos que su pico de 2021. “Si bien estoy decepcionada porque hayamos llegado a esta conclusión y mi oferta haya sido rechazada, apoyo a la empresa y tengo la intención de seguir siendo una posible compradora”, dijo ayer Wojcicki en la red social X. “Hemos tenido muchos éxitos, pero también asumo la responsabilidad por la situación que tenemos hoy. No hay duda de que los desafíos a los que se ha enfrentado 23andMe debido a un modelo de negocio en evolución han sido reales, pero mi confianza en la empresa y su futuro es inquebrantable”, añadió. 23andMe llegó a un acuerdo en 2018 con la británica GlaxoSmithKline, una de las mayores farmacéuticas del mundo, por más de 300 millones de dólares para el “desarrollo de nuevos medicamentos”. Solo se usaron los datos de los usuarios que lo consintieron. En diciembre de 2023, 23andMe fue hackeada, dejando al descubierto la información genética de siete millones de usuarios. La respuesta oficial fue echarle la culpa a los usuarios: les recomendó usuarios que cambiaran su contraseña y estableció un método de doble autenticación para entrar en sus cuentas. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "25 mar 2025 - 13:14CET",
        "content_length": 7485,
        "language": "es",
        "scraped_at": "2025-03-26T23:05:47.610988"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-25/lo-ultimo-en-ereaders-son-las-pantallas-a-color.html",
        "title": "Lo último en eReaders son las pantallas a color",
        "author": "Author not found",
        "description": "Estos lectores mantienen los beneficios de las pantallas E Ink, pero con la posibilidad de ver ilustraciones, fotografías y otras imágenes a color ",
        "content": "Si tuviera que elegir una tendencia en lo que a eReaders se refiere serían, sin ninguna duda, los modelos con pantalla a color. Y es que en los últimos meses hemos pasado de ver alguno suelto a que las principales marcas, incluidas Kobo y Kindle, ya tengan sus propios lectores con una superficie de este tipo. Y no, no se trata de dispositivos con una pantalla como la de las tablets o los móviles. En realidad, siguen empleando tecnología E Ink, aunque en una versión —la Kaleido— que añade una capa con un filtro de color que aporta esta característica. De esta manera, se mantienen todos los beneficios de la tecnología de tinta electrónica: imitan el papel, no tienen reflejos, se puede leer a plena luz del sol, no cansan la vista, consumen poca energía… También tienen sus limitaciones. Por eso mismo, no es de extrañar que tampoco se vean como la pantalla de una tableta: aunque se están perfeccionando bastante, las imágenes se ven como lavadas, y no tienen la intensidad de colores que se consigue en otro tipo de dispositivos. Además, se limitan a imágenes fijas: viñetas de cómics, portadas, gráficos, ilustraciones, fotografías… nada de vídeos. ¿Cuáles son las opciones? Cuando a finales del pasado año Amazon anunció la renovación de sus populares Kindle, entre las novedades estaba, precisamente, el Kindle ColorSoft Signature Edition; un modelo muy parecido al Kindle Paperwhite —el más vendido de la firma—, con el que comparte la pantalla de 7 pulgadas, la resolución de 300 ppp en las imágenes en blanco y negro, la luminosidad, la resistencia al agua y el sistema de iluminación frontal que se adapta automáticamente a las condiciones del entorno. Tiene algo menos de autonomía, eso sí. Aunque no es una firma muy conocida, Pocketbook lleva desde 2021 diseñando eReaders a color. Uno de sus últimos modelos es el Verse Pro Color que, además, tiene una función muy curiosa: es capaz de transformar cualquier texto en un audiolibro que luego se escucha por unos auriculares o en un altavoz Bluetooth. Hacerlo es tan fácil como seleccionar una opción en el menú que se despliega dentro de cada libro: es posible elegir entre una amplia variedad de tonos de voz masculinos y femeninos, y funciona en 26 idiomas. La característica diferencial del Kobo Libra Colour (uno de los dos eReaders a color que tiene la firma) es que en su pantalla táctil se puede escribir. Así, cuando se utiliza junto con el Kobo Stylus 2 —que se vende por separado— se convierte en un bloque de notas con libertad total para crear. Incluso hay plantillas para realizar cuadros, listas… Dentro de los libros, además, permite realizar anotaciones o subrayar pasajes en distintos colores, como si de un subrayador tradicional se tratara. Al igual que smartphones o tabletas, BOOX Go Colour 7 funciona con sistema operativo Android, por lo que siempre y cuando esté conectado a una red Wifi se puede acceder a Google Play para descargar apps que complementen su uso como eReader: no sirve para juegos, pero sí para descargar apps de gestión de archivos en la nube, plataformas de lectura por suscripción, de noticias...  ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "25 mar 2025 - 05:20CET",
        "content_length": 3928,
        "language": "es",
        "scraped_at": "2025-03-26T23:05:51.233476"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-24/meta-lanza-por-fin-en-europa-su-asistente-de-ia-para-whatsapp-instagram-y-facebook.html",
        "title": "Meta lanza por fin en Europa su asistente de IA para WhatsApp, Instagram y Facebook",
        "author": "Author not found",
        "description": "Los usuarios podrán preguntar a un chatbot sin salir de las aplicaciones",
        "content": "Meta ha empezado a desplegar por fin en Europa su asistente de IA en sus aplicaciones de redes y mensajería: WhatsApp, Instagram, Facebook y Messenger. MetaAI llega ahora a Europa pero su lanzamiento original fue en Estados Unidos en 2023. Los usuarios irán viendo la opción de “chatear con la IA” en forma de un pequeño círculo azul en sus pantallas progresivamente durante los próximos días. No aparecerá a la vez en todos los dispositivos, advierte la compañía: “Esta función solo está disponible en ciertos países y es posible que aún no esté disponible para ti, incluso si otros usuarios en tu país tienen acceso”. De momento estará solo disponible en seis lenguas del continente: español, inglés, francés, italiano, alemán y portugués. Meta AI through WhatsApp is launching now in the EU and UK, available to answer your questions faster than you can drink your espresso 😌 La función servirá para chatear individualmente con el asistente o para invocar su participación en cualquier chat en marcha de WhatsApp escribiendo “@MetaAI”. En las redes sociales permitirá refinar la búsqueda de posts o vídeos cortos sobre determinados temas o lugares. La función permitirá generar también imágenes y editarlas. Meta dice que podrá leer únicamente los mensajes dirigidos a su IA, no el resto: “Meta solo puede leer los mensajes que mencionan a @MetaAI o aquellos que las personas eligen compartir con Meta AI. Meta no puede leer ningún otro mensaje en tus chats personales”, dice la empresa. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "24 mar 2025 - 12:23CET",
        "content_length": 2309,
        "language": "es",
        "scraped_at": "2025-03-26T23:05:54.929349"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-24/llega-la-era-de-programar-sin-saber-lenguajes-informaticos-ya-no-tiene-sentido-escribir-una-linea-de-codigo.html",
        "title": "Llega la era de programar sin saber lenguajes informáticos: “Ya no tiene sentido escribir una línea de código”",
        "author": "Author not found",
        "description": "La barrera de entrada para ser programador baja radicalmente: la IA ya permite crear apps o herramientas sin saber lenguajes específicos, y tiene hasta un nombre nuevo",
        "content": "En octubre de 2023, el programador Javi López creó un juego llamado Angry Pumpkins. No tendría un valor especial si no fuera porque lo hizo sin escribir una línea de código. Y el juego tenía 600: “Lo generó ChatGPT con prompts en español tipo ‘quiero un juego tipo Angry birds’”, dice ahora a EL PAÍS. “Al final me generó el código HTML y Javascript. Funcionaba, es tremendo, y fueron solo los inicios”, añade. López no usó la IA solo para cacharrear con código y juegos. Con su cofundador, Emilio Nicolás, creó MagnificAI, una herramienta para mejorar imágenes y la mitad de su código fuente está escrito por la inteligencia artificial. MagnificAI acabó siendo vendida a Freepik por una cantidad no revelada. There's a new kind of coding I call \"vibe coding\", where you fully give in to the vibes, embrace exponentials, and forget that the code even exists. It's possible because the LLMs (e.g. Cursor Composer w Sonnet) are getting too good. Also I just talk to Composer with SuperWhisper… “Ya no tiene sentido hoy escribir una línea de código”, sigue López. “Mucha gente se indigna. Me decían que no podía crear un programa complicado sin nociones básicas de programación porque me iba a atascar o habría un bug [error], que necesitaba conocer la arquitectura”, dice. Desde hace unas semanas esta programación sin saber código tiene incluso un nombre: “vibe coding” o “programar por sensaciones”, “dejándose llevar”. El célebre programador Andrej Karpathy, exjefe de IA en Tesla, cofundador de OpenAI y youtuber, lo bautizó así en febrero. “Entrégate completamente a las sensaciones y olvídate de que el código existe”, escribió Karphaty en X. Y añadió: “Solo hablo, apenas toco el teclado. Pido cosas tontas porque soy demasiado vago para buscarlas. Siempre le doy a ‘aceptar todo’ y cuando recibo mensajes de error, los copio y pego sin comentario alguno, y generalmente los soluciona. Hago una app, pero realmente no es programar, solo veo cosas, digo cosas, ejecuto cosas y copio y pego cosas, y suele funcionar”. La IA ha traído en los últimos dos años crisis de identidad para muchos oficios creativos: ilustradores, escritores, actores, diseñadores aún están tratando de entender el terremoto. Ahora, con la explosión de esta programación por sensaciones, les toca a los programadores. La revelación de Karphaty, que es una figura increíblemente respetada, ha provocado un debate enorme en la comunidad, donde voces como la de López se mezclan con programadores veteranos que creen que la máquina nunca llegará a su nivel: “Tardó en llegar el odio o miedo a los desarrolladores, pero parece que ha llegado”, dice López, que ha tenido polémicas públicas con ilustradores en IA: “No digo que no debas saber programación. Obviamente, si sabes irás más rápido. Pero escribir líneas de código no tiene sentido porque con herramientas como Cursor puedes con mero lenguaje natural ir indicando lo que necesitas y lo va haciendo. Antes de hacerlo te lo muestra como si lo hubiera hecho un programador de tu equipo y aceptas los cambios. La nueva forma de programar es hablando con la máquina, que va haciendo el código contigo”. La llegada de la programación hecha con peticiones en nuestras lenguas es la misma frontera que ha caído en otros oficios. Con herramientas como Cursor para profesionales, han surgido otras como Bolt, Lovable o Replit, que permiten programar en inglés o español de manera extremadamente sencilla. Cualquier usuario con ganas y cierta sensibilidad puede crear una aplicación o web para cualquier necesidad cotidiana. Es como el bricolaje llevado al código: ya no solo es posible montar estanterías caseras, ahora pueden hacerse programas para ordenar armarios, imaginar comida o estructurar el ocio familiar. 🤯 AI Coding vs CodingLeyendo con avidez este intercambio de opiniones que ha rozado la abierta hostilidad.Me ha tocado profundamente porque tanto Pieter como Jonathan son dos de las personas que más admiro desde hace años.Os dejo mi reflexión, pero primero leed el hilo 👇 pic.twitter.com/aH0YTSy4T0 La diferencia con los profesionales se mantendrá por ahora, pero con software se pueden hacer muchas cosas distintas: “Soy ingeniero informático y tengo un equipo de programadores, pero aun así, la IA me ayuda muchísimo a acelerar proyectos personales”, dice Victoriano Izquierdo, ingeniero y cofundador de Graphext. “Antes me daba pereza ponerme porque implicaba muchas horas leyendo documentación. Programar hoy día es conectar tuberías de componentes de software que alguien ha escrito antes, no tanto escribir tu propio código como si fuera un puzle. Ahora con la IA puedo desarrollar cosas útiles en pocos días, como Calmdigest.com, que hice un fin de semana y ya usan más de 500 personas”, y sirve para enviar artículos cómodamente al Kindle. Pero habrá también usuarios valientes no profesionales que llevarán estos cambios a sus trabajos. “Mi principal característica para meterme en estos temas es ser atrevida”, dice Carolina Degiorgio, supervisora de Atención Digital en una empresa de telefonía argentina, que usa la IA para hacer mejor su trabajo, lo que choca a veces con los programadores. “Se pueden lograr cosas con un acercamiento menos sacralizado del programar. Incluso en los ámbitos en los que trabajo aún hay algo de eso que hiciste sin rituales no es serio”, y a veces programadores seniors le quitaban privilegios para que retocara herramientas laborales por temor a que creara problemas. “Siempre falta algo más que aprender y eso tiene un coste y hasta a veces la sensación de no tener el género o la edad adecuada para ser útil o valiosa en esos campos”, explica Degiorgio. El proceso de aceptación de la IA para los programadores es similar al de otros sectores: al principio fue la sorpresa de la que IA era capaz de escribir código, luego vino la calma tensa porque su código seguía siendo básico. Pero con los meses han aparecido resultados cada vez mejores. Y ahora hay que aceptar que lo que hace es perfectamente útil para muchos proyectos. “Me parece un error que una empresa no tengan Cursor o Copilot [de Microsoft]. La sensación es que vas 100 veces más rápido, es increíble”, dice López. “Por muy bueno que seas programando esto te lo hará más rápido y lo estás haciendo tú igualmente. Puede indicarle que lo estructure o refactorice de otra forma, puedes escribir tú partes del código. Me da risa cuando algún programador se resiste y dice ‘es que la calidad del código que escribe no es suficientemente buena’. Vale, pero para eso estás tú, por si algo no te gusta, y lo retocas y punto. Algunos desarrolladores están confundiendo el fin con el medio”. El software hoy puede destacar el código detrás de un satélite o programas que sostienen infraestructuras críticas. Pero hay millones de líneas de código en usos más banales, aunque también útiles. Sobre todo a la hora de imaginar posibilidades y pulir ideas: “Es algo que llega en un momento clave en el desarrollo de software”, dice Daniel Seijo, ingeniero y fundador de la plataforma educativa Hawkings. “Llevábamos una década en la que la industria se había organizado hasta el absurdo. Al final tienes a mucha gente haciendo diseños, ideas o powerpoints, y poca haciendo el trabajo final. Yo podía definir un producto, y pasárselo a un equipo que lo desarrolle. Pero cuando lo tienen, ni es exactamente lo que yo había pedido, ni lo que yo había pedido es exactamente lo que había que hacer. Sin embargo, si lo voy prototipando y la IA me da ideas por el camino, no solo me permite entenderlo mejor, sino complementarlo con cosas que no había pensado”, explica. La irrupción de la IA se piensa a menudo solo como un sustituto para nuestros trabajos, pero es posible que acabe agilizando procesos y añadiendo más creatividad en todos los ámbitos. Como con otros oficios, los más beneficiados serán los que se adapten mejor, pero la IA baja enormemente el umbral de acceso: “Las herramientas de IA relacionadas con código tienen como foco generalmente un público de programadores”, dice Gonzalo Pozzo, ingeniero y streamer argentino. “¿Alguien sin conocimiento puede hacer una aplicación funcional? Sí, seguramente. Pero de ahí a lanzarla como producto, iterarla, mantenerla, es mucho más difícil. Seguro habrá alguien, pero son los menos”, añade. Habrá seguro algún tipo de frontera, pero el acceso será menor, sobre todo para un tipo de usuarios: “No creo que nadie sin conocimientos profundos de cómo funcionan los sistemas pueda programar a día de hoy algo útil. Pero la barrera de entrada para adquirirlos se reduce enormemente. Es como si todos los textos de la facultad de Derecho estuviesen escritos para ser entendidos por ti en vez de para ser ofuscados”, dice Seijo. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "24 mar 2025 - 05:30CET",
        "content_length": 9532,
        "language": "es",
        "scraped_at": "2025-03-26T23:05:58.660090"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-22/amazon-pide-un-48-mas-de-agua-para-sus-centros-de-datos-de-aragon.html",
        "title": "Amazon pide un 48% más de agua para sus centros de datos de Aragón",
        "author": "Author not found",
        "description": "La compañía alega que el consumo inicialmente previsto no es suficiente para refrigerar las instalaciones en periodos de fuerte calor",
        "content": "Amazon Web Services (AWS), la filial de computación en la nube del grupo, ha solicitado una ampliación del 48% de la disponibilidad de agua para sus tres centros de datos de Aragón (El Burgo de Ebro y Villanueva de Gállego, en Zaragoza; y Plhus, en Huesca). Así lo notificó la compañía el pasado 20 de diciembre al Instituto Aragonés de Gestión Ambiental (Inaga), el organismo responsable de otorgar o denegar los permisos ambientales necesarios para desarrollar este tipo de proyectos, en tres documentos a los que ha tenido acceso EL PAÍS. AWS anunció en mayo del año pasado una inversión récord de 15.700 millones de euros en la comunidad aragonesa hasta 2033 para ampliar los tres centros de datos que ya tenía operativos desde 2023. El Gobierno de Aragón le otorgó al proyecto la declaración de interés estratégico, lo que acelera los trámites administrativos. Microsoft también levantará su propio campus de centros de datos en la región, con una inversión estimada en torno a los 9.000 millones de euros. Uno de los requisitos para que el proyecto obtenga luz verde es obtener el visto bueno de su plan ambiental. Amazon remitió a las autoridades la documentación pertinente, pero en diciemebre mando una actualización, con el subtítulo “Proyecto de aumento del consumo de agua”. En el escrito se especifica que la compañía quiere aumentar el consumo hídrico máximo de 36,4 a 53,9 millones de litros anuales en cada uno de sus tres complejos. “Si bien los consumos originales no se excederán en un año nominal, el aumento del uso del agua está teniendo en cuenta el impacto climático”, lee la introducción de las solicitudes de Estudio de Impacto Ambiental de los tres centros de datos. “La exposición a periodos prolongados de altas temperaturas ambientales tiene un impacto inevitable y directo en el agua consumida por los centros de datos, haciendo que la demanda de agua de abastecimiento durante los periodos de calor aumente”, se dice también. Es decir, Amazon justifica ese aumento del 48% por el cambio climático. Los centros de datos, que pueden imaginarse como grandes naves industriales llenas de hileras de servidores, necesitan agua para refrigerar sus sistemas. Cuando la temperatura de esas instalaciones excede los 28 grados, se activan métodos para enfriar los procesadores y evitar que se estropeen. Hay distintas técnicas para evitar que se sobrecalienten las máquinas: desde la pulverización de agua fría en el ambiente hasta otros sistemas más sofisticados de circuito cerrado que hacen recircular el agua por los circuitos y que, tras evaporarse, se recupera con condensadores. El aumento del 48% que propone Amazon se debe a que la compañía estima que habrá más días cálidos al año de lo previsto, y que, por tanto, sus sistemas de refrigeración tendrán que emplearse con más frecuencia de lo indicado en la primera memoria ambiental. “Llama la atención que los cálculos de días calurosos son los mismos para los tres complejos, independientemente de si se encuentran en zonas urbanas o no”, apunta Luis García, del grupo de Ecologistas en Acción de Centros de Datos. Esa ONG, junto con Tu Nube Seca Mi Río, acaban de presentar una nueva ronda de alegaciones contra la ampliación de los proyectos. Lo hicieron en cuanto se les notificó, en febrero, la solicitud de Amazon para obtener más agua para sus centros de datos. “Aunque Amazon tiene razón en que el cambio climático eleva los días anuales de altas temperaturas, no lo consideramos un motivo que justifique un aumento del consumo de agua para su actividad”, sostienen estos colectivos. “Primero, porque el cambio climático ya se tuvo que haber tenido en cuenta en la solicitud original de autorización ambiental, ya que no es un fenómeno que haya llegado este año. Y segundo, porque en las condiciones de estrés hídrico que se describen es precisamente cuando se debería limitar el consumo de esta industria para garantizar el acceso al agua a la población y agricultura”. En conclusión, piden “que no se tramite esta autorización ambiental y que se implemente mecanismos de vigilancia eficaces e independientes”. Fuentes de AWS, por su parte, insisten en que esta nueva petición responde al aumento de temperaturas en España y en Aragón en los últimos años. También indican que los 53,9 millones de litros anuales a los que tendrá derecho cada uno de los tres complejos es un tope “para años anómalos y extremadamente calurosos como fue 2022″. Ecologistas en Acción y Tu Nube Seca Mi Río ya presentaron en enero alegaciones al proyecto original de ampliación de los centros de datos de Amazon en Aragón. En esa ocasión defendían, entre otras cuestiones, que las promesas de empleo asociadas al proyecto no eran creíbles, que el consumo eléctrico de estos centros de datos superaría la capacidad energética actual de Aragón y que su alto consumo de agua era “inaceptable” en un contexto de creciente estrés hídrico. El ejecutivo autonómico modificó en mayo del año pasado el Proyecto de Interés General (PIGA) aprobado en 2020 para ampliar la potencia de las instalaciones de El Burgo de Ebro hasta los 100 megavatios cuando alcance su plena potencia, equiparándolo así a sus centros gemelos de Villanueva de Gállego y Huesca. Cuando los tres complejos estén totalmente desarrollados, y si llegan a trabajar a pleno rendimiento, consumirán unos 11.000 gigavatios por hora (11GWh), más de lo que gasta toda la Comunidad Autónoma de Aragón entera. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "22 mar 2025 - 05:20CET",
        "content_length": 6253,
        "language": "es",
        "scraped_at": "2025-03-26T23:06:00.854383"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-21/el-927-de-los-espanoles-cree-que-las-empresas-deben-informar-cuando-usen-inteligencia-artificial.html",
        "title": "El 93% de los españoles cree que las empresas deben informar cuando usen inteligencia artificial",
        "author": "Author not found",
        "description": "La primera encuesta del CIS sobre esta tecnología revela que el 41,1% ha usado ChatGPT en los últimos 12 meses y que al 75,7% le genera incertidumbre",
        "content": "La inteligencia artificial (IA) ha entrado con fuerza en la conversación pública. El Centro de Investigaciones Sociológicas (CIS) ha decidido realizar una encuesta centrada exclusivamente en el conocimiento que tiene la población sobre esta tecnología y en el uso que hace de ella. Entre las conclusiones del estudio destacan dos: el 92,7% de los encuestados cree que las empresas y organizaciones deben informar cuando utilizan IA en lugar de seres humanos y el 93,4% considera necesario que el desarrollo de IA sea regulado. Hay otro dato llamativo: el 41,1%, casi la mitad de la muestra (que consta de 4.004 entrevistas realizadas entre el 6 y el 15 de febrero), declara haber usado al menos una vez en los últimos 12 meses ChatGPT, una de las herramientas más famosas de IA generativa, la que proporciona contenidos a partir de instrucciones de texto. La mayoría de la población, el 92,3%, dice que ha oído hablar de este tipo de aplicaciones. Asimismo, el 75,5% de quienes conocen la IA asegura que la incertidumbre es el principal sentimiento que le provoca esta tecnología, y al 51,2% le da miedo. Solo un 27,4% contempla esta tecnología con optimismo. En este sentido, el 56% de los encuestados opina que la IA puede aportar más perjuicios que beneficios al mercado laboral. Como toda herramienta, la IA generativa también tiene su reverso negativo: esos contenidos se puede usar para desinformar o engañar a la gente. Los deepfakes, fotos o vídeos hiperrealistas falsos, se pueden convertir en una pesadilla cuando muestran imágenes sexuales no consentidas, tal y como se vio en Almendralejo. La encuesta prueba que la población es consciente de ello. El 86,9% afirma que puede ser utilizada para difundir desinformación y bulos, y el 80,6% cree que puede ayudar a cometer delitos o actos ilegales. La privacidad es otra de las preocupaciones principales de la gente en lo tocante a la IA. El 76,8% está “muy o bastante de acuerdo” con que hay que prohibir la recopilación de datos personales para su venta a terceros, y el 75,8% considera que las políticas de privacidad no son lo suficientemente claras. El área en el que la IA puede aportar más beneficios es, según la encuesta, en la medicina. Así lo cree el 66%, que también considera que puede ser clave para la industria (lo cree el 62,3%) o en la agricultura (51,8%). La IA es una tecnología que lleva lustros en el día a día de la población. Muchas de las aplicaciones más habituales en los móviles dependen de esa tecnología para funcionar: desde los navegadores y mapas, que la necesitan para calcular el mejor itinerario de un punto a otro, hasta el correo electrónico, que la usa para filtrar el spam o clasificar los emails, pasando por las plataformas de streaming, que se sirven de ella para recomendar contenidos. La irrupción de ChatGPT en noviembre de 2022 abrió una nueva era en el terreno de la IA. El chatbot inteligente de OpenAI fue la primera demostración seria de la llamada IA generativa, la que se sirve de grandes modelos de lenguaje para crear contenidos a partir de indicaciones del usuario. Desde entonces han ido surgiendo multitud de aplicaciones capaces de crear textos, imágenes, vídeos o audios cada vez más realistas. La alta capacidad de la IA generativa para redactar textos coherentes y mantener diálogos con los usuarios ha generado también en los dos últimos años cierta alarma en torno a los límites de esta tecnología. ¿Logrará superar a la inteligencia humana? En caso de que así sea, ¿qué nos sucederá? Los españoles se muestran pragmáticos en este terreno: solo el 24% ha oído hablar del manifiesto firmado en 2023 por expertos y ejecutivos del mundo de la IA para pausar el desarrollo de esta tecnología mientras que más de la mitad de la muestra ha oído hablar de la huelga de guionistas de Hollywood de 2023 o del manifiesto firmado en 2024 por importantes artistas musicales en defensa de sus derechos de autor. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "21 mar 2025 - 14:12",
        "content_length": 4741,
        "language": "es",
        "scraped_at": "2025-03-26T23:06:04.123477"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-20/meta-silencia-la-promocion-del-best-seller-de-una-exdirectiva-que-critica-la-compania.html",
        "title": "Meta silencia la promoción del ‘best-seller’ de una exdirectiva que critica la compañía",
        "author": "Author not found",
        "description": "Un tribunal impide realizar entrevistas a la antigua ejecutiva Sarah Wynn-Williams a petición de Mark Zuckerberg, a pesar de su defensa de la libertad de expresión en sus redes sociales",
        "content": "El 11 de marzo salió en inglés en EE UU el libro Careless People [Gente despreocupada], de Sarah Wynn-Williams, exdirectiva de Facebook entre 2011 y 2017. El libro llegó en seguida al top 10 de los más vendidos en Amazon. Al día siguiente, Meta logró una orden provisional de un tribunal de arbitraje que impide a Wynn-Williams promocionar su obra. El libro sigue estando a la venta y este jueves era número 2 en el ranking de no ficción de Amazon en EE UU con 4,8 estrellas de valoración y en la lista del New York Times saltó en su primera semana directamente al primer puesto. ¿Qué es lo que inquieta a Meta de este libro? Son las memorias de Wynn-Williams, una ex diplomática neozelandesa de 45 años, que fue directora de Políticas Públicas durante los años de crecimiento global de la compañía. El libro cuenta con honestidad y humor las reacciones de Mark Zuckerberg y Sheryl Sandberg al relacionarse con gobiernos, sobre todo su sumisión a China, y su trato a los empleados. La autora acusa de comportamientos inadecuados a Joel Kaplan (la llamó “ardiente”, sultry en inglés), hoy encargado de Asuntos Globales de Meta. La compañía alega que investigó a Kaplan y no encontró nada grave. Además de la medida cautelar, Meta ha emitido un comunicado especialmente duro y ha publicado un documento que repasa varias de las revelaciones de Wynn-Williams, a las que denomina “viejas noticias”. Aunque la mayor parte de las anécdotas ya eran conocidas, es más impactante leer el relato lleno de detalles de alguien que lo vivió de primera mano. Pero para Meta todo es susceptible de ser falso, según su comunicado: “[El libro] es una mezcla de afirmaciones desactualizadas y ya publicadas sobre la empresa y acusaciones falsas sobre nuestros ejecutivos. Hace ocho años, Sarah Wynn-Williams fue despedida por bajo rendimiento y comportamiento tóxico, y una investigación en ese momento determinó que hizo alegaciones engañosas e infundadas de acoso. Desde entonces, ha sido pagada por activistas antiFacebook y esto es simplemente una continuación de ese trabajo”. La compañía no ha revelado, preguntada por EL PAÍS, quiénes son esos activistas que pagan a Wynn-Williams. Wynn-Williams sigue trabajando en la industria tecnológica, pero en una entrevista previa a la orden judicial negó cobrar de nadie para publicar el libro. En una entrevista con el Times de Londres, donde vive con su marido, periodista del Financial Times, Wynn-Williams dijo que no era una exempleada vengativa, que quería “dejar entrar luz” en los entresijos de la compañía: “Tuve que preguntarme ¿a quién beneficia mi silencio? No me haría pasar por todo esto si no importara”. EL PAÍS ha tratado de hablar con Wynn-Williams y ha recibido la respuesta de un representante legal de la autora: “Por una orden judicial iniciada por Meta, a Wynn-Williams se le ha impedido comentar ahora”. El motivo por el que el tribunal ha dado la razón a Meta es que la autora incumple un acuerdo de no difamación. Wynn-Williams no declaró en el breve proceso de arbitraje. La editorial y la autora mantuvieron el libro en secreto hasta días antes de la publicación. “Estamos horrorizados por las tácticas de Meta para silenciar a nuestra autora”, ha dicho la editorial. En las pocas entrevistas que ha dado, Wynn-Williams ha contado que el motivo principal a por qué ha esperado tantos años para publicar estas memorias es China y su nuevo poder con la IA: “Estamos al borde de una nueva era tecnológica. Entramos en la era de la IA y no quiero que los errores que se cometieron durante la era de las redes sociales se repitan. Desde que salí [de Meta], he trabajado en el diálogo entre EE UU y China sobre el uso de IA en armamento. China es una parte enorme en la IA. Existe una rivalidad estratégica creciente, y [Meta] lleva mucho tiempo haciendo cosas en las sombras con el Partido Comunista chino”. Wynn-Williams ha citado en dos entrevistas la influencia que podrían tener los 18.000 millones que Meta declara recibir cada año de China, que es más de un 10% de sus ingresos, pero es dinero que proviene de empresas chinas que ponen anuncios en las redes de Meta para su audiencia global. La gran ironía de este caso es por qué Meta, que se considera una gran defensora de la libertad de expresión en sus plataformas, decide ir con todo contra ese derecho cuando el objetivo es su fundador, Mark Zuckerberg. Más, si cabe, si las noticias son ya sabidas. El portavoz de Meta, Andy Stone, se ha declarado indignado que Wynn-Williams no se ha sometido a un proceso de verificación de datos, que es precisamente el método que ya han anunciado que eliminarán en EE UU en favor de las notas comunitarias. EL PAÍS ha preguntado a Meta por esta paradoja, pero no ha recibido respuesta. Wynn-Williams ha dicho en un podcast que estas acciones son “increíblemente decepcionantes para una empresa que se enorgullece de la libre expresión” y que ha hecho “muchas declaraciones públicas sobre personas que alzan la voz y apoyan a las mujeres y todas estas cosas”. Un puñado de excompañeros de Wynn-Williams han dicho que exageraba o mentía, que Stone va recopilando en su cuenta de X. Katie Harbath, antigua encargada de elecciones en Facebook, ha escrito: “Respeto el derecho de Sarah a contar su historia. Aunque su libro contiene pequeñas verdades, está plagado de inexactitudes factuales, exageraciones y omisiones, incluyendo cosas que escribe sobre mí y el trabajo de mi equipo en elecciones”. En el libro uno de los pocos que queda relativamente bien es el español Javier Oliván, a quien Wynn-Williams llama “Javi”. En una cena en Panamá, donde Wynn-Williams estaba con Zuckerberg, escribe de Oliván: “Es uno de los pocos jefazos de Facebook con sentido del humor”. Según su relato, fue también quien alertó a Zuckerberg que Snapchat sería una amenaza porque acabaría usándose para “sexting”. Uno de los momentos más raros del libro es una fiesta en Cartagena (Colombia) donde coinciden Wynn-Williams, Oliván, un actor porno y Hillary Clinton. También explica el rol de Oliván como jefe de crecimiento para aprovechar la falta de regulación para hacer crecer Facebook sin parar en muchos países: “El equipo de crecimiento es el pulso de la empresa. Sus valores son los valores de la empresa. Sus prioridades son las de la empresa”. Zuckerberg emerge del libro como un tipo enamorado de sus ingenieros, jefe supremo, alejado de convencionalismos, cansado de políticos y dispuesto a hacer cualquier cosa para que Meta crezca, como pedirle al presidente chino Xi Jinping que escogiera el nombre de su hija (que no hizo). Wynn-Williams cuenta detalles nuevos sobre facetas ya conocidas de Silicon Valley: exigencia laboral inasumible, horarios locos en los que algunos duermen de 1 a 5 de la mañana y donde ella misma acabó respondiendo emails desde la cama donde esperaba que naciera su propio hijo. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "20 mar 2025 - 16:05CET",
        "content_length": 7672,
        "language": "es",
        "scraped_at": "2025-03-26T23:06:06.905347"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-20/hay-que-etiquetar-los-videos-generados-con-ia-que-pasa-si-no-lo-hago-preguntas-y-respuestas-sobre-la-nueva-normativa-espanola.html",
        "title": "¿Hay que etiquetar los vídeos generados con IA? ¿Qué pasa si no lo hago? Preguntas y respuestas sobre la nueva normativa española",
        "author": "Author not found",
        "description": "Estas son las principales novedades que introduce el anteproyecto de ley sobre gobernanza de la inteligencia artificial",
        "content": "El Consejo de Ministros presentó el pasado martes el Anteproyecto de ley para el buen uso y la gobernanza de la inteligencia artificial (IA), que regula la aplicación práctica de esta tecnología. El documento desarrolla lo establecido en el Reglamento Europeo de Inteligencia Artificial, acordado por las instituciones comunitarias el 8 de diciembre de 2023 y aprobado por el Parlamento Europeo el 13 de marzo del año pasado. El texto del anteproyecto de ley, abierto a consulta pública desde este martes por la tarde, concreta algunas de las cuestiones incluidas en el reglamento y las adapta a nuestro ordenamiento jurídico. Establece qué aplicaciones de IA están prohibidas, cuáles se pueden usar con permiso y cuáles no necesitan ser supervisadas. En el caso de los sistemas de reconocimiento biométrico en tiempo real, los que más controversia despertaron durante la negociación del reglamento, se indica en qué casos excepcionales podrán las autoridades autorizar su uso. También se fija un régimen sancionador y un esquema de sanciones, además de concretar qué organismos se encargarán de cerciorarse de que se cumpla la normativa, y se tendrán que identificar los contenidos generados con IA. ¿A qué obligará exactamente la nueva normativa? ¿Cuándo será de aplicación? ¿Qué multas se contemplan para quienes vulneren la ley? Estas son las novedades que introducirá en nuestra legislación el anteproyecto de ley sobre IA cuando sea aprobado definitivamente. El Anteproyecto de ley para el buen uso y la gobernanza de la inteligencia artificial, que se tramitará por la vía de urgencia, debe volver al Consejo de Ministros tras el periodo de consulta pública previa, que finaliza el 26 de marzo (durará solo ocho días) y, posteriormente, pasar por las Cortes para que le dé luz verde. El texto podría modificarse durante el proceso, aunque difícilmente lo hará de forma sustancial. Debería entrar en vigor en la primera mitad de este año, en tanto que se establecen algunos deberes, como la elaboración de informes, para agosto de 2025. La nueva normativa desarrolla el Reglamento Europeo de IA, que a su vez estableció un enfoque de clasificación de las aplicaciones de IA de acuerdo con el riesgo que suponen para la sociedad. Así, son de “riesgo inaceptable”, y, por tanto, están prohibidos, los sistemas que trasciendan la conciencia de una persona o técnicas deliberadamente manipuladoras, los que exploten sus vulnerabilidades o las que infieran emociones, raza u opiniones políticas de las personas. Quedan encuadrados en la categoría de “alto riesgo”, que implica una supervisión constante por parte de las autoridades, los sistemas de identificación biométrica remota en diferido, los sistemas de categorización biométrica o el reconocimiento de emociones. También los sistemas que afecten a la seguridad de las infraestructuras críticas y los relacionados con la educación (evaluación de comportamientos, sistemas de admisión y exámenes), el empleo (selección de personal) y la prestación de servicios públicos esenciales, la aplicación de la ley o la gestión de la migración. El resto de aplicaciones se consideran de “bajo riesgo” y se pueden manejar sin restricciones. La normativa prevé la creación de un registro nacional de sistemas de IA en el que quedarán referenciados los de “alto riesgo”. Los sistemas automáticos de reconocimiento facial se pueden usar en España en algunos casos y siempre que se cuente con el consentimiento de los ciudadanos a quienes afecta. La Policía, por ejemplo, recurre a esta tecnología para avanzar en algunas investigaciones. Con un matiz importante: no se pueden usar en espacios públicos en tiempo real (por ejemplo, para identificar o buscar a alguien que pase por la calle). El anteproyecto de ley le dedica un capítulo entero a los sistemas de identificación biométrica (un término que engloba el reconocimiento facial y otras tecnologías) remota en tiempo real, que “están prohibidos, salvo que su uso sea estrictamente necesario”. El Anexo II del anteproyecto de lay fija estos motivos que justificarían su uso: la “búsqueda selectiva de víctimas concretas de secuestro, trata de seres humanos o explotación sexual”, así como “personas desaparecidas”, la “prevención de una amenaza específica, importante e inminente para la vida o la seguridad física de las personas físicas o de una amenaza real y actual o real y previsible de un atentado terrorista”, y la “localización o identificación de una persona sospechosa de haber cometido un delito” grave, como terrorismo, trata de seres humanos, explotación sexual de menores, homicidio, secuestro o violación. La autoridad interesada en usar estos sistemas deberá formular una autorización “para cada caso de uso” en la que se especifiquen los motivos de urgencia, qué persona o personas se quiere identificar, en qué ámbito geográfico y temporal y en qué hechos se apoya la solicitud. Se deberá dar respuesta a la misma en un máximo de 48 horas. En caso de desestimarse la autorización, “se interrumpirá inmediatamente el uso y desechará y suprimirá inmediatamente todos los resultados obtenidos”. Los encargados de autorizar o no el uso de los sistemas biométricos remotos en tiempo real serán los juzgados de lo contencioso-administrativo. Agencia Española de Supervisión de Inteligencia Artificial (Aesia) centralizará la vigilancia de los algoritmos. Con todo, la gestión y tratamiento de datos biométricos será responsabilidad de la Agencia Española de Protección de Datos (AEPD); los sistemas de IA que puedan afectar a la democracia serán competencia de la Junta Electoral Central; y del Consejo General de Poder Judicial dependerán los que puedan incidir en la aplicación de la justicia. Cuando la autoridad de vigilancia estime que un sistema de IA no clasificado como de alto riesgo lo pueda ser, se iniciará un proceso de revisión que deberá resolverse en 72 horas. Asimismo, “cualquier ciudadano, mediante una información anónima, puede dar lugar al inicio del expediente sancionador”, siendo la Aesia la encargada de centralizar estas denuncias. Los primeros informes anuales sobre el uso de sistemas de identificación biométrica remota en tiempo real o en diferido deberán publicarse antes del 31 de diciembre de este año. Asimismo, la Aesia deberá publicar un primer informe antes del 2 de agosto “sobre el estado de los recursos financieros y humanos” de las autoridades nacionales competentes. El nuevo presidente de la AEPD, Lorenzo Cotino, dijo la semana pasada en una reunión con periodistas al que asistió este periódico que, para hacer frente a las nuevas tareas que le encomienda este anteproyecto de ley, la Agencia necesitará un aumento de personal. El anteproyecto de ley establece que, “cuando los sistemas de IA generen contenido sintético de audio, imagen, video o texto”, se deberá “marcar los resultados de salida de tal modo que pueda detectarse su naturaleza artificial”. No se especifica cómo debe ser ese etiquetado, pero sí las sanciones que puede acarrear el no hacerlo (ver apartado siguiente). También será obligatorio informar a las personas físicas de su exposición a un sistema de reconocimiento de emociones o de categorización biométrica. Las infracciones “muy graves” supondrán una multa de entre 7,5 y 35 millones de euros, o entre el 2% y el 7% del volumen de negocios anual mundial. Entran en este supuesto el uso de tecnologías prohibidas, de sistemas de identificación biométrica remota en tiempo real no autorizados, no eliminar los datos de esa identificación si lo requieren las autoridades o no notificar que se está usando esa tecnología. Las infracciones “graves” se penan con entre 7,5 y 15 millones de euros, o entre el 2% y el 3% del volumen de negocios anual mundial. No ponerle marca de agua a un contenido generado por IA, resistirse a aplicar medidas provisionales impuestas por las autoridades o introducir en el mercado aplicaciones de “alto riesgo” sin registrarlas previamente entra en esta categoría. En un tercer escalón están las infracciones “leves”, que comportan multas de entre 6.000 y 500.000 euros, o entre el 0,5% y el 1% del volumen de negocios anual mundial, y que básicamente se impondrán en caso de facilitar información “incompleta inexacta o engañosa” cuando las autoridades lo requieran. La cosa cambia cuando quienes cometen la infracción son las autoridades: en ese caso, los castigos son mucho más suaves. Tanto, que algunos juristas, como Borja Adsuara, lo consideran escandaloso. “¿Para qué incluir en el anexo usos prohibidos por la Administración si no hay ninguna consecuencia? No conozco ni una sanción ni una amonestación a un funcionario o autoridad por un mal tratamiento de datos personales. Con la IA pasará lo mismo”, se queja este experto en derecho digital. Así, el anteproyecto de ley establece que se apercibirá a la entidad actuante y se podrán establecer “las medidas que proceda adoptar para que cese la conducta o se corrijan los efectos de la infracción que se hubiese cometido, excluyendo la imposición de multas administrativas”. Al margen de ello, se contemplan “actuaciones disciplinarias cuando existan indicios suficientes para ello”. En caso de que alguna autoridad pública haga un mal uso de la IA desoyendo informes técnicos previos, se amonestará a los responsables. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "20 mar 2025 - 05:20CET",
        "content_length": 10116,
        "language": "es",
        "scraped_at": "2025-03-26T23:06:10.495888"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-19/la-policia-nacional-deja-de-usar-veripol-su-ia-estrella-para-detectar-denuncias-falsas.html",
        "title": "La Policía Nacional deja de usar Veripol, su IA estrella para detectar denuncias falsas",
        "author": "Author not found",
        "description": "El Ministerio de Interior afirma que han desestimado el uso de la herramienta de inteligencia artificial por carecer de validez en procedimientos judiciales",
        "content": "“Se trata de la primera herramienta de este tipo en el mundo”, afirmaba una nota de prensa publicada por la Policía Nacional. Veripol fue presentada en 2018 como un algoritmo capaz de detectar denuncias falsas de robo con violencia, con una precisión de más del 90%. En octubre de 2024, seis años después, esta IA dejó de estar operativa, según han confirmado a Civio desde el Gabinete Técnico de la Dirección General de Policía. Desde el Ministerio de Interior señalan que el motivo para desestimar su uso es que carece de validez en procedimientos judiciales. El abandono de Veripol llega tres meses después de la publicación en el BOE del Reglamento europeo sobre inteligencia artificial, que incluye los polígrafos entre las IA “de alto riesgo”, para las que se contemplan unas obligaciones muy estrictas en cuanto a revisión, actualización y transparencia. A finales de septiembre, un informe elaborado por especialistas en derecho y matemáticas de la Universidad de Valencia señalaba serias deficiencias en la herramienta. La primera de ellas, la falta de información sobre su funcionamiento. Los trabajos para su puesta en marcha fueron realizados por varios investigadores de las universidades Complutense y Carlos III, y el policía Miguel Camacho-Collados, actualmente responsable de innovación tecnológica y ciberseguridad en el Consejo de Estado. Según explica el artículo académico que detalla su desarrollo, la muestra con la que se entrenó la herramienta estaba compuesta de 1.122 denuncias de robo en España de 2015, de las que 534 eran verdaderas y las restantes 588, falsas. Procesaron los textos de las denuncias con técnicas NLP —simplificándolos para ser procesados automáticamente— y clasificaron las palabras usadas por tipo, descartando todas las que aparecían en menos del 1% de la muestra o en más del 99%. Después aplicaron varios métodos de regresión estadística para elegir qué palabras eran más comunes en denuncias falsas y verdaderas. Como ejemplo, el estudio cita que, según Veripol, si una denuncia contiene las palabras “día”, “abogado”, “seguro” o “espalda” es más probable que sea falsa, más aún si se dice varias veces el número “doscientos” o adverbios como “apenas”. Por el contrario, las denuncias que hagan referencia a autobuses, a una determinada marca de móvil o a una matrícula de un coche es más probable que sean verdaderas. En junio de 2017 se llevó a cabo una prueba piloto en comisarías de Málaga y Murcia. Según afirma el artículo académico, en el 83,54% de las denuncias identificadas como falsas por Veripol el denunciante terminó confesando que había mentido. En diciembre del mismo año la investigación fue premiada por la Fundación de Policía Española, y en 2018 Interior anunció su implementación en todas las comisarías. Según datos de la organización Algorithm Watch, desde su implementación hasta octubre de 2020, Veripol se usó para analizar alrededor de 84.000 denuncias. De las 49.702 denuncias que fueron procesadas en 2019, 2.338 fueron identificadas como falsas tanto por esta herramienta como por otros medios. El estudio de la Universidad de Valencia señala que, en 2022, se usó bastante menos: el número de denuncias analizadas por Veripol bajó a 3.762, de las que 511 se detectaron como falsas. Este mismo informe señala serias deficiencias en la herramienta, que comienzan desde su propio planteamiento: la idea base de que el 57% de las denuncias de robo con violencia que se presentan son falsas, cifra que tiene como referente el alto número de casos de robo sin resolver. También critica lo escaso de la muestra, de poco más de 1.000 denuncias frente a los aproximadamente 60.000 casos de robo con violencia que se registran cada año en España, según el Portal Estadístico de Criminalidad. O la falta de un protocolo de uso y de información sobre la formación impartida a los agentes de policía para su uso. Una noticia publicada en 2020 por La Voz de Galicia alertaba de que la comisaría de Vigo, que contaba con el programa desde 2018, no podía usarlo por la falta de formación de sus agentes. También destaca que las denuncias analizadas por Veripol realmente han sido redactadas por agentes de policía, por lo que no es una reproducción literal de la declaración del denunciante. “No analiza la historia que el posible mentiroso está contándole a la policía, sino que analiza la historia que el propio policía escribe”, subraya el informe, que añade que la herramienta tampoco tiene en cuenta las diferencias de lenguaje entre territorios. Pero, sobre todo, critica la opacidad sobre su uso. “El sistema no es transparente”, concluye el informe de la Universidad de Valencia. “No hay datos oficiales disponibles sobre Veripol en absoluto”, añade. Desde Civio se ha solicitado en febrero de 2023 y, de nuevo, en diciembre de 2024 información sobre el funcionamiento técnico de esta herramienta y sobre su uso, sin que el Ministerio de Interior, a día de hoy, haya dado respuesta ni siquiera sobre el número de comisarías en las que finalmente se implantó. Este artículo se publicó originalmente en Civio, una redacción independiente sin ánimo de lucro que investiga a fondo los asuntos públicos. En febrero de 2023, Civio solicitó al Ministerio de Interior, en virtud de la Ley de Transparencia, las especificaciones técnicas de Veripol, sus casos de uso y cualquier otro documento que permita saber cómo funciona la aplicación y qué informaciones contiene o puede contener. Ante la negativa del Ministerio de Interior a facilitar esta información, presentaron una reclamación ante el Consejo de Transparencia y Buen Gobierno, que el 31 de octubre de ese mismo año resolvió el derecho de acceso y ordenó al Ministerio de Interior a facilitar la información solicitada. La única información finalmente aportada fueron los enlaces a las notas de prensa publicadas por la Policía y por la Universidad Complutense sobre su puesta en funcionamiento y el premio otorgado por la Fundación de Policía Española. En diciembre de 2024, Civio volvió a solicitar información relacionada con Veripol. En concreto, el listado de comisarías en las que se había implantado la herramienta y los datos de uso, entre ellos el número de casos procesados por año y el porcentaje de ellos en los que la herramienta había concluido que la denuncia era falsa. Desde el Ministerio respondieron señalando que habían dejado de usar Veripol el 21 de octubre de 2024 y se negaron a dar datos de uso. Actualmente está activa una reclamación en el Consejo de Transparencia y Buen Gobierno para acceder a estos datos. David Cabo y Ana Villota han participado en la génesis e implementación del juego. En el pre-print del artículo publicado en la revista Knowledge-Based Systems, “Applying automatic text-based detection of deceptive language to police reports: Extracting behavioral patterns from a multi-step classification model to understand how we lie to the police” (Lara Quijano-Sánchez, Federico Liberatore, Jose Camacho Collados y Miguel Camacho-Collados, Cardiff University, 2018), se recogen datos de 2015 sobre la herramienta, así como un listado de 110 términos, traducidos del español al inglés. Civio ha contactado con los autores, pero estos no han facilitado el listado de palabras original en español. Por tanto, para evitar ambigüedades derivadas de la traducción, se han recogido solo aquellas palabras que vienen explicadas con contexto. El listado final de términos, con sus respectivos pesos (a mayor valor, mayor influencia), de palabras que sí aparecen o aparecen con mucha frecuencia determinan que la denuncia es probablemente falsa es: día (0.48), abogado (0.43), seguro (0.24), espalda (7.74), mochila (0.10), hombro (17.99), casco (26.92), iPhone (25.56), Apple (0.23), apenas (?), detrás (0.12), doscientos (0.30), euros (6.81), efectivo (19.18), contrato (19.19). La selección que se ha hecho para el caso de denuncia probablemente verdadera es: autobús (0.52), matrícula (0.19), cadena (16.06), policía (0.31), chino (52.58), cuello (16.62), portal (0.26), descansillo (0.36), incluso (72.31), barba (0.34), centímetro (0.09), delgado (0.09), moreno (0.10), gritar (40.67), agarrar (0.12), doctor (16.75), amigo (0.13). La visualización del juego se ha desarrollado con Svelte.js. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "19 mar 2025 - 05:20CET",
        "content_length": 9076,
        "language": "es",
        "scraped_at": "2025-03-26T23:06:14.658562"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-18/la-amistad-en-las-redes-sociales-puede-convertirse-en-un-trabajo-a-tiempo-completo-para-los-adolescentes.html",
        "title": "La amistad en las redes sociales puede convertirse en un trabajo ‘a tiempo completo’ para los adolescentes",
        "author": "Author not found",
        "description": "Un nuevo estudio sugiere que las expectativas de disponibilidad en los jóvenes con sus amigos podrían llevarlos a experimentar estrés digital",
        "content": "Las redes sociales se han transformado en un lugar de entretenimiento, pero también de reunión para millones de adolescentes en el mundo. La mayoría de los jóvenes tiene al menos una cuenta en plataformas como TikTok o Instagram, lo que hace que muchos cultiven y mantengan amistades en línea. Este tipo de lazos son cruciales en este periodo, ya que existe un cambio de figuras de referencia de los padres hacia los pares. A la larga, sin embargo, el uso constante de estas plataformas como mediadores en la interacción aumenta el riesgo de que los chicos y chicas padezcan estrés digital, ya que estas plataformas los obligan a estar disponibles de manera constante con sus compañeros. Un nuevo estudio publicado hoy martes en la revista Frontiers in Digital Health detectó que los sentimientos de tristeza, enfado o frustración pueden surgir cuando los adolescentes descubren que sus cercanos no están disponibles, lo que puede fomentar los conflictos y malos entendidos. La autora principal e investigadora de la Universidad de Padua (Italia), Federica Angelini junto a sus colegas realizaron una encuesta a más 1.185 adolescentes italianos entre 13 y 18 años a través de subescalas que midieron el grado de conflicto y el comportamiento frente al rechazo en dos fases con seis meses de diferencia. “La decepción por las expectativas no satisfechas en las redes sociales es un predictor más fuerte de los conflictos de amistad que la presión de estar constantemente disponible”, explica Angelini en un comunicado. Así, el sentimiento de pesar causado por un desengaño se convirtió en el aspecto que tiene más probabilidades de provocar peleas entre los jóvenes. Los investigadores descubrieron que las imágenes y los vídeos publicados en las plataformas sociales pueden desempeñar un papel especialmente importante en la forma en que el uso de las redes sociales puede provocar peleas. Para Jesús Conde, catedrático de la Facultad de Ciencias de la Educación en la Universidad de Sevilla, en la adolescencia la aceptación social es clave para el desarrollo de las personas. “El uso de las redes sociales como elemento mediador entre los adolescentes ha hecho que se trasladen a estos escenarios digitales aspectos vinculados a esta búsqueda de aceptación. Esto ha posibilitado que se potencien algunos aspectos negativos”, añade este experto que no participó del estudio. Los efectos del uso de las redes sociales y el estrés digital durante la adolescencia, sin embargo, no se han investigado con profundidad. Un análisis anterior de Nature Communications alertó en 2022 que los adolescentes que más utilizan las redes, son los más vulnerables a sus consecuencias negativas y los que más riesgo corren de perder bienestar social y satisfacción vital. Otro estudio de Journal of adolescent health encontró una asociación entre el estrés digital de los adolescentes y los síntomas depresivos. Estos análisis se ha centrado específicamente en los conflictos entre amigos en las redes sociales a través del tiempo. Por otro lado, el estudio señala que si los adolescentes perciben que sus amigos están activos en línea o pasan tiempo con otras personas mientras ignoran sus mensajes, pueden sentirse excluidos o incluso celosos. “Esta mayor conciencia puede intensificar las emociones negativas y contribuir a la tensión en las amistades”, agrega la experta. Los científicos sostienen que si bien las mujeres pueden tener mayores expectativas de disponibilidad, la dinámica relacional entre los varones se caracteriza por “una mayor aceptación a mantener un estilo de comunicación más asincrónico, permitiendo respuestas retrasadas”. “Toca seguir investigando sobre el fenómeno y paralelamente desde la educación hay que formar a los adolescentes para un uso de las redes sociales más sano y positivo”, opina Conde. Los jóvenes están conectados porque Instagram, TikTok, YouTube o X se han convertido en el espacio crucial y por qué no decirlo, de moda. Identificar los factores estresantes clave, por ejemplo, el contenido visual y las expectativas de disponibilidad, y comprender la dinámica de las interacciones en línea entre amigos puede ayudar a los educadores, padres y tutores legales a desarrollar hábitos más saludables. Uno de esos hábitos para los adolescentes podría ser establecer límites, por ejemplo, programar horarios sin conexión o administrar las notificaciones. Cuando se hace en una conversación con amigos, sostienen los autores del análisis, esto también puede ayudar a reducir los malentendidos. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "18 mar 2025 - 06:00CET",
        "content_length": 5340,
        "language": "es",
        "scraped_at": "2025-03-26T23:06:18.674638"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-17/transforma-tu-coche-con-la-ultima-tecnologia.html",
        "title": "Transforma tu coche con la última tecnología",
        "author": "Author not found",
        "description": "Desde modernizar el salpicadero hasta crear una red Wi-Fi para usar dentro del vehículo, son muchos los dispositivos que pueden llevarse en el coche para que los viajes sean más cómodos y entretenidos ",
        "content": "Seguro que si has montado recientemente en un coche de última generación te habrá sorprendido la gran variedad de tecnologías que ya incorpora para hacer más placenteros y seguros los viajes por carretera. La pequeña pantalla del equipo de audio ha sido sustituida por un completo sistema de entretenimiento en el que, además de navegación, se pueden ver películas, vídeos o acceder a páginas web cuando no se está en movimiento. Además, están equipados con sofisticadas cámaras de vigilancia, asistentes inteligentes que te llevan al destino elegido a través de la voz. Si de momento no tienes pensado comprar un nuevo vehículo, puedes actualizar el tuyo instalando muchos dispositivos que hacen que ir en el coche sea más seguro, cómodo e, incluso, entretenido para los pasajeros. Las dash cam no son otra cosa que una pequeña cámara que se coloca en el vehículo para grabar lo que pasa alrededor del coche y, de paso, tener pruebas en caso de accidente o un acto vandálico. En España no son muy populares, pero en países como Rusia son obligatorias: comenzaron a utilizarse para evitar los fraudes de los peatones que se lanzaban contra los coches, y también para ahorrar papeleo cuando ocurría un accidente. Dicho esto, aquí su uso es totalmente legal, aunque hay que tener en cuenta varias cosas. En primer lugar, la grabación nunca debe ser continua —se consideraría videovigilancia—, aunque eso no es problema, ya que este tipo de gadgets están preparados para activar la grabación solo cuando alguno de sus sensores detecta que está ocurriendo algo. Además, hay que colocarlas en un lugar donde no afecte a la visibilidad y tampoco se puede manipular durante la conducción. Por supuesto, tampoco pueden difundirse las imágenes por redes sociales o de manera pública. ¿Y qué hay de su uso como prueba en un juicio? La decisión de admitirlo o no depende completamente del juez aunque, por norma general, las aseguradoras las consideran interesantes para discernir responsabilidades a nivel interno. Modelos hay muchos; incluso algunos como el 70mai A510 vienen con dos cámaras, una para colocar en la luna delantera y otra en la trasera, y cuentan con funciones como la de la vigilancia incluso cuando el vehículo no está en marcha y detecta incluso actos de vandalismo. Luego todo puede revisarse desde el móvil. Pese a lo que pudiera parecer, cambiar el sistema de sonido del coche por uno con mucho más potencia y calidad no es demasiado difícil, aunque sí muy laborioso. Porque, entre otras cosas, hay que desmontar el interior de la puerta para sacar los antiguos y colocar los nuevos en su lugar. Si se tiene cierta maña en este aspecto se puede hacer, pero si no es mucho mejor que te lo hagan en un taller. Teniendo esto en cuenta, hay muchísimas opciones con distinta potencia, dimensiones… Por ejemplo, los altavoces de las puertas pueden sustituirse por modelos como los JVC CS-J620X —uno de los más populares desde hace una década—, y completarlos con un subwoofer como el Pioneer TS-WX140DA, que puede colocarse debajo del asiento del conductor para realzar los bajos. ¿El resultado? Música que se escucha mucho mejor que con el sistema original del coche y que no distorsiona, aunque subas el volumen. Los cargadores del móvil compatibles con la carga inalámbrica como el Belkin BoostCharge Pro son ideales para cargar el móvil sin cables a la vez que su pantalla queda visible —el cargador se instala en una rejilla de ventilación en el salpicadero— para seguir las instrucciones del GPS, por ejemplo. Este es uno de los modelos más recientes y es compatible con el sistema de carga inalámbrica Qi2, que permite cargar a una velocidad de 15W. Al igual que utilizamos los asistentes inteligentes en casa a través del televisor, los altavoces o el teléfono móvil, también es posible recurrir a ellos desde el coche. Lo cierto es que, desde hace tiempo, los vehículos más modernos incorporan Android Auto o Apple CarPlay, que convierten el coche en una extensión del teléfono móvil, pero los que no lo tienen pueden instalar un pequeño dispositivo como el Amazon Echo Auto. Conectado por USB o al mechero del coche, podemos realizar preguntas generales, pedirles que controlen aparatos domóticos, que elaboren una lista de la compra, pongan música o resuman las noticias del día, entre otros. También que nos guíen hasta un destino y que nos digan dónde hemos dejado el coche. En este sentido, resultan también interesantes los localizadores GPS, más orientados a robos. Aunque hay algunos que se instalan en el coche, con otros como el Invoxia GPS Tracker Classic no es necesario. Basta con llevarlo dentro para poder rastrear dónde está el vehículo en todo momento, sin límite de distancia (los localizadores Bluetooth tienen de límite la distancia a la que le reconoce el teléfono). Hay que tener en cuenta, eso sí, que normalmente están asociados a una suscripción mensual. Y pensando tanto en el entretenimiento de los pasajeros como en el streaming de música, crear una red Wi-Fi para todos los dispositivos del vehículo es tan sencillo como instalar un punto de acceso Wi-Fi. Lo más sencillo es recurrir a un dispositivo Mi-Fi como TP-Link M7000, que crean una red con solo introducir una tarjeta SIM en su interior y realizar una rápida configuración desde una app. Hay otros muchos dispositivos pensados para el coche. Desde un aspirador como el Baseus A2 Pro Car, cuya boquilla estrecha cabe en las ranuras de los asientos y con una potencia suficiente para limpiar tierra o restos de comida; hasta un purificador de aire portátil —Philips tiene el Go Pure GP6201— que monitoriza su estado y lo limpia en caso necesario; es algo que reduce, por ejemplo, la somnolencia que provoca el aire muy cargado. Los amantes del café también pueden hacérselo sobre la marcha con cafeteras como Presso XI, quienes no recuerdan dónde han aparcado; y la comida se mantiene refrigerada en neveras con conector para el mechero como Bolero TravelCooling 29L D de Cecotec, que luego puedes desconectar y llevar a la playa o a hacer un picnic. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "17 mar 2025 - 05:20CET",
        "content_length": 6871,
        "language": "es",
        "scraped_at": "2025-03-26T23:06:21.134604"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-15/mision-reducir-el-cansancio-en-la-vista-al-usar-dispositivos-electronicos.html",
        "title": "Misión: reducir el cansancio en la vista al usar dispositivos electrónicos",
        "author": "Author not found",
        "description": "Ordenadores, tablets, smartphones y hasta eReaders incluyen tecnologías para reducir la cantidad de luz azul que emiten sus pantallas ",
        "content": "Si en algún momento has escuchado o leído que la luz azul que emiten las pantallas de los dispositivos electrónicos puede provocar daños en los ojos, puedes estar tranquilo: no es así. La Asociación Americana de Oftalmología y la Sociedad Española de Oftalmología reconocen que en la actualidad no hay evidencia científica que ratifique los daños permanentes ni a largo plazo en la retina. Así lo recogía también hace unas semanas Conchi Lillo, bióloga, doctora en neurociencias e investigadora sobre las enfermedades de la retina en el Instituto de Neurociencias de Castilla y León y el Instituto de Investigación Biomédica de Salamanca (IBSAL), en el consultorio científico semanal Nosotras respondemos. Sin embargo, los especialistas sí coinciden al hablar de molestias temporales cuando se pasa mucho tiempo frente a una pantalla: ojo seco, visión borrosa, lagrimeo, dolor de cabeza… Todo manifestaciones de lo que se conoce como cansancio visual —también llamado “síndrome del informático”—, que se produce principalmente porque parpadeamos menos de lo normal al fijar la mirada en la pantalla. “No hay ningún estudio que demuestre que se produzca algún daño en ninguna estructura ocular. Lo que sí produce la luz azul es cansancio ocular”, constata el Dr. Pablo Catalán Muñoz, oftalmólogo y miembro de Grupo Top Doctors. Teniendo esto en cuenta, son muchos los fabricantes de dispositivos como ordenadores, smartphones o tabletas que están apostando por distintas tecnologías para reducir la luz azul en sus y disminuir en alguna medida estos efectos. “Un filtro de pantalla de luz azul da algo más de descanso visual, que sería el único efecto que parece que puede tener”, confirma Catalán. Lo más común a la hora de tratar de reducir la fatiga visual es que incluyan algún tipo de tecnología capaz de atenuar la cantidad de luz azul que emiten. Ya lo tienen los televisores Neo QLED y QLED de Samsung, los monitores de AOC o los portátiles de Asus, entre otros muchos ejemplos. Algunos, incluso, han certificado esa característica. En este sentido, el sello más popular —muy habitual en smartphones— es TÜV Rheinland, que somete a los dispositivos a una serie de pruebas basadas en el cansancio de la vista, el daño ocular que puede provocar y la calidad de la imagen. ¿Sabías que incluso Windows 10 tiene una función destinada a este propósito? Se encuentra en el apartado ‘Pantalla’ dentro de la configuración del sistema, en una opción denominada ‘Configuración de luz nocturna’: aquí se personaliza la cantidad de luz azul que deseamos que emita la pantalla, y elegir cuándo deseamos que se active. También lo tienen los iPhone y iPad (Night Shift, que se activa desde las opciones de brillo) y los dispositivos Android (en ajustes de la pantalla). Buena parte de la fatiga visual que puede provocar el uso de dispositivos se elimina en los eReaders, ya que sus pantallas de tinta electrónica no emiten luz, sino que la reflejan, imitando la lectura en papel. Como estas superficies no permitían leer cuando no había buena luz ambiental, poco a poco empezaron a incorporar sistemas de iluminación propios; de nuevo, haciendo que esta luz iluminara el papel, pero que no se dirigiera a los ojos, por lo que no afecta como una pantalla LED o LCD. Aun así, estos dispositivos también incluyen tecnologías que buscan facilitar la lectura de noche reduciendo la luz azul, lo que provoca que sus pantallas se vuelvan de color naranja como por arte de magia al llegar la tarde. Es una característica que incorporan una buena parte de los modelos de distintos fabricantes aunque, eso sí, en algunos este ajuste se hace de forma automática y, en otros, es necesario realizarlo manualmente. Por ejemplo, en el nuevo Kindle Paperwhite o en el Kobo Clara Colour. Además, en los últimos tiempos se ha popularizado la opción de intercambiar color de fuente y de fondo: la primera se pondría de color blanco, mientras el segundo pasaría a ser negro. En un primer momento, era una característica orientada a la accesibilidad y, por lo tanto, a facilitar la lectura a personas con problemas de visión. Pero su gran utilidad al leer por la noche hace que ahora sea un ajuste que se recomiende a cualquier persona. Por último, hablemos de otro tipo de medidas de protección de la vista, relacionadas sobre todo con acercarse demasiado a una pantalla o fuente de luz; algo que también está relacionado con la fatiga ocular. Por ejemplo, los modelos de iPhone y iPad tienen la función ‘Distancia de pantalla’, que usa su cámara frontal para detectar si te acercas el dispositivo a menos de 30 centímetros y te recuerda que debes alejarlo. Y el proyector portátil Nébula Astro, especialmente pensado para utilizar con niños, incorpora la tecnología Eye Guard Tech, que apaga automáticamente el dispositivo cuando detecta cualquier objeto dentro de una distancia que puede establecerse en 20, 40 o 60 centímetros.  ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "15 mar 2025 - 05:20CET",
        "content_length": 5722,
        "language": "es",
        "scraped_at": "2025-03-26T23:06:23.723528"
    },
    {
        "source": "El País Tecnología",
        "category": "technology",
        "region": "europe",
        "country": "spain",
        "url": "https://elpais.com/tecnologia/2025-03-14/lo-que-sabemos-sobre-los-ciberataques-rusos-a-webs-espanolas-pueden-ser-la-punta-del-iceberg.html",
        "title": "Lo que sabemos sobre los ciberataques rusos a webs españolas: “Pueden ser la punta del iceberg”",
        "author": "Author not found",
        "description": "Varios grupos de hackers han lanzado decenas de ataques a instituciones y empresas españolas desde que Pedro Sánchez escenificó hace tres semanas su apoyo a Ucrania",
        "content": "El presidente del Gobierno, Pedro Sánchez, se reunió en Kiev con su homólogo ucranio el pasado 24 de febrero. Allí anunció ayudas por valor de 1.000 millones de euros anuales durante una década para apoyar el esfuerzo bélico del país. Dos días después del encuentro, se desató una campaña de ciberataques contra objetivos institucionales y empresariales españoles que todavía está activa. Las intrusiones han sido reivindicadas por grupos de hackers rusos y se inscriben en lo que Sánchez ha llamado la guerra híbrida que sostiene Moscú contra los países de la UE. “Con estos ataques queremos decirle al gobierno (sic) español que deje de apoyar a Ucrania. Si esto no sucede (sic) pasaremos a las webs gubernamentales. Y también a las grandes empresas”, publicó el grupo de hackers rusos TwoNet en un grupo de Telegram el pasado 3 de marzo. Entre las víctimas que han confirmado serlo o cuyas intrusiones han sido identificadas por la comunidad hacker se cuentan ayuntamientos, diputaciones, consejerías de comunidades autónomas y ministerios como los de Interior, Defensa, Exteriores o Inclusión, Seguridad Social y Migraciones. El Centro Criptológico Nacional (CCN-CERT), el Estado Mayor de la Defensa (EMAD) o el Departamento de Seguridad Nacional también han sido atacados, igual que La Moncloa, la Casa Real, fundaciones como el Real Instituto Elcano o Cidob, empresas como El Corte Inglés o Legálitas y medios como Newtral. La mezcla de objetivos no es casual: se combinan ataques a sistemas presumiblemente poco defendidos, como los de los ayuntamientos o diputaciones, con los de las instituciones más representativas del poder soberano (Moncloa, Defensa, Interior o CCN). “Estos ciberataques buscan notoriedad y crear la sensación de que estamos desprotegidos”, sostiene Marcelino Madrigal, experto en redes y ciberseguridad. La mayoría de ciberataques registrados en las últimas tres semanas (al menos 70, según fuentes consultadas) son de denegación de servicio distribuido (DDoS), que consisten en saturar los sistemas bombardeando los servidores con un aluvión de solicitudes. “Una vez caídas, los atacantes hacen una captura de pantalla como prueba de su éxito y la exhiben como un trofeo”, apunta Hervé Lambert, director de operaciones globales de Panda Security. Esta variedad de ciberataques, de muy baja complejidad técnica, logran interrumpir los servicios de los sistemas objetivo, aunque no borran datos. “De manera general, lo que hemos visto son interrupciones puntuales y breves, que no han tenido tampoco consecuencias duraderas en la operatividad”, señalan fuentes del Instituto Nacional de Ciberseguridad (Incibe). Se ha identificado a al menos siete grupos de hackers vinculados a Rusia como autores de la campaña de ciberataques. Entre los más activos se cuentan TwoNet o NoName057, pero también han participado otros, como People’s Cyber Army of Russia, Cyber Army of Russia Reborn, KillNet o Z-Pentest. “Aunque no se puede confirmar con certeza, probablemente están ligados de una u otra forma al gobierno ruso y a sus intereses”, asegura José Rosell, consejero delegado de S2Grupo. Es casi imposible atribuir la procedencia de un ciberataque si quien lo perpetra tiene suficientes conocimientos técnicos y quiere pasar desapercibido. De ahí que muchos gobiernos recurran extraoficialmente a la arena cibernética para realizar acciones de sabotaje. Poco se sabe de los equipos de hackers rusos involucrados en la campaña contra España, más allá de su autorreivindicada entrega a una causa común (la defensa de los intereses de Rusia) y de que se comunican entre sí mediante Telegram, la popular aplicación de mensajería instantánea de origen ruso. Usan ese canal para difundir sus comunicados y apuntar sus objetivos a través de convocatorias a las que se pueden sumar hackers autónomos. Están operativos desde que se inició la guerra, aunque en las últimas semanas han aumentado notablemente su actividad. “No habría que magnificar estos ataques, que son más bien rutinarios. Tienen un alto componente de propaganda”, apuntan a este periódico fuentes del CCN-CERT. Curiosamente, a estos grupos de hackers rusos se han sumado otros de distinta procedencia, como Mr Hamza, de Argelia; un grupo hacktivista islamista de Malasia, Dxploit, o el grupo antiisraelí Dark Storm, que se ha atribuido esta misma semana un ciberataque que afectó a X. “Me llama la atención que Dark Storm haya intensificado su actividad en España durante la última semana, justo cuando lo hacen los grupos rusos. Es muy difícil saber si es por coincidencia, oportunismo o coordinación”, dice David Arroyo Guardeño, investigador principal del grupo Ciberseguridad y Protección de la Privacidad del CSIC. A este cóctel hay que sumarle grupos pro rusos ubicados en España, que difunden los comunicados de los hackers y apoyan su trabajo. “Hay muchos canales de desinformación pro rusa que son los mismos que se declaran anti agenda 2030, que habían participado en las tractoradas o que difundieron propaganda antivacunas durante la pandemia. Parece claro que son células permanentes que buscan hacer ruido y desestabilizar al Gobierno”, aventura Madrigal. “Los ataques DDoS son molestos, pero no producen grandes daños”, apunta Madrigal. Y añade: “Estas campañas también se utilizan para sondear el nivel de seguridad que tiene una víctima de cara a futuros ataques”. Esa es precisamente una de las incógnitas que rodean a los ciberataques que sufre España: si su intensidad irá disipándose con el paso del tiempo o si son el prolegómeno de algo mayor todavía por llegar. Volcado en los últimos días en argumentar por qué España debe aumentar el gasto militar, el presidente del Gobierno ha inscrito esta campaña en la llamada guerra híbrida que sostiene Moscú contra buena parte de la UE. “Tuvimos la semana pasada un ciberataque que llegaba de Rusia”, reconoció el presidente el miércoles en Helsinki tras entrevistarse con su homólogo finlandés, Petteri Orpo. “Es importante enfrentarnos a un debate troncal [sobre el aumento del gasto militar]”, dijo. “Los ataques DDoS a veces se usan como cortina de humo para encubrir operaciones más dañinas”, añade Lambert. “Al distraer la atención de los técnicos para reparar la caída visible, los atacantes podrían aprovechar la distracción para infiltrarse por otra vía, robar datos sensibles o implantar malware [código malicioso] sin ser detectados”. Esta segunda tarea, más sofisticada, recaería en otra modalidad de hackers: las llamadas amenazas persistentes avanzadas (APT), equipos patrocinados por países compuestos por profesionales con capacidades equivalentes a las de los servicios secretos. “Rusia cuenta con grupos de ciberespionaje militar altamente sofisticados, como APT28 (Fancy Bear) y APT29 (Cozy Bear) –del SVR, inteligencia exterior–, que han estado activos en objetivos españoles”, abunda Lambert. Este experto recuerda que, en 2023, APT28 fue acusado de lanzar campañas de phishing (suplantación de identidad mediante comunicaciones fraudulentas) contra empresas de la industria de defensa española como Navantia para robar credenciales y datos tecnológicos sensibles. El mismo grupo habría atacado ese año redes internas de ministerios españoles, según informes del CNI. Por su parte, APT29 logró acceder también en 2023 a servicios en la nube del sector público español mediante correos comprometidos enviados desde embajadas. “Los ataques DDoS recientes en España han sido principalmente un acto de ciberguerra de bajo nivel e impacto limitado, a modo de represalia visible por el apoyo a Ucrania. Sin embargo, no deben tomarse a la ligera: además de su efecto propagandístico y disruptivo momentáneo, pueden ser la punta del iceberg de una estrategia más amplia”, opina Lambert. ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
        "date": "14 mar 2025 - 05:20CET",
        "content_length": 8571,
        "language": "es",
        "scraped_at": "2025-03-26T23:06:25.805515"
    }
]